Repository: pypi-data/pypi-mirror-18
Catalog: packages/djangocms-page-meta/djangocms_page_meta-0.7.0-py2.py3-none-any.whl/djangocms_page_meta/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Google+ Snippets
ru: Сниппеты Google+

source: Meta-information
ru: Мета информация

source: Common
ru: Общие

source: Article
ru: Статья

source: Website
ru: Веб сайт

source: Summary
ru: Краткое описание

source: Summary large image
ru: Основное изображение к описанию

source: Product
ru: Продукт

source: Photo
ru: Фото

source: Player
ru: Игрок

source: App
ru: Приложение

source: Blog
ru: Блог

source: Book
ru: Книга

source: Event
ru: Событие

source: LocalBusiness
ru: Локальный бизнес

source: Organization
ru: Организация

source: Person
ru: Личность

source: Review
ru: Обзор

source: Used if title image is empty.
ru: Используется, если изображение отсутствует

source: Resource type
ru: Тип ресурса

source: Use Article for generic pages.
ru: Использовать статью для общих страниц

source: Author account
ru: Аккаунт автора

source: Author Facebook URL
ru: URL автора на Facebook

source: Author Facebook ID
ru: ID автора на Facebook

source: Use Facebook numeric ID.
ru: Использовать номерной идентификатор Facebook

source: Website Facebook URL
ru: Адрес веб сайта на Facebook

source: Facebook App ID
ru: ID приложения на Facebook

source: Author Twitter Account
ru: Аккаунт автора на Twitter

source: "@" sign not required.
ru: знак "@" не требуется.

source: Website Twitter Account
ru: Аккаунт сайта на Twitter

source: Author Google+ URL
ru: URL автора на Google+

source: Use the Google+ Name (together with "+") or the complete path to the page.
ru: Используйте Google+ Имя (вместе со знаком "+") или полную ссылку на страницу.

source: Page meta info (all languages)
ru: Мета информация страницы(для всех языков)

source: If empty, page image will be used for all languages.
ru: Если оставить пустым, изображение страницы будет использовано для всех языков.

source: Facebook Description
ru: Описание на Facebook

source: Twitter Description
ru: Описание на Twitter

source: Google+ Description
ru: Описание на Google+

source: Page meta info (language-dependent)
ru: Мета информация страницы(языкозависимая)
