Repository: pypi-data/pypi-mirror-18
Catalog: packages/djangocms-page-meta/djangocms-page-meta-0.7.0.tar.gz/djangocms-page-meta-0.7.0/djangocms_page_meta/locale/*/LC_MESSAGES/django.po
Languages: tr

source: Google+ Snippets
tr: Google+ parçacıkları

source: Meta-information
tr: Meta-bilgiler

source: Common
tr: Genel

source: Article
tr: Makale

source: Summary
tr: Özet

source: Summary large image
tr: Özet için büyük resim

source: Product
tr: Ürün

source: Photo
tr: Fotograf

source: Player
tr: Oyuncu

source: App
tr: Uygulama

source: Book
tr: Kitap

source: Event
tr: Olay

source: LocalBusiness
tr: Yerel işletme

source: Organization
tr: Örgüt/İşletme

source: Person
tr: Kişi

source: Review
tr: Yorum

source: Used if title image is empty.
tr: Başlık resmi olmadığında kullanılır

source: Resource type
tr: Kaynak tipi

source: Use Article for generic pages.
tr: Makaleyi genel sayfalar için kullan

source: Author account
tr: Yazarın hesabı

source: Author Facebook URL
tr: Yazarın Facebook URL'i

source: Author Facebook ID
tr: Yazarın Facebook ID'si

source: Use Facebook numeric ID.
tr: Facebook ID'yi kullan

source: Website Facebook URL
tr: Web sitenin Facebook'taki URL'si

source: Facebook App ID
tr: Facebook Uygulama ID'si

source: Author Twitter Account
tr: Yazarın Twitter hesabı

source: "@" sign not required.
tr: "@" simgesi gerekmemektedir.

source: Website Twitter Account
tr: Web sitenin Twitter hesabı

source: Author Google+ URL
tr: Yazarın Google+ URL'si

source: Use the Google+ Name (together with "+") or the complete path to the page.
tr: Google+ Hesab Adını kullan("+" simgesi ile birlikte) yada hesabın web adresini.

source: Page meta info (all languages)
tr: Sayfanın meta bilgileri(tüm diller)

source: If empty, page image will be used for all languages.
tr: Eğer boş ise, sayfanın resmi tüm diller için kullanılacaktır

source: Facebook Description
tr: Facebook özeti

source: Twitter Description
tr: Twitter özeti

source: Google+ Description
tr: Google+ özeti

source: Page meta info (language-dependent)
tr: Sayfanın meta bilgileri(dil bağımlı)
