Repository: pypi-data/pypi-mirror-18
Catalog: packages/LinOTP/LinOTP-2.9.0.5.tar.gz/LinOTP-2.9.0.5/linotp/i18n/*/LC_MESSAGES/linotp.po
Languages: es, fr, it

source: Summary
es: Resumen
fr: Sommaire
it: Sommario

source: Realms
es: Dominios
fr: Domaines
it: Regni

source: Unable to instantiate the resolver %rPlease verify configuration or connection!
es: No se puede definir el solucionador %r¡Por favor, compruebe la configuración o la conexión!
fr: Impossible d'initier le résolveur %rVeuillez vérifier la configuration ou la connexion !
it: Impossibile creare un'istanza del resolver % rSi prega di verificare configurazione o connessione!

source: The name of the policy may only contain the characters a-zA-Z0-9_
es: El nombre de la directriz solo puede contener los caracteres a-zA-Z0-9_.
fr: Le nom de la directive ne peut contenir que les caractères a-zA-Z0-9_
it: Il nome del criterio può contenere solo i caratteri a-zA-Z0-9_.

source: The name of the policy must not be empty
es: El nombre de la directriz no puede estar vacío.
fr: Le nom de la directive ne doit pas être vide
it: Il nome del criterio non può essere vuoto.

source: Thank you for your interest in our products.
es: Gracias por su interés en nuestros productos.
fr: Merci de votre intérêt pour nos produits.
it: Grazie per l'interesse mostrato per i nostri prodotti

source: Your current LinOTP Smart Virtual Appliancedemo license is about to expire in a few days. For licenses for productive use or an extended evaluation period,
es: Su licencia Smart Virtual Appliancedemo LinOTP actual está a punto de caducar. Para licencias de uso productivo o un periodo de evaluación extendido,
fr: Votre licence actuelle de demo LinOTP Smart Virtual Appliance expirera d'ici quelques jours. Pour obtenir des licences destinées à un usage productif ou pour prolonger votre période d'essai,
it: La vostra attuale LinOTP Licenza Smart Virtual Appliancedemo scadrà tra pochi giorni. Per licenze per uso produttivo o per un periodo di valutazione più esteso,

source: please contact us
es: por favor, póngase en contacto con nosotros
fr: veuillez nous contacter
it: per favore contattateci

source: If you have questions about our products or your evaluation we are happy to answer your inquiry. We would also like to learn about your feedback concerning our products and your evaluation.
es: Si tienes preguntas sobre nuestros productos o su evaluación, estaremos encantado de responder. También nos gustaría conocer su opinión acerca de nuestros productos y su evaluación.
fr: Nous serons heureux de répondre à toutes vos questions sur nos produits ou votre évaluation. Nous souhaiterions également recevoir vos commentaires sur nos produits et votre évaluation.
it: Se avete domande sui nostri prodotti o sulla vostra valutazione saremo lieti di rispondervi. Vorremmo anche conoscere la vostra opinione relativamente ai nostri prodotti ed alla vostra valutazione.

source: Sales hotline:
es: Servicio telefónico de ventas:
fr: Assistance téléphonique commerciale
it: Hotline vendite:

source: You are not authenticated
es: No está autenticado
fr: Vous n'êtes pas authentifié
it: Non sei autenticato

source: No valid authentication session %r
es: No es una sesión de autenticación válida %r
fr: Aucune session d'identification valide %r
it: Sessione di autenticazione non valida % r

source: No valid session
es: No es una sesión válida
fr: Pas de session valide
it: Nessuna sessione valida

source: The token you want to assign is not contained in your realm!
es: El token que desea asignar no está incluido en su dominio.
fr: Le token que vous souhaitez attribuer ne se trouve pas dans votre domaine !
it: Il token che desideri assegnare non è nel tuo Realm!

source: The token is already assigned to another user.
es: El token ya está asignado a otro usuario.
fr: Le token est déjà attribué à un autre utilisateur.
it: Il token è già assegnato a un altro utente.

source: valid types are 'oathtoken' and 'googleauthenticator' and 'googleauthenticator_time'. You provided %s
es: Tipos válidos son 'oathtoken', 'googleauthenticator' o 'googleauthenticator_time'. Se ha indicado %s
fr: Les types valides sont "oathtoken", "googleauthenticator" et "googleauthenticator_time". Il a été entré %s
it: I tipi validi sono 'oathtoken', 'googleauthenticator' o 'googleauthenticator_time'. %s

source: getotp is not activated.
es: 'getotp' no está activo
fr: 'getotp' n'est pas actif
it: 'getotp' non è attivo

source: The serial %s does not belong to user %s@%s
es: El número de serie %s no pertenece al usuario %s@%s
fr: Le numéro de série %s n'appartient pas à l'utilisateur %s@%s
it: Il numero di serie %s non appartiene all'utente %s@%s

source: see policy definition.
es: consulte la definición de directrices.
fr: voir la définition de la directive.
it: vedi definizione criteri.

source: selfservice/usergetmultiotp failed: %r
es: Error al acceder al autoservicio/usergetmultiotp: %r
fr: self-service/utilisateursemultioptéchoué:% r
it: Errore durante selfservice/usergetmultiotp: %r

source: audit/search failed: %s
es: Error durante la búsqueda en el registro de auditoría: %s
fr: Erreur de recherche dans le journal d'audit : %s
it: Errore durante la ricerca nell'Audit Log: %s

source: valid types are 'ocra' or 'ocra2'. You provided %s
es: Valores válidos son 'ocra' o 'ocra2'. Usted ha introducido %s
fr: Les valeurs valides sont "ocra" ou "ocra2". Vous avez entré %s
it: I valori validi sono 'ocra' o 'ocra2'. E' stato indicato %s

source: Missing required parameter "state" or "transactionid"!
es: ¡Falta el parámetro obligatorio «estado» o «transactionid»!
fr: Le paramètre requis « statut » ou « numéro de transaction » est manquant !
it: Manca il parametro necessario "state" o "transactionid"!

source: Missing required parameter "serial" or "user"!
es: ¡Falta el parámetro obligatorio «serie» o «usuario»!
fr: Le paramètre requis « série » ou « utilisateur » est manquant !
it: Manca il parametro necessario "serial" o "user"!

source: Missing required parameter "pass"!
es: ¡Falta el parámetro obligatorio «pase»!
fr: Le paramètre requis « réussi » est manquant !
it: Manca il parametro necessario "pass"!

source: You do not have the rights to see these realms: %r. Check the policies!
es: No tiene derechos para ver estos dominios: %r. ¡Compruebe las directrices!
fr: Vous n'avez pas le droit de consulter les domaines suivants %r. Vérifiez les règles !
it: Non hai diritto di monitorare i seguenti regni% r. Controlla termini e condizioni!

source: Support not available, your product is unlicensed
es: No hay asistencia de soporte técnico
fr: Aucun soutien par le support
it: Nessun supporto di assistenza

source: License already installed!
es: ¡Licencia ya instalada!
fr: Licence déjà installée
it: La licenza è stata già installata!

source: license file is empty!
es: ¡El archivo de licencia está vacío!
fr: Le fichier de licence est vide !
it: Il file di licenza è vuoto!

source: signature could not be verified!
es: ¡La firma no es válida!
fr: La signature n'est pas valide !
it: La firma non è valida!

source: no license expiration information in license
es: No hay información sobre la fecha de caducidad de la licencia
fr: Aucune information concernant la date d'expiration de la licence
it: Non sono disponibili informazioni circa la data di scadenza della licenza

source: no license subscription information in license
es: No hay información relativa a la suscripción de la licencia
fr: Aucune information concernant l'abonnement dans la licence
it: Nessuna informazione relativa all'abbonamento nella licenza

source: invalid license (old license style)
es: Licencia no válida (formato de licencia anterior)
fr: Licence non valable (format de licence ultérieur)
it: licenza non valida (vecchio formato licenza)

source: tokens used
es: Token usado
fr: token utilisé
it: token utilizzati

source: tokens supported
es: Token con licencia
fr: token sous license
it: token su licenza

source: unsupported date format date %r
es: Formato de fecha no compatible %r
fr: Format de date non pris en charge %r
it: Formato data non supportato % r

source: expired - valid till
es: expirado - válido hasta
fr: expiré - valable jusqu'au
it: scaduto - valido fino al

source: get_token_owner: The user %s/%s and the token %s is located in several realms: %s!
es: getTokenOwner: El usuario %s/%s y el token %s están incluidos en varios dominios: %s.
fr: getTokenOwner : l'utilisateur %s/%s et le token %s sont contenus dans plusieurs domaines : %s.
it: getTokenOwner: l'utente %s/%s e il token %s sono contenuti in diversi Realm: %s.

source: get_token_owner: The user %s in the resolver %s for token %s could not be found in any realm!
es: getTokenOwner: No se ha podido encontrar al usuario %s en el solucionador %s para el token %s en ningún dominio.
fr: getTokenOwner : l'utilisateur %s du résolveur %s concernant le token %s n'a pu être trouvé dans aucun domaine !
it: getTokenOwner: l'utente %s nel resolver %s per il token %s non è stato trovato in nessun Realm!

source: OTP seed
es: Semilla OTP
it: Seme OTP

source: URL for OCRA token
es: URL para token OCRA
fr: URL pour le token OCRA
it: URL per token OCRA

source: The provided PIN is too short. It should be at least %i characters.
es: El PIN introducido es demasiado corto. Debe contener al menos %i caracteres.
fr: Le code PIN entré est trop court. Il devrait avoir au moins %i caractères.
it: Il PIN inserito è troppo breve. Deve contenere almeno %i caratteri.

source: The provided PIN is too long. It should not be longer than %i characters.
es: El PIN introducido es demasiado largo. Debe contener como máximo %i caracteres.
fr: Le code PIN entré est trop long. Il devrait avoir au maximum %i caractères.
it: Il PIN inserito è troppo lungo. Deve contenere al massimo %i caratteri.

source: The provided PIN does not contain characters of the group or it does contains characters that are not in the group %s
es: El PIN introducido no está formado por los caracteres de la definición de caracteres o contiene caracteres que no están en la definición de caracteres: %s
fr: Le code PIN entré ne se compose pas de caractères de la définition des caractères ou contient des caractères qui ne sont pas dans la définition des caractères : %s
it: Il PIN inserito non è costituito da caratteri della definizione caratteri o contiene caratteri che non sono presenti nella definizione caratteri: %s

source: The provided PIN does not contain any letters. Check policy otp_pin_contents.
es: El PIN introducido no contiene letras como debería según la directriz 'otp_pin_content'.
fr: Le code PIN entré ne contient pas de lettres conformément à la directive "otp_pin_content".
it: Il PIN inserito non contiene lettere in conformità al criterio 'otp_pin_content'.

source: The provided PIN does not contain any numbers. Check policy otp_pin_contents.
es: El PIN introducido no contiene números como debería según la directriz 'otp_pin_content'.
fr: Le code PIN entré ne contient pas de chiffres conformément à la directive "otp_pin_content".
it: Il PIN inserito non contiene numeri secondo il criterio 'otp_pin_content'.

source: The provided PIN does not contain any special characters. It should contain some of these characters like .: ,;-_<>+*~!/()=?$. Check policy otp_pin_contents.
es: El PIN introducido no contiene ningún carácter especial como debería según la directriz 'otp_pin_content'. Los caracteres especiales pueden ser .: ,;-_<>+*~!/()=?$.
fr: Le code PIN entré ne contient pas de caractères spéciaux conformément à la directive "otp_pin_content". Les caractères spéciaux peuvent être : ,;-_<>+*~!/()=?$.
it: Il PIN inserito non contiene alcun carattere speciale secondo il criterio 'otp_pin_content'. I caratteri speciali possono essere:,; -_ <> * ~ / () = $.!?.

source: The provided PIN does not contain any other characters. It should contain some of these characters that are not contained in letters, digits and the defined special characters. Check policy otp_pin_contents.
es: El PIN introducido no contiene ningún carácter especial como debería según la directriz 'otp_pin_content'. El PIN debe incluir algunos de estos caracteres especiales que no son letras ni dígitos.
fr: Le code PIN entré ne contient pas de caractères spéciaux conformément à la directive "otp_pin_content". Le code PIN doit inclure certains de ces caractères spéciaux qui ne sont ni des lettres ni des chiffres, mais du domaine des caractères spéciaux.
it: Il PIN inserito non contiene alcun carattere particolare secondo il criterio 'otp_pin_content'. Il PIN dovrebbe includere alcuni di questi caratteri particolari che non sono né lettere, né cifre né provengono dal campo dei caratteri speciali.

source: The PIN contains letters, although it should not! (%s)
es: El PIN introducido contiene letras, aunque esto no debería ser así (%s)
fr: Le code PIN contient des lettres, bien que cela ne devrait pas être le cas (%s)
it: Il PIN contiene lettere, anche se non dovrebbe essere così (%s)

source: The PIN contains digits, although it should not! (%s)
es: El PIN introducido contiene números, aunque esto no debería ser así (%s)
fr: Le code PIN contient des chiffres, bien que cela ne devrait pas être le cas (%s)
it: Il PIN contiene cifre, anche se non dovrebbe essere così (%s)

source: The PIN contains special characters, although it should not! (%s)
es: El PIN introducido contiene caracteres especiales, aunque esto no debería ser así (%s)
fr: Le code PIN contient des caractères spéciaux, bien que cela ne devrait pas être le cas (%s)
it: Il PIN contiene caratteri speciali, anche se non dovrebbe essere così (%s)

source: The PIN contains other characters, although it should not! (%s)
es: El PIN introducido contiene caracteres especiales, aunque esto no debería ser así (%s)
fr: Le code PIN contient des caractères particuliers, bien que cela ne devrait pas être le cas (%s)
it: Il PIN contiene caratteri particolari, anche se non dovrebbe essere così (%s)

source: You do not have any rights in any realm! Check the policies.
es: No tiene derechos en todos los dominios: compruebe las directrices.
fr: Vous avez pas de droit dans tous les domaines : vérifiez les directives.
it: Non disponi di diritti in tutti i Realm: controlla i criteri.

source: You do not have the administrative right to remove token %s. Check the policies.
es: No tiene derechos de administrador para eliminar el token %s. Si es necesario, compruebe las directrices.
fr: Vous ne disposez pas de droits d'administration afin de supprimer le token %s - si nécessaire, vérifiez les directives.
it: Non disponi dei diritti amministrativi per eliminare il token %s - Controlla eventualmente i criteri.

source: You do not have the administrative right to enable token %s. Check the policies.
es: No tiene derechos de administrador para activar el token %s. Si es necesario, compruebe las directrices.
fr: Vous ne disposez pas de droits d'administration afin d'activer le token %s - si nécessaire, vérifiez les directives.
it: Non disponi dei diritti amministrativi per attivare il token %s - Controlla eventualmente i criteri.

source: You may not enable any more tokens. Your maximum token number is reached!
es: Se ha alcanzado el número máximo de token. No es posible activar ningún token más.
fr: Le maximum de token a été atteint - aucun autre token ne peut être activé.
it: E' stato raggiunto il massimo dei token - non si possono attivare ulteriori token.

source: You may not enable any more tokens in realm %s. Check the policy 'tokencount'
es: No es posible activar más token en el dominio %s. Si es necesario, compruebe la directriz 'tokencount'.
fr: Aucun autre token ne peut être activé dans le domaine %s . Si nécessaire, vérifiez la directive 'tokencount'.
it: Non si possono attivare ulteriori token nel Realm %s . Controllare eventualmente il criterio 'tokencount'.

source: You do not have the administrative right to disable token %s. Check the policies.
es: No tiene derechos de administrador para desactivar el token %s. Si es necesario, compruebe las directrices.
fr: Vous ne disposez pas de droits d'administration afin de désactiver le token %s - si nécessaire, vérifiez les directives.
it: Non disponi dei diritti amministrativi per disattivare il token %s - Controlla eventualmente i criteri.

source: You do not have the administrative right to copy PIN of token %s. Check the policies.
es: No tiene derechos de administrador para copiar el PIN del token %s. Si es necesario, compruebe las directrices.
fr: Vous ne disposez pas de droits d'administration afin de copier le code PIN du token %s - Si nécessaire, vérifiez les directives.
it: Non disponi dei diritti amministrativi per copiare il PIN del token %s - Controlla eventualmente i criteri.

source: You do not have the administrative right to copy user of token %s. Check the policies.
es: No tiene derechos de administrador para copiar usuarios del token %s. Si es necesario, compruebe las directrices.
fr: Vous ne disposez pas de droits d'administration afin de copier l'utilisateur du token %s - Si nécessaire, vérifiez les directives.
it: Non disponi dei diritti amministrativi per copiare l'utente del token %s - Controlla eventualmente i criteri.

source: You do not have the administrative right to run the losttoken workflow for token %s. Check the policies.
es: No tiene derechos de administrador para iniciar el proceso 'Lost Token' para el token %s . Si es necesario, compruebe las directrices.
fr: Vous ne disposez pas de droits d'administration afin de lancer le processus 'Lost token' pour le token %s - Si nécessaire, vérifiez les directives.
it: Non disponi dei diritti amministrativi per avviare il processo di 'Lost token' per il token %s - Controlla eventualmente i criteri.

source: You do not have the administrative right to run the getotp workflow for token %s. Check the policies.
es: No tiene derechos de administrador para iniciar el proceso 'getotp' para el token %s. Si es necesario, compruebe las directrices.
fr: Vous ne disposez pas de droits d'administration afin de lancer le processus 'getotp' pour le token %s - Si nécessaire, vérifiez les directives.
it: Non disponi dei diritti amministrativi per avviare il processo di 'getotp' per il token %s - Controlla eventualmente i criteri.

source: You do not have the administrative right to get serials by OTPs in this realm!
es: No tiene derechos de administrador para identificar los números de serie a través de los OTP en este dominio. Si es necesario, compruebe las directrices.
fr: Vous ne disposez pas de droits d'administration pour identifier le numéro de série dans ce domaine via OTP - Si nécessaire, vérifiez les directives.
it: Non disponi dei diritti amministrativi per individuare in questo Realm il numero di serie tramite OTP - Controlla eventualmente i criteri.

source: Due to license restrictions no more tokens could be enrolled!
es: Debido a restricciones de licencia, ¡no pueden inscribirse más tokens!
fr: Aucun token supplémentaire n'a pu être déployé à cause des restrictions de licences !
it: In ragione delle restrizioni della licenza non possono essere aggiunti altri tokens

source: The tokentype '%s' could not be found.
es: No se ha podido encontrar el tipo de token '%s'.
fr: Le type de token '%s' n'a pas été trouvé.
it: Il tipo di token '%s'non è stato trovato.

source: You do not have the administrative right to init token %s of type %s to user %s@%s. Check the policies.
es: No tiene derechos de administrador para implementar el token %s de tipo %s para el usuario %s@%s. Si es necesario, compruebe las directrices.
fr: Vous ne disposez pas de droits d'administration pour déployer le token %s de type %s pour l'utilisateur %s@%s - Si nécessaire, vérifiez les directives..
it: Non disponi dei diritti amministrativi per srotolare il token %s di tipo %s per l'utente %s@%s - Controlla eventualmente i criteri.

source: You do not have the administrative right to enroll tokens. Check the policies.
es: No tiene derechos de administrador para implementar el token. Si es necesario, compruebe las directrices.
fr: Vous ne disposez pas de droits d'administration afin de déployer le token - Si nécessaire, vérifiez les directives.
it: Non disponi dei diritti amministrativi per srotolare token - Controlla eventualmente i criteri.

source: You do not have the administrative right to init token %s of type %s.
es: No tiene derechos de administrador para implementar el token %s de tipo %s.
fr: Vous ne disposez pas de droits d'administration afin de déployer le token %s de type %s .
it: Non disponi dei diritti amministrativi per srotolare il token %s di tipo %s .

source: You may not enroll any more tokens. Your maximum token number is reached!
es: Se ha alcanzado el número máximo de token. No puede implementar ningún token más.
fr: Le nombre maximum de token a été atteint. Vous ne pouvez plus déployer des token supplémentaires.
it: È stato raggiunto il numero massimo di token. Non è possibile ottenere altri token.

source: The maximum allowed number of tokens for the realm %s was reached. You can not init any more tokens. Check the policies scope=enrollment, action=tokencount.
es: Se ha alcanzado el número máximo de token dentro del dominio %s. No puede implementar ningún token más en este dominio. Por favor, consulte la directriz scope=enrollment, action=tokencount.
fr: Le nombre maximum de token dans le domaine %s a été atteint. Vous ne pouvez plus déployer de token dans ce domaine. Veuillez vérifier la directive scope=enrollment, action=tokencount.
it: Il numero massimo di token all'interno del Realm %s è stato raggiunto. Non è più possibile srotolare altri token in questo Realm. Verifica il criterio scope=enrollment, action=tokencount.

source: The maximum number of allowed tokens per user is exceeded. Check the policies scope=enrollment, action=maxtoken
es: Se ha alcanzado el número máximo de token por usuario. Por favor, consulte la directriz scope=enrollment, action=tokencount.
fr: Le nombre maximum de token par utilisateur a été atteint. Veuillez vérifier la directive scope=enrollment, action=tokencount.
it: Il numero massimo di token per utente è stato raggiunto. Verifica il criterio scope=enrollment, action=tokencount.

source: You do not have the administrative right to unassign token %s. Check the policies.
es: No tiene derechos de administrador para cancelar la asignación de usuarios al token %s. Si es necesario, compruebe las directrices.
fr: Vous ne disposez pas de droits d'administration afin de supprimer l'attribution de l'utilisateur pour le token %s - Si nécessaire, vérifiez les directives.
it: Non disponi dei diritti amministrativi per cancellare l'assegnazione utente per il token %s - Controlla eventualmente i criteri.

source: You do not have the administrative right to assign token %s. Check the policies.
es: No tiene derechos de administrador para asignar usuarios al token %s. Si es necesario, compruebe las directrices.
fr: Vous ne disposez pas de droits d'administration pour l'attribution de l'utilisateur pour le token %s - Si nécessaire, vérifiez les directives.
it: Non disponi dei diritti amministrativi per l'assegnazione utente per il token %s - Controlla eventualmente i criteri.

source: the maximum number of allowed tokens is exceeded. Check the policies
es: Se ha superado el número máximo de token con licencia. Si es necesario, compruebe las directrices.
fr: Le nombre maximum de token sous licence a été dépassé - Si nécessaire, vérifiez les directives.
it: Il numero massimo di token su licenza è stato superato - Controlla eventualmente i criteri.

source: Missing parameter: %r
es: Falta el parámetro: %r
fr: Paramètre manquant : %r
it: Parametro mancante: %r
