Repository: pypi-data/pypi-mirror-18
Catalog: packages/LinOTP/LinOTP-2.9.0.5.tar.gz/LinOTP-2.9.0.5/linotp/i18n/*/LC_MESSAGES/linotp.po
Languages: es, fr, it

source: Delete selected tokens?
es: ¿Eliminar token seleccionados?
fr: Supprimer le token sélectionné ?
it: Eliminare i token selezionati?

source: Delete tokens
es: Eliminar token
fr: Supprimer le token
it: Elimina token

source: Enrolled the token
es: El token
fr: Le token
it: Il token

source: for user
es: se ha implementado para los usuarios
fr: a été déployé pour l'utilisateur
it: è stato srotolato per l'utente

source: token enrollment
es: Token implementado
fr: Token déployé
it: Token srotolato

source: Token serial:
es: Número de serie:
fr: Numéro de série :
it: Numero di serie:

source: The token was lost? You may enroll a temporary token and automatically disable the lost token.
es: ¿Se ha perdido el token? Puede implementar un token temporal nuevo. En este caso, el token perdido se desactivará automáticamente.
fr: Le token a été perdu ? Vous pouvez déployer un nouveau token temporaire. Dans ce cas, le token perdu est automatiquement désactivé.
it: Il token è stato perso? È possibile srotolare un nuovo token temporaneo. Il token perduto viene disattivato automaticamente.

source: - Select Temporary Token Type -
es: - Seleccionar tipo de token temporal -
fr: - Sélectionner le type de token temporaire -
it: - Selezionare tipo di token temporaneo -

source: Simple Password Token
es: Token de contraseña sencilla
fr: Token avec mot de passe simple
it: Token password semplice

source: Email Token
es: Token del correo electrónico
fr: Token e-mail

source: Lost Token
es: Token perdido
fr: Token perdu
it: Token perso

source: Token Info
es: Información de token
fr: Infos token
it: Info Token

source: Hashlib
es: Algoritmo Hash
fr: Algorithme Hash
it: Algoritmo Hash

source: Counter Window
es: Ventana del contador
fr: Fenêtre du compteur
it: Finestra contatore

source: Max Fail Counter
es: Valor máximo para el contador de errores
fr: Valeur maximale pour le compteur d'erreurs
it: Valore massimo per il contatore errori

source: Max Auth Count
es: Número máximo de intentos de autenticación
fr: Tentatives d'authentification maximales
it: Tentativi massimi di autenticazione

source: Max Successful Auth Count
es: Número máximo de autenticaciones correctas
fr: Authentifications réussies maximales
it: Autenticazioni massime riuscite

source: Validity start
es: Comenzar período de validez
fr: Début de la période de validité
it: Inizio del periodo di validità

source: Validity end
es: Finalizar período de validez
fr: Fin de la période de validité
it: Fine del periodo di validità

source: Time Window
es: Intervalo de tiempo
fr: Fenêtre temporelle
it: Finestra temporale

source: Time Shift
es: Retardo
fr: Décalage temporel
it: Ritardo temporale

source: Time Step
es: Unidad de tiempo
fr: Incrément de temps
it: Step temporale

source: set Hashlib
es: ajustar algoritmo Hash
fr: Définir l'algorithme Hash
it: Impostazione dell'algoritmo Hash

source: set OTP length
es: ajustar longitud de OTP
fr: Définir la longueur OTP
it: Impostazione della lunghezza OTP

source: set Counter Window
es: ajustar ventana del contador
fr: Définir la fenêtre du compteur
it: Impostazione della finestra contatore

source: set Max Failcount
es: ajustar contador de errores
fr: Définir le compteur d'erreurs
it: Impostazione del contatore errori

source: set Max Auth Count
es: ajustar el número máximo de intentos de autenticación
fr: Définir les tentatives d'authentification maximales
it: Impostazione dei tentativi massimi di autenticazione

source: set Max Successful Auth Count
es: ajustar el número máximo de autenticaciones correctas
fr: Définir les authentifications réussies maximales
it: Impostazione delle autenticazioni massime riuscite

source: Mobile phone number
es: Número de teléfono móvil
fr: Numéro de téléphone mobile
it: Numero di cellulare

source: set Sync Window
es: ajustar ventana de resincronización
fr: Définir la fenêtre de resynchronisation
it: Impostazione della finestra di risincronizzazione

source: set Time Window
es: ajustar intervalo de tiempo
fr: Définir la fenêtre temporelle
it: Impostazione della finestra temporale

source: set Time Shift
es: ajustar tiempo de retardo
fr: Définir le décalage temporel
it: Impostazione del ritardo temporale

source: set Time Step
es: ajustar unidad de tiempo
fr: Définir l'incrément de temps
it: Impostazione dello step temporale

source: set Description
es: ajustar descripción
fr: Définir la description
it: Impostazione della descrizione

source: You may resync the token:
es: Resincronización del token:
fr: Resynchronisation du token :
it: Risincronizzazione del token:

source: Therefor please enter two OTP values.
es: Para ello, introduzca dos valores OTP consecutivos.
fr: Pour cela, veuillez entrer deux valeurs OTP consécutives.
it: Immetti due valori OTP consecutivi.

source: Resync Token
es: Sincronizar token
fr: Synchroniser le token
it: Sincronizzare Token

source: Resync
es: Sincronizar
fr: Synchroniser
it: Sincronizza

source: Define to which realms the token(s) shall belong to:
es: Defina a qué dominios debe pertenecer este token:
fr: Définissez à quel domaine ce token doit appartenir :
it: Definisci a quale Realm deve appartenere questo token:

source: You may add realms by holding down Ctrl-Key and left-clicking.
es: Puede añadir dominios manteniendo pulsada la tecla Ctrl y haciendo clic con el botón izquierdo.
fr: Vous pouvez ajouter des domaines, en maintenant enfoncée la touche Ctrl et en effectuant un clic gauche.
it: È possibile aggiungere dei Realm tenendo premuto il tasto Ctrl e cliccando a sinistra.

source: Edit Realms of Token
es: Editar dominios del token
fr: Éditer des domaines du token
it: Modificare i Realm del token

source: Set Realm
es: Establecer dominio de token
fr: Définir le domaine du token
it: Impostare Tokenrealm

source: You may get OTP values for token:
es: Para este token puede solicitar valores OTP:
fr: Pour ce token, vous pouvez demander les valeurs OTP :
it: Per questo token è possibile richiedere i valori OTP:

source: Enter the number, how many OTP values you want to retrieve:
es: Por favor, introduzca el número de valores OTP que deben solicitarse:
fr: Veuillez entrer le nombre de valeurs OTP requises :
it: Inserisci il numero dei valori OTP da richiedere:

source: Get OTP values
es: Solicitar valores OTP
fr: Demander les valeurs OTP
it: Richiedere valori OTP

source: The following Tokens will be unassigned from the their users:
es: Se eliminarán las asignaciones de los token siguientes:
fr: Les attributions des token suivants seront supprimées :
it: Le assegnazioni dei seguenti token vengono rimosse:

source: The users will not be able to authenticate with this token anymore. Are you sure?
es: El usuario dejará de poder autenticarse con este token. ¿Está seguro?
fr: Les utilisateurs ne seront plus en mesure de s'authentifier en utilisant ce token. Êtes-vous sûr ?
it: Gli utenti non saranno più in grado di effettuare l'autenticazione usando questo token. Procedere?

source: Unassign selected tokens?
es: ¿Revocar asignación de los token seleccionados?
fr: Annuler l'attribution des token sélectionnés ?
it: Cancellare l'assegnazione del token selezionato?

source: Do you want to delete the realm
es: Desea eliminar el dominio
fr: Souhaitez-vous supprimer le domaine ?
it: Si vuole eliminare il Realm

source: Deleting realm
es: eliminar dominio
fr: Supprimer le domaine
it: Eliminazione Realm

source: Do you want to delete the resolver?
es: ¿Desea eliminar este solucionador?
fr: Souhaitez-vous supprimer le résolveur ?
it: Si vuole eliminare il resolver?

source: Deleting resolver
es: Eliminar solucionador
fr: Supprimer le résolveur
it: Eliminazione il resolver

source: Token enrolled. Use the old PIN with the new password.
es: Se ha implementado el token temporal. El usuario debe usar su PIN antiguo junto con la contraseña nueva.
fr: Le token temporaire a été déployé. L'utilisateur doit utiliser son ancien code PIN avec le nouveau mot de passe.
it: Il token temporaneo è stato srotolato. L'utente deve utilizzare il vecchio codice PIN insieme alla nuova password.

source: The temporary token can be used till the end date.
es: El token temporal puede utilizarse hasta la fecha de caducidad.
fr: Le token temporaire peut être utilisé jusqu'à la date d'expiration.
it: Il token temporaneo può essere utilizzato fino alla data di scadenza.

source: Password
es: Contraseña
fr: Mot de passe

source: End date
es: Fecha de caducidad
fr: Date d'expiration
it: Data di scadenza

source: New Temporary Token
es: Token temporal nuevo
fr: Nouveaux token temporaires
it: Nuovo token temporaneo

source: Server Configuration
es: Configuración del servidor
fr: Configuration du serveur
it: Configurazione del server

source: Resolver name
es: Nombre del solucionador
fr: Nom du résolveur
it: Nome resolver

source: Server-URI
es: URI del servidor
fr: Serveur URI
it: URI Server

source: CA Certificate
es: Certificado CA
fr: Certificat CA
it: Certificato CA

source: If you are using LDAPS you can enter the CA certificate in PEM format here.
es: Si utiliza LDAPS, puede copiar aquí el certificado CA en formato PEM.
fr: Si vous utilisez LDAPS, vous pouvez copier le certificat CA au format PEM ici.
it: Se si utilizza LDAPS, è possibile copiare qui il certificato CA in formato PEM.

source: BaseDN
es: Basis DN
fr: DN de base
it: Basis DN

source: Bind Password
es: Contraseña Bind
fr: Bind mot de passe
it: Password Bind

source: Sizelimit
es: Límite de tamaño
fr: Limite de taille
it: Limite di dimensione

source: No anonymous referral chasing
es: Sin seguimiento anónimo de las referencias
fr: Pas de suivi anonyme des Referrals
it: Nessuna tracciatura anonima del referral

source: Test LDAP Server connection
es: Probar conexión al servidor LDAP
fr: Serveur LDAP tester la connexion
it: Testare la connessione LDAP Server

source: Testing connection ...
es: Probar conexión...
fr: Test de la connexion...
it: Test di connessione ...

source: LDAP attributes
es: Atributos LDAP
fr: Attributs LDAP
it: Attributi LDAP

source: Mapping Attributes
es: Atributos de correlación
fr: Mapping Attribute
it: Attributi di mappatura

source: LoginName Attribute
es: Nombre de usuario del atributo
fr: Attribut nom de connexion
it: Attributo Nome Login

source: Searchfilter
es: Filtro de búsqueda
fr: Filtre de recherche
it: Filtro di ricerca

source: Userfilter
es: Filtro de usuarios
fr: Filtre utilisateur
it: Filtro utenti

source: Attribute mapping
es: Asignación de atributos
fr: Association des attributs
it: Associazione attributi

source: The UID (unique identifier) for your LDAP objects - could be DN, GUID or entryUUID (LDAP) or objectGUID (Active Directory)
es: El UID (identificador único) para los objetos LDAP; podría ser DN, GUID o entryUUID (LDAP), o objectGUID (directorio activo).
fr: L'UID (unique identifier) pour les objets LDAP pourrait être DN, GUID ou entryUUID (LDAP) ou objectGUID (Active Directory).
it: L'UID (identificatore unico) per gli oggetti LDAP, potrebbe essere DN, GUID o entryUUID (LDAP) o objectGUID (Active Directory).

source: UID Type
es: Tipo de UID
fr: Type UID
it: Tipo UID

source: Preset Active Directory
es: Preasignar para directorio activo
fr: Prédéfinir pour Active Directory
it: Pre-allocazioni per Active Directory

source: Preset LDAP
es: Preasignar LDAP
fr: Prédéfinir LDAP
it: Pre-allocazioni LDAP

source: LDAP Resolver
es: Solucionador LDAP
fr: Résolveur LDAP
it: Resolver LDAP

source: Test LDAP connection
es: Probar conexión LDAP
fr: Tester la connexion LDAP
it: Testare la connessione LDPA

source: Preset AD
es: Preasignar AD
fr: Prédéfinir AD
it: Preallocazioni AD

source: Resolver name:
es: Nombre del solucionador
fr: Nom du résolveur
it: Nome resolver:

source: Server-URI:
es: URI del servidor:
fr: Serveur URI
it: URI Server:

source: CA Certificate:
es: Certificado CA:
fr: Certificat CA
it: Certificato CA:

source: Auth User:
es: Auth Usuario:
fr: Auth utilisateur
it: Autenticazione utente:

source: Test HTTP Server connection
es: Probar conexión al servidor HTTP
fr: Tester la connexion serveur HTTP
it: Test sulla connessione server HTTP

source: Testing connection ...
es: Probando conexión...
fr: Test de la connexion...
it: Test di connessione ...

source: JSON Configuration
es: Configuración JSON
fr: Configuration JSON
it: Configurazione JSON

source: URL path:
es: Ruta URL:
fr: Chemin URL
it: Percorso URL:

source: Parameters:
es: Parámetros:
fr: Paramètres :
it: Parametri:

source: Result path:
es: Ruta resultante:
fr: Chemin du résultat :
it: Percorso risultati:

source: Attribute mapping:
es: Mapeo de atributos:
fr: Configuration des attributs
it: Attribuisci mappatura:

source: Server config
es: Configuración del servidor
fr: Configuration du serveur
it: Configurazione del server

source: Driver
es: Controlador
fr: Pilote

source: Server
es: Servidor
fr: Serveur

source: Port
es: Puerto
it: Porta

source: Database
es: Base de datos
fr: Base de données

source: Database table
es: Tabla de la base de datos
fr: Table de base de données
it: Tabella database

source: Limit
es: Límite
fr: Limite
it: Limite

source: Database encoding
es: Codificación de la base de datos
fr: Codage de la base de données
it: Codifica database

source: Additional connection parameters
es: Parámetros de conexión adicionales
fr: Autres paramètres de connexion
it: Ulteriori parametri di connessione

source: Test SQL connection
es: Probar conexión SQL
fr: Tester la connexion SQL
it: Testare la connessione SQL

source: Testing connections...
es: Probar conexión LDAP...
fr: Tester la connexion LDAP...
it: Test della connessione LDAP...

source: SQL attributes
es: Atributos de SQL
fr: Attributs SQL
it: Attributi SQL

source: Where statement
es: Instrucción Where
fr: Déclaration where
it: Istruzione where

source: SQL Resolver
es: Solucionador SQL
fr: Résolveur SQL
it: Resolver SQL

source: File configuration
es: Configuración del archivo
fr: Configuration du fichier
it: Configurazione file

source: filename
es: Nombre del archivo
fr: Nom du fichier
it: Nome file

source: File Resolver
es: Solucionador del archivo
fr: Résolveur du fichier
it: Resolver file

source: Resyncing of token failed
es: Se ha producido un error en la resincronización del token.
fr: Échec de la resynchronisation du token.
it: La risincronizzazione del token non è riuscita.

source: Resynced token successfully
es: El token se ha sincronizado correctamente.
fr: Le token a été synchronisé avec succès
it: Il token è stato sincronizzato con successo.

source: set PIN successfully
es: PIN configurado correctamente.
fr: Le code PIN a été défini avec succès.
it: PIN impostato correttamente.

source: When displaying Token information you may only select one single Token.
es: Si desea mostrar información del token, debe seleccionar un único token.
fr: Si vous souhaitez afficher les informations du token, veuillez ne sélectionner qu'un seul token.
it: Se si desidera visualizzare informazioni sul token, selezionare un unico token.

source: When retrieving the token type you may only select one single Token.
es: Si desea determinar el tipo de token, debe seleccionar un único token.
fr: Si vous souhaitez déterminer le type de token, veuillez ne sélectionner qu'un seul token.
it: Se si desidera determinare il tipo di token, selezionare un unico token.

source: Error: unknown tokentype in function token_enroll()
es: Error: tipo de token desconocido en la función <em>token_enroll()</em>.
fr: Erreur : type de jeton inconnu dans la fonction <em>token_enroll()</em>.
it: Errore: tipo di token sconosciuto nella funzione <em>token_enroll()</em>.

source: Could not find a token for this OTP value.
es: No se ha podido determinar ningún token para este valor OTP.
fr: Aucun token n'a pu être déterminé pour cette valeur OTP.
it: Non è stato possibile rilevare alcun token per questo valore OTP.

source: Error finding a token to this OTP value.
es: Error al obtener un token para este valor OTP.
fr: Erreur lors de la détection d'un token pour cette valeur OTP.
it: Errore durante il rilevamento di un token per questo valore OTP.

source: Failed to communicate to LinOTP server
es: ¡Error en la comunicación con el servidor de LinOTP!
fr: Impossible de communiquer avec le serveur LinOTP !
it: Comunicazione con il server LinOTP fallita!

source: unknown token type to load!
es: ¡Tipo de token desconocido durante la importación!
fr: Type de jeton inconnu lors de l'import !
it: Tipo di token sconosciuto durante l'importazione!

source: You may only upload support subscription files ending with .pem
es: El archivo de soporte que está cargando debe tener la extensión <em>.pem</em>.
fr: Le fichiers de support que vous téléchargez doit avoir l'extension de fichier <em>.pem</em>.
it: Il file di supporto che si sta caricando deve avere l'estensione file <em>.pem</em>.

source: Error saving SMS configuration. Please check your configuration and your server
es: Error al guardar la configuración del proveedor de SMS. Por favor, compruebe la configuración en el servidor.
fr: Erreur lors de l'enregistrement de la configuration du fournisseur d'accès SMS. Veuillez vérifier la configuration sur le serveur.
it: Errore durante il salvataggio della configurazione provider SMS. Verifica la configurazione sul server.

source: Error saving system configuration. Please check your configuration and your server
es: Error al guardar la configuración del sistema. Por favor, compruebe la configuración en el servidor.
fr: Erreur lors de l'enregistrement de la configuration du système. Veuillez vérifier la configuration sur le serveur.
it: Errore durante il salvataggio della configurazione di sistema. Verifica la configurazione sul server.

source: Error saving system checkboxes configuration. Please check your configuration and your server
es: Error al guardar las casillas de verificación del sistema. Por favor, compruebe la configuración en el servidor.
fr: Erreur lors de l'enregistrement des cases du système. Veuillez vérifier la configuration sur le serveur.
it: Errore durante il salvataggio delle caselle di controllo di sistema. Verifica la configurazione sul server.

source: Regexp error in realm. You need to select ONE realm to set it as default.
es: Error en la expresión regular del dominio. Solo puede seleccionar <em>un</em> dominio como dominio predeterminado.
fr: Erreur dans l'impression normale du domaine. Vous ne devez sélectionner qu' <em>un</em> domaine pour le définir comme domaine par défaut.
it: Errore nell'espressione regolare del Realm. Seleziona solo <em>un</em>Realm per farlo diventare Realm di default.

source: There is an error in the realm name!
es: ¡Error en el nombre del dominio!
fr: Erreur dans le nom de domaine !
it: Errore nel nome Realm!

source: Policy set.
es: Directriz guardada.
fr: Directive enregistrée.
it: Criterio salvato.

source: Policy name is not defined!
es: ¡El nombre de la directriz no está definido!
fr: Le nom de la directive n'est pas défini !
it: Il nome del criterio non è definito!

source: Policy deleted.
es: Directriz eliminada.
fr: Directive supprimée.
it: Criterio eliminato.

source: Error fetching list!
es: ¡Error al solicitar lista!
fr: Erreur lors de la récupération de la liste !
it: Errore nel richiamo dell'elenco!

source: created token with serial
es: Token generado correctamente. Número de serie:
fr: Token généré avec succès. Numéro de série :
it: Token generato con successo. Numero di serie:

source: losttoken failed
es: Token perdido fallido
fr: Échec du token perdu
it: Token perso fallito

source: set token PIN failed
es: Error al establecer el PIN del token
fr: Échec du réglage du code PIN
it: Impostazione PIN token fallita

source: Error while fetching the tokentype
es: Error al determinar el tipo de token
fr: Erreur lors de la détermination du type de token
it: Errore durante la determinazione del tipo di token

source: Error creating token
es: Error al generar el token
fr: Erreur lors de la création du token
it: Errore durante la creazione del token

source: Failed
es: Error
fr: Échoué
it: Fallito

source: Failed to import token
es: Error al importar el token
fr: Échec de l'import du token
it: Importazione del token fallita

source: Token import result
es: Resultado de la importación del token
fr: Résultat de l'import du token
it: Risultato dell'importazione token

source: Failed to import policies
es: Error al importar las directrices
fr: Échec de l'import des directives
it: Importazione criteri fallita

source: Policy import result
es: Resultado de la importación de las directrices
fr: Résultat de l'import des directives
it: Risultato dell'importazione criteri

source: Failed to load support subscription
es: Error en el registro de los datos de soporte
fr: Échec de l'enregistrement des données de support
it: La registrazione dei dati di supporto non è riuscita

source: Support subscription import result
es: Resultado del registro de soporte
fr: Résultat de l'enregistrement du support
it: Risultato della registrazione di supporto

source: Error saving ldap configuration.
es: Error al guardar la configuración LDAP.
fr: Erreur lors de la sauvegarde de la configuration LDAP.
it: Errore durante il salvataggio della configurazione LDAP

source: Error saving realm configuration.
es: Error al guardar la configuración del dominio
fr: Erreur lors de la sauvegarde de la configuration du domaine
it: Errore durante il salvataggio della configurazione Realm

source: Realm created
es: Dominio creado
fr: Domaine créé
it: Realm inserito

source: Error setting Token realms
es: Error al establecer el dominio del token
fr: Erreur lors du réglage du token du domaine
it: Errore di impostazione del Realm token

source: Error saving file configuration
es: Error al guardar la configuración del archivo
fr: Erreur lors de la sauvegarde de la configuration du fichier
it: Errore durante il salvataggio della configurazione file

source: Error saving sql configuration
es: Error al guardar la configuración SQL
fr: Erreur lors de la sauvegarde de la configuration SQL
it: Errore durante il salvataggio della configurazione SQL

source: Resolver deleted successfully
es: El solucionador se ha eliminado correctamente
fr: Le résolveur a été supprimé avec succès
it: Il Resolver è stato eliminato con successo

source: Failed deleting resolver
es: Error al eliminar el solucionador
fr: Échec de la suppression du résolveur
it: Eliminazione del Resolver fallita

source: Realm deleted
es: Dominio eliminado
fr: Domaine supprimé
it: Realm eliminato

source: Failed deleting Realm
es: Error al eliminar el dominio
fr: Échec de la suppression du domaine
it: Eliminazione del Realm fallita

source: Error in regular expression for
es: Error en la expresión regular para
fr: Erreur lors de l'impression normale pour
it: Errore nell'espressione regolare per

source: LDAP Server configuration seems to be OK! Number of users found
es: La configuración del servidor LDAP parece estar bien. Número de usuarios encontrados
fr: La configuration du serveur LDAP semble OK ! Nombre des utilisateurs trouvés
it: configurazione del server LDAP sembra OK! Numero di utenti trovati

source: Error loading LDAP resolver
es: Error al cargar solucionador de LDAP
fr: Erreur lors du chargement du résolveur LDAP
it: Errore durante il caricamento del Resolver LDAP

source: HTTP Server configuration seems to be OK! Number of users found
es: ¡La configuración del servidor HTTP parece correcta! Número de usuarios encontrados
fr: La configuration du serveur HTTP semble OK ! Nombre d'utilisateurs trouvés
it: La configurazione del server HTTP sembra OK! Numero di utenti trovati

source: Error loading HTTP resolver
es: Error al cargar el solucionador HTTP
fr: Erreur lors du chargement du résolveur HTTP
it: Errore durante il caricamento del Resolver HTTP
