Repository: pypi-data/pypi-mirror-18
Catalog: packages/LinOTP/LinOTP-2.9.0.5.tar.gz/LinOTP-2.9.0.5/linotp/i18n/*/LC_MESSAGES/linotp.po
Languages: es, fr, it

source: Please enter or copy the init-secret, that was generated by your app and the PIN you are using on your phone.
es: Por favor, introduzca la semilla de inicialización que la aplicación ha generado en su teléfono. Indique también el PIN que ha utilizado en el teléfono.
fr: Veuillez entrer le seed d'initialisation. Il a été généré par l'application sur votre téléphone. En outre, saisissez le code PIN que vous avez utilisé sur le téléphone.
it: Inserisci il seed di inizializzazione generato dall'app sul telefono. Inoltre, inserisci il PIN utilizzato sul telefono.

source: Init secret
es: Semilla Inic
fr: Init Seed
it: Init Seed

source: (again)
es: (repetir)
fr: (répéter)
it: (ripetere)

source: Register mOTP
es: Registrar token de la mOTP
fr: Enregistrer le token mOTP
it: Registrare token mOTP

source: Register your mOTP Token
es: Registrar token de la mOTP
fr: Enregistrer le token mOTP
it: Registrare token mOTP

source: Init Secret of motp-Token
es: Semilla de inicialización del token mOTP
fr: Seed d'initialisation du token mOTP
it: Seed di inizializzazione del token mOTP

source: mOTP PIN
es: PIN de la mOTP
fr: Code PIN mOTP

source: mOTP PIN (again)
es: PIN de la mOTP (repetir)
fr: Code PIN mOTP (répéter)
it: mOTP PIN (ripetere)

source: register mOTP Token
es: Registrar token de la mOTP
fr: Enregistrer le token mOTP
it: Registrare token mOTP

source: OCRA2 Token
es: Token OCRA2
fr: Token OCRA2
it: Token OCRA2

source: OCRA2 token settings
es: Ajustes del token OCRA2
fr: Paramètres du token OCRA2
it: Impostazioni token OCRA2

source: Maximum concurrent OCRA2 challenges
es: Número máximo de desafíos OCRA2 simultáneos
fr: Nombre maximum de défis simultanés OCRA2
it: Numero massimo di challenge simultanee OCRA2

source: This is the maximum concurrent challenges per OCRA2 Token.
es: Este es el número máximo de desafíos OCRA2 simultáneos que pueden solicitarse para un token OCRA2.
fr: C'est le nombre maximum de défis OCRA2 simultanés, qui peuvent être demandés pour un token OCRA2.
it: Questo è il numero massimo di challenge simultanee OCRA2, che possono essere richieste per un token OCRA2.

source: OCRA2 challenge timeout
es: Tiempo de espera para el desafío OCRA2
fr: Délai d'attente pour le défi OCRA2
it: Timeout per challenge OCRA2

source: After this time a challenge can not be used anymore. Valid entries are like 1D, 2H or 5M where D=day, H=hour, M=minute.
es: Después de ese tiempo se descartará un desafío OCRA. Entradas válidas son, p. ej., 1D, 2H o 5M, donde D = día, H = hora, M = minutos.
fr: Passé ce délai, un défi OCRA est jeté. Les saisies valables sont, par exemple, 1D, 2H ou 5M. Cela signifie D = jour, H = heure, M = minute.
it: Trascorso questo tempo verrà scartata una challenge OCRA. Immissioni valide sono, ad esempio. 1D, 2H o 5M, in cui D = giorno, H = ora, M = minuto.

source: OCRA2 - challenge/response Token
es: OCRA2 - Token de desafío/respuesta
it: OCRA2 - token Challenge / Response

source: Please enter or copy the OCRA2 key.
es: Por favor, introduzca la clave de OCRA2.
fr: Veuillez entrer la clé OCRA2.
it: Inserisci la chiave OCRA2.

source: OCRA2 key
es: Clave OCRA2
fr: Clé OCRA2
it: Chiave OCRA2

source: Generate OCRA2 key.
es: Dejar que el servidor genere la clave OCRA2.
fr: Faire générer la clé OCRA2 par le serveur.
it: Far generare la chiave OCRA2 dal server.

source: Enroll your OCRA2 Token
es: Implemente el token OCRA2
fr: Déployez votre token OCRA2
it: Srotola il token OCRA2

source: Token description
es: Descripción del token
fr: Description du token
it: Descrizione token

source: Generate OCRA2 seed
es: Dejar que el servidor genere la clave OCRA2.
fr: Faire générer la clé OCRA2 par le serveur.
it: Far generare la chiave OCRA2 dal server.

source: Enter seed for the new OCRA2 token:
es: Introduzca la semilla para el token OCRA2 nuevo:
fr: Entrez le seed pour le nouveau token OCRA2 :
it: Inserire il seed per il nuovo token OCRA2:

source: enroll ocra2 token
es: Implementar token OCRA2
fr: Déployer le token OCRA2
it: Srotolare il token OCRA2

source: Activate your OCRA2 Token
es: Active su token OCRA2
fr: Activez votre token OCRA2
it: Attiva il token OCRA2

source: Your OCRA2 Token :
es: Su token OCRA2:
fr: Votre token OCRA2 :
it: Il tuo Token OCRA2:

source: 1. Enter the activation code :
es: 1. Por favor, introduzca el código de activación:
fr: 1. Veuillez entrer le code d'activation :
it: 1. Inserisci il codice di attivazione:

source: Failed to enroll token!
es: ¡Error durante la implementación del token!
fr: Échec du déploiement du token !
it: Srotolamento del token fallito!

source: activate your OCRA2 Token
es: Active su token OCRA2
fr: Activez votre token OCRA2
it: Attiva il token OCRA2

source: 2. Enter your confirmation code:
es: 2. Por favor, introduzca el código de verificación:
fr: 2. Veuillez entrer le code de vérification :
it: 2. Inserisci il codice di conferma:

source: OCRA rollout for token %s completed!
es: ¡Implementación del token OCRA %s completada!
fr: Déploiement du token OCRA %s terminé !
it: Srotolamento del token OCRA %s concluso!

source: OCRA token rollout failed! Please retry
es: Error durante la implementación del token OCRA. Por favor, inténtelo de nuevo.
fr: Échec du déploiement du token OCRA. Veuillez réessayer !
it: Srotolamento del token OCRA fallito. Riprova!

source: finish your OCRA2 Token
es: Concluir token OCRA2
fr: Terminer le token OCRA2
it: Terminare token OCRA2

source: ocra challenge-response token - hmac event based
es: Token desafío-respuesta OCRA - HMAC basado en eventos
fr: OCRA Challenge Response Token - HMAC basé sur un événement
it: OCRA Challenge Response Token - HMAC basato sugli eventi

source: URL for OCRA2 token
es: URL para token OCRA2
fr: URL pour le token OCRA2
it: URL per token OCRA2

source: QRToken Settings
es: Configuración de QRToken:
fr: Paramètres du token QR :
it: Impostazioni QRToken:

source: Maximum concurrent challenges
es: Número máximo de desafíos simultáneos
fr: Nombre maximum de défis simultanés
it: Numero massimo di challenges attuali

source: Challenge Timeout
es: Tiempo límite para el desafío
fr: Délai challenge
it: Timeout per challenge

source: OTP length
es: Longitud OTP
fr: Longueur OTP
it: Lunghezza OTP

source: 6 digits
es: 6 dígitos
fr: 6 chiffres
it: 6 cifre

source: 8 digits
es: 8 dígitos
fr: 8 chiffres
it: 8 cirfre

source: 10 digits
es: 10 dígitos
fr: 10 chiffres
it: 10 cifre

source: Public key certificate
es: Certificado clave pública
fr: Certificat de clé publique
it: Certificato chiave pubblico

source: certificate id
es: ID del certificado
fr: Identifiant certificat
it: Certifica nome utente

source: QRToken - challenge/response Token
es: QRToken - Token de desafío/respuesta
fr: Token QR défi/réponse
it: ORToken - challenge/rispondi al token

source: web ui generated
es: Generado UI web
fr: ui web générée
it: Interfaccia utente web generato

source: Enroll your QRToken
es: Inscriba su QRToken
fr: Inscrivez votre token QR
it: Iscrivi il tuo QRToken

source: enroll qrtoken
es: Inscribir QRToken
fr: Inscrivez le tokenqr
it: Iscrivi QRToken

source: Activate your QRToken
es: Activar QRToken
fr: Activez votre token QR
it: Attiva il tuo QRToken

source: Select QRToken:
es: Seleccionar QRToken:
fr: Sélectionnez le token QR
it: Seleziona il QRToken

source: Enter pin:
es: Introducir PIN:
fr: Entrez votre PIN
it: Inserisci pin:

source: activate token
es: Activar token
fr: Activez le token
it: Attiva token

source: Challenge triggered successfully
es: Desafío desencadenado correctamente
fr: Défi déclenché avec succès
it: Challenge avviata con successo

source: Please scan the qr code and submit your response or enter the otp value in the form below.
es: Por favor, escanee el código QR y envíe su respuesta o introduzca el valor de OTP en el siguiente formulario.
fr: Veuillez scanner le code qr et soumettre votre réponse ou entrez la valeur OTP dans le formulaire ci-dessous.
it: Per favore, scansiona il codice QR e invia la tua risposta o inserisci il valore OTP nel modulo in basso.

source: OTP Value:
es: Valor OTP:
fr: Valeur OTP
it: Valore OTP:

source: finalize activation
es: Finalizar activación
fr: finaliser l'activation
it: Concludi attivazione

source: activate your QRToken
es: Activar QRToken
fr: Activer le token QR
it: Attiva il tuo QRToken

source: Policy %s must have a value
es: La política %s debe tener un valor
fr: La directive %s doit avoir une valeur
it: La polizza %s deve avere un valore

source: or
es: o
fr: ou
it: oppure

source: QRToken Pairing Url
es: URL de emparejamiento de QRToken
fr: Appariement url token QR
it: QRToken viene unito all'Url

source: QRToken Certificate
es: Certificado QRToken
fr: Certificat Token QR
it: Certificato QRToken

source: RADIUS Token
es: Token RADIUS
fr: Token RADIUS
it: Token RADIUS

source: Please enter a valid RADIUS server specification. It needs to be of the form <name_or_ip>:<port>
es: Por favor, introduzca una especificación válida del servidor RADIUS. Este debe tener el formato <Nombre_o_IP>:<Puerto>.
fr: Veuillez entrer une spécification de serveur RADIUS valide, sous la forme <Nom_ou_IP>:<Port>.
it: Inserisci una specifica server RADIUS valida che soddisfi la forma <Nome_o_IP>: <Port>.

source: RADIUS token settings
es: Ajustes de token RADIUS:
fr: Paramètres du token RADIUS :
it: Impostazioni token RADIUS:

source: You need to enter the server like myradius:1812
es: Debe indicar el servidor con el puerto en el formato 'radiusserver:1812'.
fr: Vous devez entrer le port du serveur dans le format 'radiusserver:1812'.
it: È necessario specificare il server con Porta nel formato 'radiusserver:1812'.

source: RADIUS server
es: Servidor RADIUS
fr: Serveur RADIUS
it: Server RADIUS

source: The PIN can either be verified on this local LinOTP server or forwarded to the RADIUS server
es: El PIN puede verificarse aquí en el servidor LinOTP local o reenviarse al servidor RADIUS.
fr: Le code PIN peut être vérifié soit ici sur le serveur local LinOTP ou être transmis au serveur RADIUS.
it: Il PIN può essere verificato qui sul server locale LinOTP o trasmesso al server RADIUS.

source: Check PIN
es: Comprobar PIN
fr: Vérifiez le code PIN
it: Verifica PIN

source: The PIN can either be verified on this local LinOTP server or on the RADIUS server
es: El PIN puede verificarse aquí en el servidor LinOTP local o reenviarse al servidor RADIUS.
fr: Le code PIN peut être vérifié soit ici sur le serveur local LinOTP ou être transmis au serveur RADIUS.
it: Il PIN può essere verificato qui sul server locale LinOTP o trasmesso al server RADIUS.

source: on RADIUS server
es: en el servidor RADIUS
fr: sur le serveur RADIUS
it: sul server RADIUS

source: locally
es: local
fr: local
it: locale

source: RADIUS shared secret
es: Secreto compartido de RADIUS
fr: Secret RADIUS partagé

source: RADIUS token
es: Token RADIUS
fr: Token RADIUS
it: Token RADIUS

source: Here you can define, to which RADIUS server the request should be forwarded.
es: Aquí puede especificar a qué servidor RADIUS debe reenviarse la petición de autenticación.
fr: Ici, vous pouvez spécifier à quel serveur RADIUS la demande d'authentification doit être transmise.
it: Qui è possibile specificare a quale server RADIUS deve essere inoltrata la richiesta di autenticazione.

source: Please specify the server, the secret and the username
es: Por favor, especifique el servidor, el secreto RADIUS y el nombre de usuario.
fr: Veuillez spécifier le serveur, le secret RADIUS et le nom d'utilisateur.
it: Specifica il server, il secret RADIUS e il nome utente.

source: RADIUS user
es: Usuario RADIUS
fr: Utilisateur RADIUS
it: Utente RADIUS

source: Remote Token
es: Token remoto

source: Please enter a valid remote server specification. It needs to be of the form http://server or https://server
es: Por favor, introduzca una especificación de servidor remoto válida. Esta debe tener el formato http://servidor o https://server.
fr: Veuillez entrer une spécification de serveur distant valide, sous la forme http://server ou https://server.
it: Inserisci una specifica Remote Server valida che soddisfi la forma http://server o https://server.

source: Remote token settings
es: Ajustes de token remoto
fr: Paramètres du Remote Token
it: Impostazioni Remote Token

source: You need to enter the remote LinOTP server like https://remotelinotp
es: Debe indicar el servidor LinOTP remoto en el formato 'https://linotp2.remoteserver.local.
fr: Vous devez entrer le serveur LinOTP distant au format "https://linotp2.remoteserver.local".
it: È necessario specificare il server remoto LinOTP nel formato 'https://linotp2.remoteserver.local.

source: Remote server
es: Servidor remoto

source: The PIN can either be verified on this local LinOTP server or forwarded to the remote server
es: El PIN puede verificarse en el servidor LinOTP local o reenviarse al servidor remoto.
fr: Le code PIN peut être vérifié soit ici sur le serveur local LinOTP ou être transmis au serveur RADIUS.
it: Il PIN può essere verificato qui sul server locale LinOTP o trasmesso al server remoto.

source: The PIN can either be verified on this local LinOTP server or on the remote server
es: El PIN puede verificarse en el servidor local o en el servidor LinOTP remoto.
fr: Le code PIN peut être soit vérifié sur ce serveur local ou sur le serveur LinOTP distant.
it: Il PIN può essere verificato su questo server locale o sul server remoto LinOTP.

source: on remote server
es: en el servidor remoto
fr: sur le Remote Server
it: sul server remoto

source: Remote realm
es: Dominio remoto

source: Remote resolver
es: Solucionador remoto

source: Remote token
es: Token remoto

source: Please enter a valid URL for the LinOTP server. It needs to start with http:// or https://
es: Por favor, introduzca una URL válida para el servidor LinOTP. Debe comenzar con http:// o https://.
fr: Veuillez entrer une URL valide pour le serveur LinOTP. Elle doit commencer par http:// ou https://.
it: Inserisci un URL valido per il server LinOTP. Deve iniziare con http:// o https://.

source: Here you can define to which LinOTP Server the authentication request should be forwarded.
es: Aquí se puede especificar a qué servidor LinOTP debe reenviarse la solicitud de autenticación.
fr: Ici, vous pouvez spécifier à quel serveur LinOTP la demande d'authentification doit être transmise.
it: Qui è possibile specificare a quale server LinOTP deve essere inoltrata la richiesta di autenticazione.

source: You can either forward the OTP to a remote serial number or to a remote user.
es: La solicitud de autenticación puede transferirse a un número de serie remoto o a un usuario remoto.
fr: La demande d'authentification peut soit être transférée à un numéro de série distant ou à un utilisateur distant.
it: La richiesta di autenticazione può essere trasmessa ad un numero di serie remoto o ad un utente remoto.

source: If you do not enter a remote serial or a remote user, the request will be forwarded to the remote user with the same username.
es: Si no se especifica ningún número de serie remoto y ningún nombre de usuario remoto, la solicitud de autenticación se reenviará al usuario con el mismo nombre de usuario.
fr: Si vous ne spécifiez pas un numéro de série distant et un nom d'utilisateur distant, la demande d'authentification sera transmise à l'utilisateur avec le même nom d'utilisateur.
it: Se non si specificano un numero di serie remoto o un nome utente remoto, la richiesta di autenticazione verrà inoltrata all'utente con lo stesso nome utente.

source: You need to enter the server like 'https://linotp2.my.domain'
es: Debe especificar el servidor en el formato 'https://linotp2.remoteserver.local'.
fr: Vous devez entrer le serveur au format "https://linotp2.remoteserver.local".
it: È necessario specificare il server nel formato 'https://linotp2.remoteserver.local'.

source: The PIN can either be verified on this local LinOTP server or on the remote LinOTP server
es: El PIN puede verificarse en el servidor local o en el servidor LinOTP remoto.
fr: Le code PIN peut être soit vérifié sur ce serveur local ou sur le serveur LinOTP distant.
it: Il PIN può essere verificato su questo server locale o sul server remoto LinOTP.

source: remotely
es: eliminado
fr: distant
it: remoto

source: Remote OTP len
es: Longitud OTP remota
fr: Longueur remote OTP
it: Lunghezza OTP remoto

source: Remote serial
es: Número de serie remoto
fr: Numéro de série remote
it: Numero seriale remoto

source: Remote user
es: Usuario remotos
fr: Utilisateur remote
it: Utente remoto

source: Remote user realm
es: Dominio del usuario remoto
fr: Domaine de l'utilisateur remote
it: Realm dell'utente remoto

source: Remote user UserIdResolver
es: UserIdResolver del usuario remoto
fr: UserIdResolver de l'utilisateur remote
it: UserIdResolver dell'utente remoto

source: Please enter the mobile phone number for the SMS token
es: Por favor, indique el número de teléfono móvil para el token SMS.
fr: Veuillez entrer le numéro de téléphone mobile pour le SMS Token.
it: Inserisci il numero di cellulare per il token SMS.

source: Phone number
es: Número de teléfono móvil
fr: Numéro de téléphone mobile
it: Numero di cellulare

source: Register SMS
es: Registrar token SMS
fr: Enregistrer le token SMS
it: Registrare il token SMS

source: minimum length must be greater than 10
es: La longitud mínima debe ser al menos 10.
fr: La longueur minimale doit être supérieure à 10.
it: La lunghezza minima deve essere maggiore di 10.

source: Please enter a valid phone number. It may only contain numbers and + or /.
es: Por favor, introduzca un número de teléfono válido. Este solo puede contener números y los símbolos + y /.
fr: Veuillez entrer un numéro de téléphone valide. Il ne peut contenir que des chiffres + et /.
it: Inserisci un numero di telefono valido. Può contenere solo cifre con + e /.

source: Register your SMS OTP Token / mobileTAN
es: Registre su token SMS OTP/TAN móvil
fr: Enregistrez votre SMS OTP token / mobileTAN
it: Registra il token SMS OTP / mobileTAN

source: Your mobile phone number
es: Su número de teléfono móvil
fr: Votre numéro de téléphone mobile
it: Numero di cellulare

source: register SMS Token
es: Registrar token SMS
fr: Enregistrer le token SMS
it: Registrare il token SMS

source: SMS Token
es: Token SMS
it: Token SMS

source: sms challenge-response token - hmac event based
es: Token desafío-respuesta SMS - HMAC basado en eventos
fr: OCRA Challenge Response Token - HMAC basé sur un événement
it: SMS Challenge Response Token - HMAC basato sugli eventi

source: define if the user should be allowed to define the sms
es: describe si el usuario tiene permiso o no para cambiar un número de SMS.
fr: indique si l'utilisateur est autorisé ou non à modifier son propre numéro de SMS.
it: descrive se l'utente stesso può modificare il proprio numero SMS o no.

source: User is not allowed to set phone number
es: El usuario no tiene permiso para fijar el número de teléfono.
fr: L'utilisateur n'est pas autorisé à définir le numéro de téléphone !
it: L'utente non può impostare il numero di telefono!

source: sending sms failed
es: No se ha podido enviar el SMS correctamente.
fr: L'envoi du SMS a échoué.
it: L'invio del messaggio SMS non ha avuto successo.

source: The Simple Pass token will not require any one time password component.
es: El token de tipo Simple Pass no contiene ninguna proporción de contraseña de un solo uso.
fr: Le Simple Pass Token ne comprend de partie du mot de passe unique.
it: Il Simple Pass Token non comprende alcuna parte della password usa e getta.

source: Anyway, you can set an OTP PIN, so that using this token the user can authenticate always and only with this fixed PIN.
es: No obstante, puede establecer un PIN OTP para que este token funcione como una contraseña simple.
fr: Cependant, vous pouvez définir un code PIN OTP, afin que ce token fonctionne comme un simple mot de passe grâce au code PIN OTP .
it: È possibile però impostare un PIN OTP in modo tale che questo token funzioni come una semplice password per effetto dell'OTP PIN.

source: Day OTP Token / Tagespasswort
es: Contraseña del día
fr: Mot de passe quotidien
it: Password giornaliera

source: Here you can define the 'Tagespasswort' token, that changes every day.
es: Aquí puede definir el token 'contraseña del día'. Este cambia el valor OTP solo una vez al día. El valor OTP se puede utilizar durante todo el día.
fr: Ici, vous pouvez définir le token 'Tagespasswort' (mot de passe quotidien). Il modifie la valeur OTP une seule fois par jour. La valeur OTP peut être utilisée tout au long de la journée.
it: Qui è possibile definire il token 'password giornaliera'. Questo token cambia il valore OTP sola una volta al giorno. Il valore OTP può essere utilizzato per tutta la giornata.

source: DPW key
es: Semilla DPW
fr: DPW Seed
it: Seed DPW

source: TOTP Token
es: Token TOTP
fr: Token TOTP
it: Token TOTP

source: TOTP token settings
es: Ajustes de token TOTP
fr: Paramètres du token TOTP :
it: Impostazioni token TOTP:

source: time step
es: Unidad de tiempo
fr: Incrément de temps
it: Step temporale

source: This is the time step for time based tokens. Usually this is 30 or 60.
es: Esta es la unidad de tiempo del token basado en el tiempo. Por lo general, suele ser de 30 o 60 segundos.
fr: C'est l'incrément de temps pour les token basés sur le temps. Ce sont habituellement 30 ou 60 secondes.
it: Corrisponde allo step temporale con token basati sul tempo. Si tratta solitamente di 30 o 60 secondi.

source: time offset
es: Retardo
fr: Décalage temporel
it: Ritardo temporale

source: This is the default time shift of the server. This should be 0.
es: Es el retardo estándar que se aplicará al reloj del servidor y del token. Debería ser 0.
fr: C'est le temps de décalage standard de l'horloge du serveur et du token. Il devrait être 0.
it: Corrisponde al normale ritardo temporale con cui vengono spostati l'orologio del server e l'orologio del token. Deve essere 0.

source: time lookup window
es: Intervalo de tiempo
fr: Fenêtre temporelle
it: Finestra temporale

source: This is the time LinOTP will calculate before and after the current time. A reasonable value is 300.
es: LinOTP intentará encontrar el valor OTP de un token basado en el tiempo dentro de este intervalo de tiempo, así como antes y después de la hora actual.
fr: Dans cette fenêtre temporelle, LinOTP essaiera de trouver la valeur OTP pour un token basé sur le temps, avant et après l'heure actuelle.
it: LinOTP cercherà in questa finestra temporale prima e dopo l'ora attuale di trovare il valore OTP con un token basato sul tempo.

source: HMAC time based
es: HMAC basado en el tiempo
fr: HMAC basé sur le temps
it: HMAC basato sul tempo

source: Create a new OATH token - HMAC time based
es: Crear un token OATH nuevo - HMAC basado en el tiempo
fr: Générer un nouveau token OATH - HMAC basé sur le temps
it: Impostare un nuovo token OATH - HMAC basato sul tempo

source: The :time step: defines the granularity of the time in seconds that is used in the HMAC algorithm.
es: La :unidad de tiempo: define la granularidad del tiempo en segundos que se utiliza en el algoritmo HMAC.
fr: L':incrément de temps: définit la granularité du temps en secondes, utilisée dans l'algorithme HMAC.
it: Lo :step temporale: definisce la granularità del tempo in secondi utilizzati nell'algoritmo HMAC.

source: Time step
es: Unidad de tiempo
fr: Incrément de temps
it: Step temporale

source: seconds
es: Segundos
fr: secondes
it: Secondi

source: Enroll TOTP Token
es: Implementar token TOTP
fr: Déployer le token TOTP
it: Srotolare il token TOTP

source: Enroll your TOTP token
es: Implemente el token TOTP
fr: Déployez votre token TOTP
it: Srotola il tuo token TOTP
