Repository: pypi-data/pypi-mirror-18
Catalog: packages/LinOTP/LinOTP-2.9.0.5.tar.gz/LinOTP-2.9.0.5/linotp/i18n/*/LC_MESSAGES/linotp.po
Languages: es, fr, it

source: Error loading SQL resolver
es: Error al cargar solucionador de SQL
fr: Erreur lors du chargement du résolveur SQL
it: Errore durante il caricamento del Resolver SQL

source: SQL config seems to be OK! Number of users found
es: La configuración del servidor SQL parece estar bien. Número de usuarios encontrados
fr: La configuration SQL semble OK ! Nombre d'utilisateurs trouvés
it: Configurazione SQL sembra OK! Numero di utenti trovati

source: SQL config contains errors
es: La configuración de SQL contiene errores
fr: La configuration SQL contient des erreurs
it: Configurazione SQL contiene errori

source: Unknown PIN type
es: Tipo de PIN desconocido
fr: Type de code PIN inconnu
it: Tipo di PIN sconosciuto

source: You entered invalid data. Please check all the Tabs!
es: Ha introducido datos no válidos. Por favor, compruebe todas las pestañas.
fr: Vous avez saisi des données invalides. Veuillez vérifier tous les onglets !
it: Sono stati inseriti dati non validi. Verificare tutti i tab!

source: Error occurred during processing
es: Error durante el procesamiento
fr: Erreurs dans le traitement
it: Errore durante l'elaborazione

source: You have defined UserIdResolvers. But you need to create at least one realm that contains some of your UserIdResolvers. The realm Dialog will now open to do this.
es: Ha definido UserIdResolver. Debe definir al menos un dominio para poder asignar token a los usuarios. Para ello se abrirá el diálogo del dominio.
fr: Vous avez défini UserIdResolver. Cependant, vous devez définir au moins un domaine, afin de pouvoir attribuer des token aux utilisateurs. À cet effet, la boîte de dialogue du domaine va s'ouvrir.
it: E' stato definito UserIdResolver. Occorre però definire almeno un Realm per poter assegnare token agli utenti. Aprire la finestra di dialogo Realm.

source: This realm is already the default realm.
es: Este dominio ya es el dominio predeterminado.
fr: Ce domaine est déjà le domaine par défaut.
it: Questo Realm è già il Realm di default.

source: Incorrect or missing input at
es: Entrada incorrecta o ausente en:
fr: Indications incorrectes ou manquantes dans :
it: Informazioni errate o mancanti in:

source: Please have a look at each of the forms for more details.
es: Por favor, compruebe los ajustes de configuración individuales para más detalles.
fr: Veuillez vérifier les paramètres de configuration individuels pour plus de détails.
it: Verificare le singole impostazioni di configurazione per maggiori dettagli.

source: License reminder:
es: Recordatorio de licencia:
fr: Rappel de licence :
it: Promemoria licenza:

source: Support license installed successfully.
es: La licencia de soporte se ha instalado correctamente.
fr: La licence de support a été installée avec succès.
it: La licenza di supporto è stata installata correttamente.

source: OATH Soft Token
es: Token de software OATH
fr: Softtoken OATH

source: QR-Code for installing the token in OATH compatible Soft Tokens (FreeOTP, Google Authenticator and other tokens using the 'otpauth:/' syntax).
es: Código QR para la instalación en diferentes aplicaciones con token de software OATH (FreeOTP, Google Authenticator y otros token compatibles con la sintaxis 'otpauth://'.
fr: QR code pour l'installation dans différentes applications OATH Softtoken (FreeOTP, Google Authenticator et autres token qui soutiennent la syntaxe 'otpauth://'.
it: Codice QR per l'installazione in varie applicazioni OATH Softtoken (FreeOTP, Google Authenticator e altri token che supportano la sintassi 'otpauth://'.

source: 'OATH token' app
es: Aplicación 'OATH Token'
fr: Application 'OATH Token'
it: App 'OATH Token'

source: QR-Code for installing the token in the 'OATH Token' app for iOS.
es: Código QR para la instalación del token en la aplicación 'OATH Token' para iOS.
fr: QR code pour l'installation du token dans l'application 'OATH Token' pour iOS.
it: Codice QR per l'installazione del token nell'app 'OATH Token' per iOS.

source: The OATH token seed for installing the token using manual input.
es: Semilla del token OATH para la entrada manual.
fr: OATH Token Seed pour la saisie manuelle.
it: Seed OATH Token per l'inserimento manuale.

source: Communicating with LinOTP server...
es: Comunicarse con el servidor LinOTP...
fr: Communication avec le serveur LinOTP...
it: In comunicazione con il server LinOTP ...

source: OTP values
es: Valores de OTP
fr: Valeurs OTP
it: Valori OTP

source: Your token
es: Su token
fr: Votre token
it: Il tuo token

source: is of type
es: es del tipo
fr: est de type
it: è di tipo

source: Export policies
es: Exportar directrices
fr: Exporter les directives
it: Esportare criteri

source: Policy name
es: Nombre de la directriz
fr: Nom de la directive
it: Nome criterio

source: The name of the policy
es: El nombre de la directriz
fr: Le nom de la directive
it: Nome del criterio

source: - Select scope -
es: - Seleccionar dominio -
fr: - Sélectionner une plage -
it: - Selezionare l'area -

source: The action that should be allowed. These are actions like: enrollSMS, enrollMOTP...The actions may be comma separated.
es: La acción que se debe permitir. Estas son acciones como 'enrollSMS', 'enrollMOTP'...Las acciones están separadas por comas.
fr: L'action qui devrait être autorisée. Ce sont des actions telles que 'enrollSMS','enrollMOTP'... Les actions sont séparées par des virgules.
it: Azione da consentire. Si tratta di azioni come 'enrollSMS', 'enrollMOTP' ... Le azioni sono separate da virgole.

source: The user or usergroup the policy should apply to
es: Los usuarios de un grupo a los que debe aplicarse la directriz
fr: Les utilisateurs d'un groupe auquel la directive s'applique
it: Utenti di un gruppo per i quali vale il criterio

source: The realm the policy applies to
es: El dominio para el que se debe aplicar la directriz
fr: Le domaine auquel la directive s'applique
it: Realm per il quale vale il criterio

source: Comma separated list of client IPs and Subnets.
es: Lista separada por comas de las direcciones IP de los clientes o subredes.
fr: Par liste séparée par des virgules des adresses IP des clients ou des sous-réseaux.
it: Elenco separato da virgola di indirizzi Client IP o sottoreti.

source: The time on which the policy should be applied
es: El momento en el que debe entrar en vigor la directriz
fr: Heure à laquelle la directive doit être valable
it: Periodo per il quale deve valere il criterio

source: Set Policy
es: Guardar directriz
fr: Enregistrer la directive
it: Salvare criterio

source: Delete Selected Policy
es: Eliminar la directriz seleccionada
fr: Supprimer la directive sélectionnée
it: Eliminare criterio selezionato

source: Clear Fields
es: Vaciar campos
fr: Vider les champs
it: Svuotare campi

source: hashlib
es: Algoritmo Hash
fr: Algorithme Hash
it: Algoritmo Hash

source: count auth
es: Contador de autenticación
fr: Compteur d'authentification
it: Contatore di autenticazione

source: count auth max
es: Número máximo del contador de autenticación
fr: Compteur d'authentification maximum
it: Contatore di autenticazione massimo

source: time window
es: Intervalo de tiempo
fr: Fenêtre temporelle
it: Finestra temporale

source: time shift
es: Retardo
fr: Décalage temporel
it: Ritardo temporale

source: mobile phone number
es: Número de teléfono móvil
fr: Numéro de téléphone mobile
it: Numero di cellulare

source: Get OTP
es: Solicitar valores OTP
fr: Demander les valeurs OTP
it: Richiedere valori OTP

source: Activate your OCRA Token
es: Active su token OCRA
fr: Activez votre token OCRA
it: Attiva il token OCRA

source: Your OCRA Token :
es: Sus token OCRA:
fr: Votre token OCRA :
it: Il token OCRA:

source: activate your OCRA Token
es: Active su token OCRA
fr: Activez votre token OCRA
it: Attiva il token OCRA

source: finish your OCRA Token
es: Concluir token OCRA
fr: Terminer le token OCRA
it: Completare il token OCRA

source: Assign OTP Token
es: Asignar token OTP
fr: Attribuer le token OTP
it: Assegnare il token OTP

source: You may either assign the token by entering the serial number or you can enter an OTP value of the token and the system will try to identify the token for you.
es: Puede asignar un token introduciendo directamente el número de serie o determinar el token a través de un valor OTP y luego asignarlo.
fr: Vous pouvez soit attribuer un token en entrant directement le numéro de série, soit vous pouvez déterminer le token via une valeur OTP puis l'attribuer.
it: E' possibile assegnare un token inserendo direttamente il numero di serie, oppure determinando e quindi assegnando il token tramite un valore OTP.

source: The OTP value of the Token to assign
es: Valor OTP del token que debe asignarse
fr: Valeur OTP du token qui doit être attribué
it: Valore OTP del token che si desidera assegnare

source: Determine Serial Number
es: Determinar el número de serie
fr: Déterminer le numéro de série
it: Determinare il numero di serie

source: Serialnumber of new Token
es: Número de serie del token OTP nuevo
fr: Numéro de série du nouveau token OTP
it: Numero di serie del nuovo token OTP

source: Assign Token
es: Asignar token
fr: Attribuer le token
it: Assegnare il token

source: LinOTP 2 User self service
es: Portal de autogestión LinOTP
fr: Portail d'auto-gestion LinOTP
it: Portale di auto-gestione LinOTP

source: Selfservice Portal
es: Portal de autogestión
fr: Portail d'auto-gestion
it: Portale auto-gestione

source: Tokens for user:
es: Token del usuario:
fr: Token de l'utilisateur :
it: Token dell'utente:

source: in realm
es: en el dominio
fr: dans le domaine
it: nel Realm

source: Activate your OCRA token
es: Activar token OCRA
fr: Activer le token OCRA
it: Attivare token OCRA

source: Enroll OATH token
es: Implementar token OATH
fr: Déployer le token OATH
it: Srotolare il token OATH

source: Enroll OATH soft token
es: Implementar token de software OATH
fr: Déployer le Softoken OATH
it: Srotolare Softtoken OATH

source: Disable Token
es: Desactivar token
fr: Désactiver le token
it: Disattivare token

source: Enable Token
es: Activar token
fr: Activer le token
it: Attivare token

source: set PIN
es: Establecer PIN
fr: Définir le code PIN
it: Impostare il PIN

source: set mOTP PIN
es: Establecer PIN mOTP
fr: Définir le code PIN mOTP
it: Impostare il PIN mOTP

source: get OTP values
es: Solicitar valores OTP
fr: Demander les valeurs OTP
it: Richiedere valori OTP

source: unassign Token
es: Revocar asignación de token
fr: Annuler l'attribution du token
it: Cancellare l'assegnazione di token

source: delete Token
es: Eliminar token
fr: Supprimer le token
it: Elimina token

source: History
es: Proceso
fr: Historique
it: Andamento

source: Error enrolling token: %s
es: Error durante la implementación del token: %s
fr: Erreur lors du déploiement du token : %s
it: Errore durante lo srotolamento del token: %s

source: Token enrolled successfully: %s
es: El token se ha implementado correctamente: %s
fr: Le token a été déployé avec succès : %s
it: Il token è stato srotolato con successo: %s

source: Delete OTP Token
es: Eliminar token OTP
fr: Supprimer le token OTP
it: Elimina token OTP

source: selected Token
es: Token seleccionado
fr: Token sélectionné
it: Token selezionato

source: Disable OTP Token
es: Desactivar token OTP
fr: Désactiver le token OTP
it: Disattivare token OTP

source: disable Token
es: Desactivar token
fr: Désactiver le token
it: Disattivare token

source: Enable OTP Token
es: Activar token OTP
fr: Activer le token OTP
it: Attivare token OTP

source: enable Token
es: Activar token
fr: Activer le token
it: Attivare token

source: get OTP values from Token
es: Solicitar los valores OTP del token
fr: Interroger les valeurs OTP du token
it: Richiedere valori OTP da Token

source: Number of OTP values to retrieve
es: Número de valores OTP que deben solicitarse
fr: Nombre des valeurs OTP à interroger
it: Numero di valori OTP da richiedere

source: This is the LinOTP self service portal. You may login here with your username and realm.
es: Este es el portal de autogestión LinOTP. Aquí puede iniciar sesión con su nombre de usuario y su dominio.
fr: C'est le portail d'auto-gestion LinOTP. Ici, vous pouvez vous connecter avec votre nom d'utilisateur et votre domaine.
it: Questo è il portale di autogestione LinOTP. Qui è possibile effettuare il login con username e Realm.

source: Within the self service portal you may reset the PINs of your tokens, assign new tokens or resync your tokens.
es: En el portal de autogestión puede, por ejemplo, restablecer el PIN de su token, implementar token nuevos o sincronizarlos.
fr: Dans ce portail d'auto-gestion, vous pouvez par exemple réinitialiser le code PIN de votre token, déployer ou synchroniser de nouveaux token.
it: Nel portale di autogestione si può ad esempio resettare il PIN del token, srotolare nuovi token o sincronizzarli.

source: If you lost a token, you may also disable this token.
es: Si ha perdido un token, puede desactivarlo.
fr: Si vous avez perdu un token, vous pouvez le désactiver.
it: Se è stato perso un token, è possibile disattivarlo.

source: Login to LinOTP self service
es: Inicio de sesión en el portal de autogestión LinOTP
fr: Connexion au portail d'auto-gestion LinOTP
it: Registrazione sul portale di autogestione LinOTP

source: Failed to retrieve the OTP values of your token:
es: Error al solicitar los valores OTP:
fr: Échec de la demande des valeurs OTP :
it: La richiesta dei valori OTP è fallita:

source: reset Failcounter
es: Restablecer contador de errores
fr: Réinitialiser le compteur d'erreurs
it: Resettare contatore errori

source: Resync OTP Token
es: Sincronizar token OTP
fr: Synchroniser le token OTP
it: Sincronizzare token OTP

source: resync OTP
es: Sincronizar OTP
fr: Synchroniser OTP
it: Sincronizzare OTP

source: Reset mOTP PIN
es: Restablecer PIN mOTP
fr: Réinitialiser le code PIN mOTP
it: Resettare PIN mOTP

source: This resets the mOTP PIN, which is the PIN that is entered in the motp application on your phone.
es: Esto restablece el PIN mOTP. Indique este PIN en su teléfono en la aplicación motp.
fr: Cela réinitialise le code PIN mOTP. Vous entrez ce code PIN dans l'application motp sur votre téléphone.
it: Si resetta il PIN mOTP. Inserire questo PIN nell'applicazione mOTP sul telefono.

source: repeat mOTP PIN
es: Repetir PIN mOTP
fr: Code PIN mOTP (répéter)
it: Ripetere PIN mOTP

source: The passwords do not match!
es: ¡Las contraseñas no coinciden!
fr: Les mots de passe ne sont pas identiques !
it: Le password non sono uguali!

source: Error setting mOTP PIN:
es: Error al configurar el PIN mOTP:
fr: Erreur lors du réglage du code PIN mOTP :
it: Errore durante l'impostazione del PIN mOTP:

source: mOTP PIN set successfully
es: PIN mOTP configurado correctamente.
fr: Le code PIN a été défini avec succès.
it: PIN mOTP impostato con successo.

source: Reset OTP PIN
es: Restablecer PIN OTP
fr: Réinitialiser le code PIN OTP
it: Resettare PIN OTP

source: repeat PIN
es: Repetir PIN
fr: Répéter le code PIN
it: Ripetere PIN

source: Error setting PIN:
es: Error al establecer el PIN:
fr: Erreur lors du réglage du code PIN :
it: Errore durante l'impostazione del PIN:

source: PIN set successfully
es: PIN configurado correctamente
fr: Le code PIN a été défini avec succès
it: PIN impostato con successo

source: Unassign OTP Token
es: Revocar asignación de token OTP
fr: Annuler l'attribution de token OTP
it: Cancellare l'assegnazione token OTP

source: Provision your OATH soft token
es: Implemente el token OATH
fr: Déployez votre token OATH
it: Srotolare il token OATH

source: You need an OATH compatible soft token app installed on your mobile device.
es: Debe haber instalado una aplicación de token de software compatible con OATH en su teléfono.
fr: Vous devez avoir installé l'application Soft Token, compatible avec OATH, sur votre téléphone.
it: Occorre avere installato sul cellulare un'applicazione Soft Token compatibile con OATH.

source: (FreeOTP, Google Authenticator or another OATH compatible soft token)
es: (FreeOTP, Google Authenticator u otro token de software compatible con OATH)
fr: (FreeOTP, Google Authenticator ou un autre Softtoken compatible avec OATH)
it: (FreeOTP, Google Authenticator o altro Softtoken compatibile con OATH)

source: Provision your soft token in LinOTP
es: Indique su token de software en LinOTP
fr: Enregistrez votre SoftToken dans LinOTP
it: Creare Softtoken in LinOTP

source: Choose your token profile
es: Por favor, seleccione su tipo de token
fr: Veuillez sélectionner votre type de token
it: Seleziona il tipo di token

source: event based
es: basado en eventos
fr: basé sur un évènement
it: basato su eventi

source: time based
es: basado en el tiempo
fr: basé sur le temps
it: basato sul tempo

source: and
es: y
fr: et
it: e

source: enroll your token
es: cree su token
fr: créez votre token
it: crea il token

source: enroll your event based token
es: cree su token basado en eventos
fr: créez un token basé sur un évènement
it: Crea il token basato su eventi

source: enroll your time based token
es: cree su token basado ​​en el tiempo
fr: créez un token basé sur le temps
it: crea il token basato sul tempo

source: Install your soft token profile
es: Instale su tipo de token de software
fr: Installer votre type de Softtoken
it: Installa il tipo di Softtoken

source: To install the token on your mobile device, scan the QR code below with your soft token app or follow the link
es: Para instalar el token en su dispositivo móvil, escanee el código QR que aparece abajo o siga el enlace.
fr: Pour installer le token sur votre appareil mobile, veuillez numériser le QR Code ci-dessous ou suivez le lien.
it: Per installare il token nel proprio dispositivo mobile, eseguire la scansione del QRCode sottostante o seguire il link.

source: Provision your OATH Token
es: Registrar token OATH
fr: Enregistrer le token OATH
it: Registrare token OATH

source: 1. You first need to install the oathtoken to your iPhone.
es: 1. Debe instalar primero la aplicación oathtoken en su iPhone.
fr: 1. Tout d'abord, vous devez installer l'application oathtoken sur votre iPhone.
it: 1. È necessario installare inizialmente l'applicazione oathtoken sull'iPhone.

source: link for iPhone
es: Enlace para iPhone
fr: Lien pour iPhone
it: Link per iPhone

source: Using the QR Code you can directly go to install the oath token on your iPhone.
es: Con el código QR puede instalar directamente la aplicación oathtoken en su iPhone.
fr: Avec le QR Code, vous pouvez directement installer l'application oathtoken sur votre iPhone.
it: Con il codice QR è possibile installare direttamente l'applicazione oathtoken sull'iPhone.

source: 2. Then you may create a profile.
es: 2. A continuación podrá crear su token/perfil.
fr: 2. Ensuite, vous pouvez créer votre token/profil.
it: 2. Successivamente è possibile creare il token / profilo.

source: enroll OATH Token
es: crear token OATH
fr: Générer un token OATH
it: Creare token OATH

source: successfully created!
es: ¡Creado correctamente!
fr: créé avec succès !
it: generato con successo!

source: Click on this link to install the oathtoken profile to your iPhone:
es: Haga clic en este enlace en su teléfono inteligente para instalar el perfil en su iPhone:
fr: Sur votre smartphone, cliquez sur ce lien pour installer le profil sur votre iPhone :
it: Clicca nello smartphone su questo link per installare il profilo sull'iPhone:

source: install profile
es: Instalar perfil
fr: Installer un profil
it: Installare il profilo

source: Or you can scan the QR code below your iPhone to import the secret.
es: De manera alternativa, escanee el código QR que aparece abajo con su iPhone para importar el perfil.
fr: Sinon, numérisez le code QR affiché ci-dessous avec votre iPhone pour importer le profil.
it: In alternativa scansiona il codice QR con l'iPhone per importare il profilo.

source: Error: %s
fr: Erreur : %s
it: Errore: %s

source: OCRA suite
fr: Suite OCRA
it: Suite OCRA

source: QRToken
fr: Token QR

source: Vasco Token
fr: Token Vasco

source: Error
fr: Erreur
it: Errore

source: Transaction-ID
fr: Identifiant de transaction
it: ID della transazione

source: UserId
fr: Identifiant utilisateur
it: ID Utente

source: Userlist
fr: Liste utilisateur
it: Lista utenti
