Repository: pypi-data/pypi-mirror-18
Catalog: packages/LinOTP/LinOTP-2.9.0.5.tar.gz/LinOTP-2.9.0.5/linotp/i18n/*/LC_MESSAGES/linotp.po
Languages: es, fr, it

source: Error assigning Token:
es: Error durante la asignación del token:
fr: Erreur dans l'attribution du token :
it: Errore durante l'assegnazione del token:

source: You need to enter an OTP value
es: Debe especificar un valor OTP
fr: Vous devez spécifier une valeur OTP
it: Occorre specificare un valore OTP

source: No Token with this OTP value found!
es: No se ha encontrado ningún token con este valor OTP
fr: Aucun token trouvé avec cette valeur OTP
it: Nessun token trovato con questo valore OTP

source: Error getting serial:
es: Error durante la determinación del número de serie
fr: Erreur lors de la détermination du numéro de série
it: Errore durante la determinazione del numero di serie

source: Error calling token:
es: Error al solicitar el token
fr: Erreur lors de l'appel du token
it: Errore durante il richiamo Token

source: Token enrollment result
es: Resultado de la implementación del token
fr: Résultat-Déploiement-Token
it: Risultato srotolamento token

source: Token enrolled successfully
es: El token se ha implementado correctamente
fr: Le token a été déployé avec succès
it: Il token è stato srotolato con successo

source: Failed to enroll token:
es: Error durante la implementación del token:
fr: Échec du déploiement du token :
it: Srotolamento del token fallito:

source: Failcounter resetted successfully
es: Contador de errores puesto a cero correctamente
fr: Compteur d'erreurs réinitialisé avec succès
it: Contatore errori resettato con successo

source: Failed to reset failcounter!
es: Error durante la puesta a cero del contador de errores
fr: Erreur lors de la réinitialisation du compteur d'erreurs
it: Errore durante il reset del contatore errori

source: Token disabled successfully
es: Token desactivado correctamente
fr: Token désactivé avec succès
it: Token disattivato con successo

source: Error disabling Token!
es: Error durante la desactivación del token
fr: Erreur lors de la désactivation du token
it: Errore durante la disattivazione del token

source: Token enabled successfully
es: Token activado correctamente
fr: Token activé avec succès
it: Token attivato con successo

source: Error enabling Token!
es: Error durante la activación del token
fr: Erreur lors de l'activation du token
it: Errore durante l'attivazione del token

source: OTP values for token
es: Valores OPT para token
fr: Valeurs OTP pour le token
it: Valori OTP per token

source: Counter
es: Contador
fr: Compteur
it: Contatore

source: Otp Value
es: Valor OTP
fr: Valeur OTP
it: Valore OTP

source: Error getting otp values
es: Error durante la consulta del valor OTP
fr: Erreur lors de la demande de la valeur OTP
it: Errore di query del valore OTP

source: Token unassigned successfully
es: Asignación de token cancelada correctamente
fr: Attribution du token supprimée avec succès
it: Assegnazione token cancellata con successo

source: Error unassigning Token!
es: Error durante la cancelación de la asignación de token
fr: Erreur lors de la suppression de l'attribution du token
it: Errore durante la cancellazione dell'assegnazione token

source: Token deleted successfully
es: Token eliminado correctamente
fr: Token supprimé avec succès
it: Token eliminato con successo

source: Failed to delete token!
es: Error durante la eliminación del token
fr: Erreur lors de la suppression du token
it: Errore durante l'eliminazione del token

source: Failed to enroll token!
es: Error durante la implementación del token
fr: Erreur lors du déploiement du token
it: Errore durante lo srotolamento del token

source: Failed to activate token!
es: Error durante la activación del token
fr: Erreur lors de l'activation du token
it: Errore durante l'attivazione del token

source: Error loading history:
es: Error al cargar el historial:
fr: Erreur lors du chargement de l'historique :
it: Errore durante il caricamento della cronologia:

source: Could not migrate tokens!
es: ¡No ha sido posible migrar el token!
fr: Impossible de migrer le token !
it: Impossibile migrare il token!

source: Authentication
es: Autenticación
fr: Authentification
it: Autenticazione

source: You need to enable Javascript to use the authentication forms.
es: Debe habilitar Javascript para poder utilizar los formularios de autenticación
fr: Vous devez activer JavaScript pour pouvoir utiliser les formulaires d'authentification
it: Occorre attivare gli JavaScript per poter utilizzare i moduli di autenticazione

source: Here you may try to authenticate using your OCRA OTP token.
es: Aquí podrá autenticarse con su token OTP OCRA.
fr: Ici, vous pouvez vous authentifier avec votre token OCRA OTP.
it: Qui è possibile autenticare token con OCRA OTP.

source: Enter your username, the OTP PIN and the OTP value.
es: Introduzca su nombre de usuario, el PIN OTP y el valor OTP.
fr: Entrez votre nom d'utilisateur, le code PIN OTP et la valeur OTP.
it: Inserisci il nome utente, il PIN OTP e il valore OTP.

source: OCRA Login
es: Inicio de sesión OCRA
fr: Connexion OCRA
it: Registrazione OCRA

source: Submit a challenge:
es: Introducir desafío:
fr: Entrez un défi :
it: Inserire challenge:

source: username
es: Nombre de usuario
fr: Nom d'utilisateur
it: Nome utente

source: challenge
es: Desafío
fr: Défi

source: get challenge
es: Buscar desafío
fr: Trouvé le défi
it: Hole Challenge

source: Scan your challenge and get your OTP:
es: Escanee el desafío y tome su valor OTP:
fr: Numérisez un défi et cherchez votre valeur OTP :
it: Effettuare la scansione del challenge e ottenere il valore OTP:

source: Login:
es: Iniciar sesión:
fr: Identifiant :

source: OTP PIN and OTP value
es: PIN OTP y valor OTP
fr: Code PIN OTP et valeur OTP
it: OTP PIN e valore OTP

source: login
es: Iniciar sesión
fr: Connexion

source: Enter your username, the OTP PIN and the input for the challenge.
es: Introduzca su nombre de usuario, el PIN OTP y el texto para el desafío.
fr: Entrez votre nom d'utilisateur, le code PIN OTP et le texte pour le défi.
it: Inserisci il nome utente, il PIN OTP e il testo per challenge.

source: By submitting this you will generate a QR image, that can be scaned with your OCRA2 Token reader.
es: Aquí se genera una imagen de QR que podrá escanear con su escáner de token OCRA2.
fr: Ici, une image QR est générée, ce qui vous permet de la numériser avec votre scanner token OCRA2.
it: Viene generata un'immagine QR che permette di eseguire la scansione con lo scanner token OCRA2.

source: To verify your result enter the OTP value into the form below.
es: Por favor, introduzca el valor OTP para su verificación.
fr: Pour vérification, veuillez entrer ci-dessous la valeur OTP.
it: Inserire il valore OTP per la verifica.

source: OCRA2 Login
es: Inicio de sesión OCRA2
fr: Connexion OCRA2
it: Registrazione OCRA2

source: OTP PIN
es: PIN OTP
it: PIN OTP

source: message / data
es: mensaje / datos
fr: message/donnée
it: messaggio / dati

source: Here you may try to authenticate using your QRToken.
es: Aquí puede probar a autenticar utilizando su QRToken.
fr: Ici, vous pouvez essayer d'authentifier en utilisant votre QR Token.
it: Qua puoi provare ad autenticarti utilizzando il tuo QRToken.

source: QRToken Login
es: Iniciar sesión QRToken
fr: Connexion QRToken
it: Login QRToken

source: Create challenge:
es: Crear desafío:
fr: Créer le défi
it: Crea challenge:

source: Check the status of your challenge:
es: Compruebe el estado de su desafío:
fr: Vérifiez le statut de votre défi :
it: Controlla lo stato della tua challenge:

source: check status
es: comprobar estado
fr: vérifier le statut
it: controlla stato

source: Submit response:
es: Enviar respuesta:
fr: Soumettre la réponse :
it: Invia challenge:

source: OTP value
es: Valor OTP
fr: Valeur OTP
it: Valore OTP

source: submit
es: enviar
fr: Soumettre
it: invia

source: Here you may try to authenticate using your OTP token.
es: Aquí puede probar la autenticación con su token OTP.
fr: Ici, vous pouvez tester l'authentification avec votre token OTP.
it: Qui è possibile verificare l'autenticazione con il token OTP.

source: Enter your username, the OTP PIN (Password) and the OTP value.
es: Introduzca su nombre de usuario, el PIN OTP y el valor OTP.
fr: Entrez votre nom d'utilisateur, le code PIN OTP et la valeur OTP.
it: Inserisci il nome utente, il PIN OTP e il valore OTP.

source: Login
es: Iniciar sesión
fr: Connexion

source: LinOTP 2 Management
es: Gestión LinOTP
fr: Gestion LinOTP
it: Gestione LinOTP

source: LinOTP Config
es: Configuración LinOTP
fr: Configuration LinOTP
it: Configurazione LinOTP

source: System Config
es: Configuración del sistema
fr: Configuration système
it: Configurazione di sistema

source: Provider Config
es: Configuración del proveedor
fr: Configuration du fournisseur d'accès
it: Configurazione provider

source: SMS Provider Config
es: Configuración del proveedor SMS
fr: Configuration de l'opérateur SMS
it: Configurazione provider SMS

source: Email Provider Config
es: Configuración del proveedor de correo electrónico
fr: Configuration de l'opérateur d'email
it: Configurazione provider e-mail

source: Policies
es: Directrices
fr: Directives
it: Criteri

source: Tools
es: Herramientas
fr: Outils
it: Strumenti

source: Get Serial by OTP
es: Determine el número de serie a través del valor OTP
fr: Déterminez le numéro de série via la valeur OTP
it: Determina il numero di serie tramite il valore OTP

source: Copy Token PIN
es: Copie el PIN del token
fr: Copiez le code PIN du token
it: Copia il PIN del token

source: Check Policy
es: Probar directriz
fr: Tester la directive
it: Testare i criteri

source: Export Token Info
es: Exportar información del token
fr: Exporter les informations du token
it: Esportare le informazioni sul token

source: Export Audit Trail
es: Exportar pista de auditoría
fr: Exporter l'Audit-Trail
it: Esportare Audit-Trail

source: Migrate Resolver
es: Migración del solucionador
fr: Migration du résolveur
it: Migrazione resolver

source: Import Token File
es: Importar archivo de token
fr: Importer le fichier du token
it: Importare file token

source: SafeNet/ Aladdin XML
es: SafeNet XML (Aladdin)
fr: SafeNet XML (Aladdin)
it: SafeNet XML (Aladdin)

source: Help
es: Ayuda
fr: Aide
it: Guida

source: Documentation
es: Documentación
it: Documentazione

source: Support and Subscription
es: Soporte y suscripción
fr: Support et abonnement
it: Supporto e abbonamento

source: About LinOTP
es: Sobre LinOTP
fr: À propos de LinOTP
it: Info su LinOTP

source: Logged in as
es: Sesión iniciada como
fr: Connecté en tant que
it: Collegato come

source: Logout
es: Cerrar sesión
fr: Fermer la session
it: Disconnetti

source: You need to enable Javascript to use the LinOTP Management Web UI.
es: Debe activar Javascript para utilizar la interfaz de usuario de Gestión LinOTP.
fr: Vous devez activer JavaScript afin de pouvoir utiliser l'interface Web de gestion LinOTP.
it: Occorre attivare gli Javascript per poter utilizzare LinOTP Management Web UI.

source: Selected User
es: Usuario seleccionado
fr: Utilisateur sélectionné
it: Utente selezionato

source: Selected Token
es: Token seleccionado
fr: Token sélectionné
it: Token selezionato

source: Enroll
es: Implementar
fr: Déployer
it: Srotola

source: Assign
es: Asignar
fr: Attribuer
it: Assegna

source: Unassign
es: Eliminar asignación
fr: Supprimer l'attribution
it: Annullare l'assegnazione

source: Enable
es: Activar
fr: Activer
it: Attiva

source: Disable
es: Desactivar
fr: Désactiver
it: Disattiva

source: Set PIN
es: Establecer PIN
fr: Définir le code PIN
it: Impostare il PIN

source: Reset Failcounter
es: Restablecer contador de errores
fr: Réinitialiser le compteur d'erreurs
it: Resettare contatore errori

source: Delete
es: Borrar
fr: Supprimer
it: Elimina

source: Close all
es: Cerrar todos
fr: Tout fermer
it: Chiudi tutto

source: Token View
es: Vista del token
fr: Aperçu token
it: Visualizzazione Token

source: User View
es: Vista del usuario
fr: Aperçu utilisateur
it: Visualizzazione utente

source: Audit Trail
es: Pista de auditoría

source: Settings
es: Ajustes
fr: Paramètres
it: Impostazioni

source: GUI settings
es: Ajustes de la GUI
fr: Paramètres GUI
it: Impostazioni GUI

source: Client Identification
es: Identificación del cliente
fr: Identification du client
it: Autenticazione cliente

source: Split at @ sign (splitAtSign)
es: Separar en el carácter @
fr: Séparer au signe @
it: Separazione nel carattere @

source: This will use the part right of an @-sign as realm
es: Esto utilizará la parte derecha de un símbolo @ como dominio
fr: La partie à droite du signe @ sera utilisée.
it: Questo utilizzerà la parte destra di un @-sign come regno

source: Return SAML attributes
es: Devolver atributos SAML
fr: Retourner les attributs SAML
it: Restituire attributi SAML

source: The /validate/samlcheck controller will also return user attributes
es: El controlador /validate/samlcheck devuelve atributos de usuario adicionales.
fr: Le Controller/validate/samlcheck renvoie les attributs d'utilisateurs supplémentaires.
it: Il controller /validate/samlcheck restituisce gli attributi utente aggiuntivi.

source: FailCounterIncOnFalsePin
es: Aumentar contador de errores si se indica un PIN incorrecto
fr: Incrémenter le compteur d'erreurs en cas de code PIN erroné
it: Incrementare il contatore errori in caso di PIN errato

source: This will increase the failcounter, if the user provided a wrong PIN.
es: El contador de errores aumentará cuando el usuario introduzca un PIN incorrecto y no sea posible identificar el token.
fr: Ici, le nombre d'erreurs est incrémenté lorsque l'utilisateur spécifie un code PIN erroné et que le token ne peut pas être identifié.
it: Qui viene incrementato il contatore errori quando l'utente specifica un PIN errato e il token non può essere identificato.

source: PrependPin
es: Anteponer el PIN
fr: Préréglage du code PIN
it: Anteporre il PIN

source: This will prepend the PIN to the OTP value. Otherwise the PIN will be appended.
es: El PIN se colocará delante del valor OTP. De lo contrario, el PIN se indica detrás del valor OTP.
fr: Le code PIN est placé avant la valeur OTP. Sinon, le code PIN est indiqué derrière la valeur OTP.
it: Il PIN viene inserito prima del valore OTP. Diversamente il PIN viene indicato dopo il valore OTP.

source: Auto resync
es: Resincronización automática
fr: Resynchronisation automatique
it: Risincronizzazione automatica

source: This will automatically resync OTP counter of HMAC based tokens.
es: Para los tokens basados ​​en HMAC se intentará una resincronización automática si el usuario introduce dos valores OTP incorrectos de forma consecutiva.
fr: Pour les token basés sur HMAC, une resynchronisation automatique est tentée si l'utilisateur entre deux valeurs OTP erronées consécutivement.
it: Per token a base HMAC si tenta una risincronizzazione automatica se l'utente inserisce due valori OTP errati in successione.

source: Auto resync timeout
es: Tiempo límite para la sincronización automática
fr: Délai d'attente pour la synchronisation automatique
it: Timeout per la sincronizzazione automatica

source: The time in which the two successive OTP values need to be entered (in seconds)
es: Después de este tiempo (en segundos) se desechará el primer valor OTP.
fr: Après ce délai (en secondes), la première valeur OTP sera rejetée.
it: Trascorso questo tempo (in secondi) il primo valore OTP viene nuovamente scartato.

source: Pass on user not found
es: Permitir el acceso si el usuario no existe
fr: Autoriser l'accès si utilisateur n'existe pas
it: Consentire l'accesso se l'utente non esiste

source: If checked, users who are not found in the useridresolvers are authenticated successfully. USE WITH CAUTION!
es: Si el usuario no existe, la solicitud de autenticación se responderá de forma positiva. Por tanto, todos los nombres de usuario que no existan se autenticarán correctamente. ¡PRESTE ATENCIÓN DURANTE SU USO!
fr: Si l'utilisateur n'existe pas, la demande d'authentification obtiendra une réponse positive. Tous les noms d'utilisateur qui n'existent pas sont donc authentifiés avec succès. ATTENTION LORS DE L'UTILISATION !
it: Se l'utente non esiste, la richiesta di autenticazione ottiene una risposta positiva. Tutti i nomi utenti che non esistono vengono quindi autenticati con successo. ATTENZIONE DURANTE L'USO!

source: Pass on user no token
es: Permitir el acceso cuando el usuario no tenga ningún token
fr: Autoriser l'accès si l'utilisateur n'a pas de token
it: Consentire l'accesso se l'utente non dispone di token

source: If checked, users who have no token get authenticated automatically successful. USE WITH CAUTION!
es: El usuario se autenticará correctamente cuando el usuario existe pero no posee ningún token. ¡PRESTE ATENCIÓN DURANTE SU USO!
fr: Si l'utilisateur existe certes, mais s'il n'a pas de token, l'utilisateur sera authentifié avec succès. ATTENTION LORS DE L'UTILISATION !
it: Se l'utente esiste, ma non dispone di token, l'utente viene autenticato con successo. ATTENZIONE DURANTE L'USO!

source: Authorization
es: Autorización
fr: Autorisation
it: Autorizzazione

source: Override authentication client
es: Sobrescribir cliente que debe ser autenticado
fr: Écraser le client authentifié
it: Sovrascrivere client di autenticazione

source: This is a comma separated list of clients, that may send another client IP for authorization policies.
es: Se trata de una lista separada por comas de direcciones IP que pueden enviar una dirección IP distinta a la propia para las directrices de autorización.
fr: C'est une liste d'adresses IP séparées par des virgules qui sont autorisées à envoyer une adresse IP différente de la leur pour les directives d'autorisation.
it: Si tratta di un elenco separato da virgole di indirizzi IP che possono inviare un indirizzo IP diverso per i criteri di autorizzazione al posto del proprio indirizzo IP.

source: Selfservice portal
es: Portal de autogestión
fr: Portail d'auto-gestion
it: Portale auto-gestione

source: Display realm select box
es: Mostrar lista de selección del dominio
fr: Afficher la liste de sélection des domaines
it: Visualizzare elenco di selezione Realm

source: If checked a realm dropdown box will be displayed on the selfservice portal logon page.
es: Se mostrará una lista desplegable en la que el usuario podrá seleccionar el dominio en el que desea iniciar sesión en el portal de autogestión.
fr: Une liste déroulante apparaît, à partir de laquelle l'utilisateur peut choisir le domaine dans lequel il veut se connecter via le portail d'auto-gestion.
it: Viene visualizzato un elenco a discesa, da cui l'utente può selezionare il Realm in cui vuole registrarsi nel portale di auto-gestione.

source: Client Identification with Proxy
es: Identificación del cliente con proxy
fr: Identification du client avec Proxy
it: Autenticazione cliente con proxy

source: Support for HTTP_X_FORWARDED_FOR
es: Soporte para HTTP_X_FORWARDED_FOR
fr: Support pour HTTP_X_FORWARDED_FOR
it: Supporto per HTTP_X_FORWARDED_FOR

source: Support for HTTP_FORWARDED
es: Soporte para HTTP_FORWARDED
fr: Support pour HTTP_FORWARDED
it: Supporto per HTTP_FORWARDED

source: Trusted Forwarding Proxy
es: Proxy transmisor de confianza
fr: Proxy de transfert de confiance
it: Proxy sicura in arrivo

source: The ip address of the trusted forwarding proxy, which provides the REMOTE_ADDR.
es: La dirección IP del proxy transmisor de confianza, que proporciona la REMOTE_ADDR.
fr: L'adresse IP du proxy de transfert de confiance, qui fournit la REMOTE_ADDR.
it: L'indirizzo IP della proxy sicura in arrivo, che fornisce la REMOTE_ADDR.

source: Save Config
es: Guardar configuración
fr: Enregistrer la configuration
it: Salvataggio configurazione

source: Set as default
es: Establecer como predeterminado
fr: Réglage par défaut.
it: Impostare come predefinito

source: SMS Provider: create and edit
es: Proveedor de SMS: crear y editar
fr: Configuration du fournisseur d'accès SMS
it: Provider SMS: crea e modifica

source: New
es: Nuevo
fr: Nouveau
it: Nuovo

source: Edit
es: Editar
fr: Éditer
it: Modifica

source: Class
es: Clase
fr: Classe
it: Classe

source: Config
es: Configurar
fr: Configuration
it: Configurazione

source: Timeout
es: Tiempo límite
fr: Délai d'attente

source: SMS Provider
es: Proveedor SMS
fr: Opérateur SMS
it: Provider SMS

source: Save
es: Guardar
fr: Enregistrer
it: Salva

source: Do you want to delete the provider?
es: ¿Desea eliminar el proveedor?
fr: Souhaitez-vous supprimer l'opéraeur ?
it: Vuoi eliminare il provider?

source: Deleting provider
es: Eliminando el proveedor
fr: Supprimer l'opérateur
it: Eliminazione del provider in corso

source: Email Provider: create and edit
es: Proveedor de correo electrónico: crear y editar
fr: Fournisseur email : créer et modifier
it: Provider e-mail: crea e modifica

source: Timeout (sec)
es: Tiempo límite (seg)
fr: Arrêt (sec)

source: Email Provider
es: Proveedor de correo electrónico
fr: Fournisseur d'email
it: Provider e-mail

source: Do you want to delete the Provider?
es: ¿Desea eliminar el Proveedor?
fr: Souhaitez-vous supprimer le fournisseur ?
it: Vuoi eliminare il provider?

source: Email Provider Configuration
es: Configuración del proveedor de correo electrónico
fr: Configuration fournisseur e-mail
it: Configurazione del provider e-mail

source: OCRA Token
es: Token OCRA
fr: Token OCRA
it: Token OCRA

source: Default Settings
es: Configuración predeterminada
fr: Paramètres par défaut
it: Impostazioni predefinite

source: OCRA token settings
es: Configuración del token OCRA
fr: Paramètres du token OCRA
it: Impostazioni token OCRA

source: Maximum concurrent OCRA challenges
es: Número máximo de desafíos OCRA simultáneos
fr: Nombre maximum de défis OCRA simultanés
it: Numero massimo di challenge simultanee OCRA

source: This is the maximum concurrent challenges per OCRA Token.
es: Este es el número máximo de desafíos OCRA simultáneos que pueden solicitarse para un token OCRA.
fr: C'est le nombre maximum de défis OCRA simultanés, qui peuvent être demandés pour un token OCRA.
it: Questo è il numero massimo di challenge OCRA simultanee, che possono essere richieste per un token OCRA.

source: OCRA challenge timeout
es: Tiempo límite para el desafío OCRA
fr: Délai d'attente pour le défi OCRA
it: Timeout per challenge OCRA

source: Default OCRA suite
es: OCRA Suite estándar
fr: Suite OCRA standard
it: Suite OCRA standard

source: This is the suite for newly enrolled OCRA tokens. Default is OCRA-1:HOTP-SHA256-8:C-QA08
es: Esta es la suite OCRA por defecto para un token de OCRA recién implementado. Estándar: OCRA-1:HOTP-SHA256-8:C-QA08
fr: C'est la suite OCRA par défaut pour un token OCRA nouvellement déployé. Standard : OCRA-1:HOTP-SHA256-8:C-QA08
it: Questa è la suite OCRA di default per un token OCRA appena srotolato. Standard: OCRA-1:HOTP-SHA256-8:C-QA08

source: Default QR suite
es: Estándar QR-suite
fr: Suite QR standard
it: Suite QR standard

source: This is the suite for newly enrolled OCRA tokens. Default is OCRA-1:HOTP-SHA256-6:C-QA64
es: Este es la suite para tokens OCRA recién inscritos. La configuración predeterminada es OCRA-1:HOTP-SHA256-6:C-QA64
fr: Ceci est la suite pour les tokens OCRA nouvellement inscrits. Par défaut est OCRA-1: HOTP-SHA256-6: C-QA64
it: Questa è la suite per token OCRA appena iscritti. Predefinito è OCRA-1:HOTP-SHA256-6:C-QA64

source: Default token settings
es: Configuración predeterminada de token
fr: Paramètres par défaut du token
it: Impostazioni token predefinite

source: DefaultResetFailCount
es: Restablecer contador de errores por defecto
fr: Réinitialiser le compteur d'erreurs par défaut
it: Resettare di default contatore errori
