Repository: pypi-data/pypi-mirror-18
Catalog: packages/LinOTP/LinOTP-2.9.0.5.tar.gz/LinOTP-2.9.0.5/linotp/i18n/*/LC_MESSAGES/linotp.po
Languages: es, fr, it

source: Will reset the fail counter when the user authenticated successfully
es: Restablece el contador de errores cuando el usuario ha iniciado sesión correctamente con este token.
fr: Réinitialise le compteur d'erreurs lorsque l'utilisateur s'est connecté avec succès avec ce token.
it: Azzera il contatore errori dopo che l'utente si è collegato con successo con questo token.

source: DefaultMaxFailCount
es: Valor máximo estándar para el contador de errores
fr: Valeur maximale standard pour le compteur d'erreurs
it: Valore massimo standard per il contatore errori

source: This is the maximum allowed failed logins for a new enrolled token.
es: Este es el número máximo de intentos de acceso fallidos con un token. Tras esto se bloqueará el token hasta que se restablezca el contador de errores manualmente.
fr: Ceci est le nombre maximum de tentatives de connexion infructueuses avec un token. Ensuite, le token est bloqué jusqu'à ce que le compteur d'erreurs ait été réinitialisé manuellement.
it: Questo è il numero massimo di tentativi di accesso non riusciti con un token. Il token viene successivamente bloccato fino a quando il contatore errori non viene nuovamente resettato manualmente.

source: DefaultCountWindow
es: Ventana del contador estándar
fr: Fenêtre du compteur standard
it: Finestra contatore standard

source: This is the default look ahead window for counter based tokens.
es: En esta ventana del contador se buscará por defecto el valor OTP en caso de haber un token nuevo.
fr: Dans cette fenêtre du compteur, la valeur OTP d'un nouveau token est recherchée par défaut.
it: In questa finestra contatore viene cercato di default il valore OTP in presenza di un nuovo token.

source: DefaultSyncWindow
es: Ventana de resincronización estándar
fr: Fenêtre de resynchronisation standard
it: Finestra di risincronizzazione standard

source: A new token will have this window to do the manual or automatic OTP sync.
es: Un nuevo token dispondrá de esta ventana para hacer la sincronización OTP manual o automática.
fr: C'est la fenêtre de resynchronisation pour la resynchronisation automatique et manuelle d'un token.
it: Un nuovo token utilizzera questa finestra per eseguire la sincronizzazione manuale o automatica OTP

source: DefaultOtpLen
es: Longitud estándar OTP
fr: Longueur standard OTP
it: Lunghezza OTP standard

source: A new token will be set to this OTP length.
es: El valor OTP de un token nuevo se interpretará con esta longitud.
fr: La valeur OTP d'un nouveau token est interprétée avec cette longueur.
it: Il valore OTP di un nuovo token viene interpretato con questa lunghezza.

source: DefaultChallengeValidityTime
es: Período de validez estándar de un desafío
fr: Période de validité standard d'un défi
it: Periodo di validità standard di una challenge

source: Default validity timeframe of a challenge.
es: Ventana de tiempo de validez estándar para un desafío
fr: Fenêtre temporelle de validité pour un défi
it: Finestra temporale standard di validità per una challenge

source: Tokentype Configuration
es: Configuración de los tipos de token
fr: Configuration du type de token
it: Configurazione dei tipi di token

source: Support Contact
es: Contacto para soporte
fr: Contact support
it: Contatta il supporto

source: LSE LinOTP Support and Subscription
es: Soporte y suscripción LSE LinOTP
fr: LSE LinOTP support et abonnement
it: Supporto e abbonamento LSE LinOTP

source: Set Support and Subscription
es: Registrar soporte y suscripción
fr: Enregistrer le support et l'abonnement
it: Registrazione supporto e abbonamento

source: Please choose your support and subscription file
es: Por favor, seleccione un archivo de soporte y suscripción
fr: Veuillez sélectionner un fichier de support et d'abonnement
it: Selezionare un file di supporto e abbonamento

source: LinOTP - the open source solution for two factor authentication.
es: LinOTP, la solución de código abierto para la autenticación de dos factores.
fr: LinOTP - la solution Open Source pour l'authentification à deux facteurs.
it: LinOTP - la soluzione Open Source per l'autenticazione a due fattori.

source: Licensed under AGPLv3
es: Bajo licencia AGPLv3
fr: Distribué sous licence AGPLv3
it: Autorizzato da AGPLv3

source: For more information please visit:
es: Encontrará más información en:
fr: Pour plus d'informations, consultez :
it: Per ulteriori informazioni, consultare:

source: or
es: o
fr: ou
it: o

source: Authors:
es: Autores:
fr: Auteurs :
it: Autori:

source: About LSE LinOTP
es: Sobre LSE LinOTP
fr: À propos de LSE LinOTP
it: Info su LinOTP

source: You may reset the PINs for the tokens
es: Puede restaurar los PIN para el token
fr: Vous pouvez réinitialiser les codes PIN pour le token
it: È possibile resettare i PIN dei token

source: PIN type
es: Tipo de PIN
fr: Type de code PIN
it: Tipo di PIN

source: PIN (again)
es: PIN (repetir)
fr: Code PIN (répéter)
it: PIN (ripetere)

source: The token will be enrolled for user
es: Implementación del token para el usuario
fr: Déployer le token pour l'utilisateur
it: Srotolamento del token per l'utente

source: Currently this token will not be assigned to any users.
es: Actualmente este token no será asignado a ningún usuario.
fr: Ce token n'est actuellement attribué à aucun utilisateur.
it: Questo token non viene assegnato a nessun utente.

source: If you select one user, this token will be automatically assigned to this user. Anyhow, you can assign this token to any user later on.
es: Si selecciona un usuario, el token se asignará automáticamente al usuario. No obstante, también podrá asignarlo a un usuario más adelante.
fr: Si vous sélectionnez un utilisateur, le token est automatiquement attribué à l'utilisateur. Vous pouvez également attribuer un token à un utilisateur ultérieurement.
it: Se si seleziona un utente, il token viene assegnato automaticamente all'utente. È anche possibile assegnare il token ad un utente in un secondo momento.

source: You selected more than one user. If you want to assign the token to a user during enrollment, you need to select only one user. Anyhow, you can assign this token to any user later on.
es: Ha seleccionado más de un usuario. Si desea asignar el token a un usuario, solo puede seleccionar un único usuario. No obstante, también podrá asignarlo a un usuario más adelante.
fr: Vous avez sélectionné plus d'un utilisateur. Si vous voulez attribuer le token à un utilisateur, veuillez ne sélectionnez qu'un seul utilisateur. Mais vous pouvez également attribuer un token à un utilisateur ultérieurement.
it: È stato selezionato più di un utente. Se si desidera assegnare il token ad un utente, selezionare un singolo utente. E' sempre possibile assegnare il token ad un utente anche in un secondo momento.

source: Token type
es: Tipo de token
fr: Type de token
it: Tipo di token

source: OCRA - challenge/response Token
es: OCRA - Token desafío/respuesta
fr: OCRA - Token défi/réponse

source: Please enter or copy the OCRA key.
es: Por favor, introduzca la clave OCRA.
fr: Veuillez entrer la clé OCRA.
it: Inserisci la chiave OCRA.

source: OCRA key
es: Clave OCRA
fr: Clé OCRA
it: Chiave OCRA

source: Generate OCRA key.
es: Dejar que el servidor genere la clave OCRA.
fr: Faire générer la clé OCRA par le serveur.
it: Far generare la chiave OCRA dal server.

source: Enroll Token
es: Implementar token
fr: Déployer le token
it: Srotolare il token

source: Here you can search for the serial of a token.You need to enter the current OTP value, and choose where you want to search for this token.
es: Aquí puede buscar el número de serie de un token. Debe introducir el valor OTP actual del token y elegir dónde y con qué criterios se debe buscar el token.
fr: Ici, vous pouvez rechercher le numéro de série d'un token. Vous devez saisir la valeur OTP actuelle du token et sélectionner où et avec quels critères vous souhaitez rechercher le token.
it: Qui è possibile cercare il numero di serie di un token. È necessario immettere il valore OTP corrente del token e scegliere dove e con quali criteri si intende cercare il token.

source: Beware: This can be time consuming!
es: Advertencia: ¡Esto puede tardar mucho tiempo!
fr: Attention : cela peut prendre beaucoup de temps !
it: Attenzione: questa operazione può richiedere molto tempo!

source: Assigned token
es: Token asignados
fr: Token attribués
it: Token assegnati

source: assigned
es: asignado
fr: attribué
it: assegnato

source: not assigned
es: sin asignar
fr: non attribué
it: non assegnato

source: Get Serial by OTP value
es: Determinar el número de serie a través del valor OTP
fr: Déterminer le numéro de série par l'intermédiaire de la valeur OTP
it: Determinazione del numero di serie tramite valore OTP

source: Get Serial
es: Determinar número de serie
fr: Déterminer le numéro de série
it: Determinazione del numero di serie

source: Here you can check your policies.
es: Aquí puede probar sus directrices.
fr: Ici, vous pouvez tester vos directives.
it: Qui è possibile testare i criteri.

source: You can enter the corresponding values and the system will check, if there is any matching policy for this scenario.
es: Puede introducir los valores correspondientes y el sistema comprobará si hay una directriz adecuada.
fr: Vous pouvez entrer des valeurs respectives et le système vérifie s'il existe une directive correspondante.
it: È possibile immettere i relativi valori ed il sistema verifica se esiste un criterio adatto.

source: This action is allowed by the following policy:
es: Esta acción está permitida por la siguiente directriz:
fr: Cette action est autorisée par la directive suivante :
it: Questa azione è consentita dal seguente criterio:

source: This action is not allowed by any policy!
es: ¡Esta acción no está permitida por ninguna directriz!
fr: Cette action n'est autorisée par aucune directive !
it: Questa azione non è consentita da nessun criterio!

source: Here you can export token information of the tokens you are allowed to view to a CSV file.
es: Aquí puede exportar la información del token como un archivo CSV para cuya visualización está autorizado.
fr: Ici, vous pouvez exporter les informations du token dans un fichier CSV, que vous êtes autorisé à voir.
it: Qui è possibile esportare le informazioni del token come file CSV che si è autorizzati a vedere.

source: You can enter additional attributes, you defined in the user mapping in the UserIdResolver. These attributes will be added to the CSV file.
es: Puede introducir atributos adicionales que deban incluirse en la exportación CSV. Estos atributos deben estar definidos en la correlación de atributos en UserIdResolver.
fr: Vous pouvez entrer des attributs supplémentaires à inclure dans l'exportation CSV. Ces attributs doivent être définis dans le Attribute-Mapping dans le UserIdResolver.
it: È possibile inserire attributi aggiuntivi da includere nell'esportazione CSV. Questi attributi devono essere definiti nel mapping degli attributi in UserIdResolver.

source: Export
es: Exportar
fr: Exporter
it: Esporta

source: Here you can export the audit information to a CSV file.
es: Puede exportar la información de auditoría como un archivo CSV.
fr: Vous pouvez exporter les informations d'audit dans un fichier CSV.
it: Qui è possibile esportare le informazioni Audit come file CSV.

source: Number of audit entries to export
es: Número de entradas de auditoría que deben exportarse
fr: Nombre d'entrées d'audit à exporter
it: Numero di voci di Audit da esportare

source: Enter the number of audit entries you want to export.
es: Por favor, introduzca el número de entradas de auditoría que desee exportar.
fr: Veuillez entrer le nombre d'entrées d'audit que vous souhaitez exporter.
it: Inserisci il numero di voci di Audit che desideri esportare.

source: Page to export
es: Página que se debe exportar
fr: Page à exporter
it: Pagina da esportare

source: Enter the page of the audit entries you want to export.
es: Por favor, introduzca la página de auditoría con las entradas de auditoría que desee exportar.
fr: Veuillez entrer la page d'audit avec les entrées d'audit que vous souhaitez exporter.
it: Specifica la pagina Audit con le relative voci che desideri esportare.

source: Here you can copy the OTP PIN from one token to the other.
es: Aquí puede transferir el PIN OTP de un token a otro sin conocer el PIN.
fr: Ici, vous pouvez transférer le code PIN OTP d'un token à un autre token sans connaître le code PIN.
it: Qui è possibile trasferire il PIN OTP di un token ad un altro token senza conoscere il PIN.

source: Please enter the serial number of the token with the existing PIN and the serial number of the token, that should get the same PIN.
es: Por favor, introduzca el número de serie del token con el PIN existente y el número de serie del token que deba recibir el PIN nuevo.
fr: Veuillez entrer le numéro de série du token avec le code PIN existant et le numéro de série du token que le nouveau code PIN doit obtenir.
it: Inserisci il numero di serie del token con il PIN esistente e il numero di serie del token a cui deve essere trasferito il nuovo PIN.

source: From token
es: Del token
fr: Du token
it: Dal Token

source: To token
es: Al token
fr: Vers le token
it: al Token

source: Copy PIN
es: Copiar PIN
fr: Copie le code PIN
it: Copia PIN

source: Migrate assigned tokens to a new resolver
es: Migrar token asignados a un solucionador nuevo
fr: Migre le token attribué vers un nouveau résolveur
it: Migrazione dei token assegnati ad un nuovo resolver

source: From resolver
es: Del solucionador
fr: Du résolveur
it: Dal resolver

source: To resolver
es: al solucionador
fr: vers le résolveur
it: al resolver

source: Migrate tokens
es: Migrar token
fr: Migre le token
it: Migrazione del token

source: Here you can upload the XML file that came with your SafeNet eToken PASS.
es: Aquí puede importar el archivo XML para su SafeNet eToken PASS.
fr: Ici, vous pouvez importer le fichier XML pour votre SafeNet eToken PASS.
it: Qui è possibile importare il file XML per il SafeNet eToken PASS.

source: Please choose the token file
es: Por favor, seleccione un archivo de token
fr: Veuillez sélectionner un fichier token
it: Seleziona un file token

source: automatic detection
es: reconocimiento automático
fr: Reconnaissance automatique
it: riconoscimento automatico

source: Target realm
es: Dominio de destino
fr: Domaine cible
it: Realm di destinazione

source: Aladdin XML Token File
es: Archivo de token Aladdin XML
fr: Fichier token XML Aladdin
it: File token Aladdin XML

source: Load Token File
es: Cargar archivo de token
fr: Charger le fichier token
it: Caricare file token

source: Here you may upload the XML file of any OATH compliant OTP Token.The LinOTP server will automatically recognize if the token is an HOTP (event based) or a TOTP (time based) token. If the HMAC secrets are encrypted you either need - depending on the encryption - the password or the encryption key.
es: Aquí puede importar el archivo XML para token compatibles con OATH. LinOTP detecta automáticamente si se trata de token basados en eventos (HOTP) o en el tiempo (TOTP). Si las semillas HMAC están cifradas, deberá indicar, dependiendo del cifrado, una contraseña o la clave de cifrado.
fr: Ici, vous pouvez importer le fichier XML pour OATH conforme au token. LinOTP détecte automatiquement si les token sont basés sur un évènement token (HOTP) ou sur le temps (TOTP). Si les seeds HMAC sont cryptées, vous devez - en fonction du cryptage - spécifier un mot de passe ou la clé de cryptage.
it: Qui è possibile importare il file XML per token compatibile con OATH. LinOTP rileva automaticamente se i token sono basati sugli eventi (HOTP) o sul tempo (TOTP). Se i seed HMAC sono crittografati, è necessario, a seconda della cifratura, specificare una password o la chiave di crittografia.

source: Check the serial numbers for OATH compliance (non-compliant serial numbers will be ignored)
es: Comprueba que los números de serie son conformes con OATH. Los token con números de serie no compatibles se ignorarán.
fr: Vérification les numéros de série sur OATH Compliance. Les token dont les numéros de série ne sont pas conformes seront ignorés.
it: Verifica dei numeri di serie affinché siano compatibili con OATH. I token con numeri di serie non conformi vengono ignorati.

source: plain value
es: Valores sin cifrar
fr: Valeurs non cryptées
it: Valori non crittografati

source: preshared key
es: Cifrado con clave precompartida
fr: Crypté par Preshared Key
it: Crittografati con Preshared Key

source: password protected
es: Cifrado con contraseña
fr: Crypté par mot de passe
it: Crittografati con password

source: PSKC Key File
es: Archivo PSKC
fr: Fichier PSKC
it: File PSKC

source: Here you can upload a CSV file for your OATH token. The file is supposed to contain one token per line
es: Aquí puede importar un archivo CSV que contenga definiciones de token OATH. Este archivo debe contener un token por línea.
fr: Vous pouvez importer un fichier CSV, qui contient des définitions OATH. Ce fichier doit contenir un token par ligne.
it: Qui è possibile importare un file CSV contenente le definizioni token OATH. Questo file deve contenere un token per riga.

source: For HOTP and TOTP tokens:
es: Para token HOTP y TOTP:
fr: Pour les token HOTP et TOTP :
it: Per token HOTP e TOTP:

source: Serial number, Seed, Type, OTP length, Time step
es: Número de serie, semilla, tipo, longitud OTP, unidad de tiempo
fr: Numéro de série, seed, type, longueur OTP, incrément de temps
it: Numero di serie, seed, tipo, lunghezza OTP, step temporale

source: For OCRA tokens:
es: Para token OCRA:
fr: Pour les token OCRA :
it: Per token OCRA:

source: Serial Number, Seed, Type, Ocra Suite
es: Número de serie, semilla, tipo, OCRA suite
fr: Numéro de série, seed, type, suite OCRA
it: Numero di serie, seed, tipo, Suite OCRA

source: Default Values:
es: Valores estándar
fr: Valeurs par défaut :
it: Valori di default:

source: optional
es: Opcional
fr: Facultatif
it: Opzionale

source: OATH CSV Token File
es: Archivo CVS de token OATH
fr: Fichier token OATH CSV
it: File token OATH CSV

source: Here you can upload a CSV file for your YubiKey token. The file is supposed to contain one token per line
es: Aquí puede importar un archivo CSV que contiene definiciones de token YubiKey. Este archivo debe contener un token por línea y puede crearse a través de la interfaz de usuario 'Yubikey-personalization-gui'.
fr: Ici, vous pouvez importer un fichier CSV qui contient des définitions de token YubiKey. Ce fichier doit contenir un token par ligne et peut être créé en utilisant le 'Yubikey-personalization-gui'.
it: Qui è possibile importare un file CSV contenente le definizioni YubiKey token. Questo file deve contenere un token per riga e può essere creato con 'Yubikey-personalization-gui'.

source: YubiKey CSV Token File
es: Archivo CSV de token YubiKey
fr: YubiKey CSV fichier de token
it: File token YubiKey CSV

source: Here you can upload the data file that came with your Tagespasswort tokens.
es: Aquí puede importar el archivo que viene con el token de contraseña diaria.
fr: Ici, vous pouvez importer le fichier fourni avec votre token avec mot de passe quotidien.
it: È possibile importare il file insieme al token password giornaliera.

source: Tagespasswort Token File
es: Archivo de token de contraseña diaria
fr: Fichier token mot de passe quotidien
it: File token password giornaliera

source: Upload the eToken data file:
es: Cargar archivo eToken .dat:
fr: Charger le fichier eToken .dat :
it: caricare file eToken .dat:

source: eToken DAT File
es: Archivo eToken .dat
fr: Fichier eToken .dat
it: File eToken .dat

source: Here you can upload the XML file that came with your Feitian tokens.
es: Aquí se puede importar el archivo XML para su token Feitian.
fr: Ici, vous pouvez importer le fichier XML pour votre token Feitian.
it: Qui è possibile importare il file XML per il token Feitian.

source: Feitian XML Token file
es: Archivo XML de token Feitian
fr: Fichier de token XML Feitian
it: File token Feitian XML

source: Import tokens from Vasco DPX file
es: Importar token desde el archivo Vasco DPX
fr: Importation de token du fichier Vasco DPX
it: Importare token da file Vasco DPX

source: Transport key:
es: Clave de transporte:
fr: Clé de transport :

source: Vasco DPX File
es: Archivo DPX VASCO
fr: Fichier VASCO DPX
it: File DPX VASCO

source: Here you can import your policy file.
es: Aquí puede importar el archivo de directrices.
fr: Ici, vous pouvez importer votre fichier de directive.
it: Qui è possibile importare il file criteri.

source: Please choose the policy file
es: Por favor, seleccione un archivo de directrices
fr: Veuillez sélectionner un fichier de directive
it: Seleziona un file di criteri

source: Import policies
es: Importar directrices
fr: Importer les directives
it: Importare criteri

source: Import policy file
es: Importar archivo de directrices
fr: Importer le fichier des directives
it: Importare file criteri

source: Create a new realm or select one available realm
es: Aquí puede crear un dominio nuevo o editar uno existente
fr: Ici, vous pouvez créer un nouveau domaine ou éditer un domaine existant
it: Qui è possibile creare un nuovo Realm o modificarne uno esistente

source: Set Default
es: Establecer como dominio predeterminado
fr: Définir comme domaine par défaut
it: Impostare come Realm predefinito

source: Clear Default
es: Eliminar estándar
fr: Supprimer le standard
it: Rimuovere predefinito

source: Create a new or select one available UserIdResolver
es: Aquí puede crear un solucionador nuevo o modificar uno existente
fr: Ici, vous pouvez créer un nouveau résolveur ou éditer un résolveur existant
it: Qui è possibile creare un nuovo resolver o modificarne uno esistente

source: Which type of resolver do you want to create?
es: ¿Qué tipo de UserIdResolver desea crear?
fr: Quel type de UserIdResolver souhaitez-vous créer ?
it: Che tipo di UserIdResolver si desidera inserire?

source: Creating a new UserIdResolver
es: Crear un UserIdResolver nuevo
fr: Créer un nouveau UserIdResolver
it: Creare un nuovo UserIdResolver

source: Flatfile
es: Archivo plano

source: Here you can add or remove existing resolvers to the realm
es: Aquí puede añadir o quitar solucionadores existentes de un dominio
fr: Ici, vous pouvez ajouter un résolveur existant à un domaine ou le supprimer d'un domaine
it: Qui è possibile aggiungere resolver esistenti a un Realm o rimuoverli da un Realm

source: You are creating a new realm.
es: Aquí se crea un dominio nuevo.
fr: Créez ici à un nouveau domaine.
it: Creare qui un nuovo Realm.

source: You may add resolvers by holding down Ctrl-Key and left-clicking.
es: Puede añadir solucionadores manteniendo pulsada la tecla Ctrl y haciendo clic con el botón izquierdo.
fr: Vous pouvez ajouter résolveur, en maintenant enfoncée la touche Ctrl et en effectuant un clic gauche.
it: È possibile aggiungere resolver tenendo premuto il tasto Ctrl e cliccando a sinistra.

source: Realm name
es: Nombre de dominio
fr: Nom du domaine
it: nome Realm

source: Here you may define the resolvers belonging to the realm
es: Aquí puede definir qué solucionadores pertenecen al dominio
fr: Ici, vous pouvez définir quels résolveurs appartiennent au domaine
it: Qui è possibile definire quali Resolver appartengono al Realm

source: Edit Realm
es: Editar dominio
fr: Éditer le domaine
it: Modificare Realm

source: The following tokens will be permanently deleted and can not be recovered.
es: Los token siguientes se eliminarán de forma permanente y no podrán recuperarse.
fr: Les token suivants sont définitivement supprimés et ne peuvent pas être restaurés.
it: I seguenti token vengono eliminati in modo permanente e non possono essere ripristinati.
