Repository: pypi-data/pypi-mirror-18
Catalog: packages/LinOTP/LinOTP-2.9.0.5.tar.gz/LinOTP-2.9.0.5/linotp/i18n/*/LC_MESSAGES/linotp.po
Languages: es, fr, it

source: enter token seed
es: Introducir semilla de token
fr: Entrer le token seed
it: Inserire un seme token

source: The Google Authenticator supports only 6 digits, SHA1 hashing and time step 30.
es: Google Authenticator solo es compatible con 6 dígitos, el algoritmo SHA1 Hash y una unidad de tiempo de 30 segundos.
fr: Google Authenticator supporte seulement 6 chiffres, l'algorithme SHA1 Hash et un incrément de temps de 30 secondes.
it: Il Google Authenticator supporta solo 6 cifre, l'algoritmo hash SHA1 e uno step temporale di 30 secondi.

source: enroll TOTP token
es: Inscribir el token TOTP
fr: Inscrivez le token TOTP
it: Iscrivi token TOTP

source: Enroll FIDO U2F Token
es: Implementar token FIDO U2F
fr: Déployer le token FIDO U2F
it: Srotolare il token FIDO U2F

source: Enroll token
es: Implementar token
fr: Déployer le token
it: Srotolare il token

source: Vasco Digipass Token Class - proprietary timebased tokens
es: Categoría de token Vasco Digipass - Token basados ​​en el tiempo de propiedad exclusiva
fr: Catégorie Token Vasco Digipass - Token propriétaires basés sur le temps
it: Classe Vasco Digipass token - token proprietari basati sul tempo

source: Enroll YubiKey
es: Implementar YubiKey
fr: Déployer YubiKey
it: Srotolare YubiKey

source: Yubico settings
es: Ajustes Yubico
fr: Paramètres Yubico
it: Impostazioni Yubico

source: You get your own API key from the yubico website
es: Puede obtener su propia clave de API en el sitio web de Yubico.
fr: Vous pouvez obtenir votre propre clé API sur le site Yubico.
it: È possibile ottenere la chiave API sul sito Yubico.

source: If you do not use your own API key, the LinOTP demo API key will be used!
es: Si no posee ninguna clave API propia, se utilizará una clave API LinOTP DEMO.
fr: Si vous n'entrez pas de propre clé API, la clé LinOTP DEMO API sera utilisée !
it: Se non si immette alcuna chiave API proprietaria, verrà utilizzata una chiave LinOTP DEMO API!

source: You need to enter a valid API id
es: Debe introducir un ID de API válido.
fr: Vous devez entrer une API ID valide.
it: È necessario immettere un ID API valido.

source: You need to enter a valid API key
es: Debe introducir una clave API válida.
fr: Vous devez entrer une clé API valide.
it: È necessario immettere una chiave API valida.

source: Yubico API key
es: Clave API de Yubico
fr: Clé Yubico API

source: Here you need to enter the token ID of the YubiKey.
es: Aquí debe introducir el ID del token de YubiKey.
fr: Ici, vous devez entrer le token ID de YubiKey.
it: Qui è necessario inserire l'ID token della YubiKey.

source: You can do this by inserting the YubiKey and simply push the button.
es: Para ello, simplemente conecte su YubiKey y pulse el botón.
fr: Vous pouvez le faire simplement en branchant votre YubiKey et en appuyant sur le bouton.
it: È sufficiente collegare la YubiKey e premere il pulsante.

source: You need to enter the YubiKey token ID
es: Tendrá que introducir el ID del token de YubiKey.
fr: Vous devez entrer le YubiKey Token ID.
it: È necessario immettere l'ID del token YubiKey.

source: Token ID
es: ID del token
it: ID Token

source: Enroll your YubiKey
es: Implemente su YubiKey
fr: Déployez votre YubiKey
it: Srotola la YubiKey

source: Enter the Token ID of your YubiKey. Simply insert the YubiKey and press the button.
es: Indique el ID del token de su YubiKey. Solo tiene que conectar su Yubikey y pulsar el botón.
fr: Entrez le Token ID de votre YubiKey. Il suffit de brancher votre Yubikey et d'appuyer sur le bouton.
it: Inserisci il token ID della tua YubiKey. È sufficiente collegare la Yubikey e premere il pulsante.

source: enroll yubico token
es: Implementar Yubikey
fr: Déployer YubiKey
it: Srotolare YubiKey

source: %d tokens of %d migrated
es: %d Token migrado desde %d
fr: %d Token migré de %d
it: %d Token migrato da %d

source: Default provider could not be deleted!
es: ¡El proveedor predeterminado no se puede eliminar!
fr: L'opérateur par défaut ne peut pas être supprimé !
it: Il provider predefinito non può essere cancellato!

source: Unable to delete - provider used in policies! [%s]
es: ¡No se puede eliminar - proveedor utilizado en las políticas! [%s]
fr: Impossible de supprimer - opérateur utilisé dans les directives ! [%s]
it: Impossibile cancellare - il provider è usate nelle polizze! [%s]

source: Unknown provider! %r
es: ¡Proveedor desconocido! %r
fr: Opérateur inconnu ! %r
it: Provider sconosciuto! %r

source: Not a valid json string!
es: ¡No hay ningún texto JSON válido!
fr: Aucun texte JSON valide !
it: Nessun testo JSON valido!

source: Please enter a valid realm name. It may contain characters, numbers and '_-.'.
es: Por favor, introduzca un nombre de dominio válido. Este solo puede contener letras, números y '_-.'.
fr: Veuillez entrer un nom de domaine valide. Il ne peut être constitué que de lettres, de chiffres et de « _-. ».
it: Inserisci un nome Realm valido. Questo può essere costituito solo da lettere, numeri e '_-.'.

source: Please enter a valid resolver name. It may contain characters, numbers and '_-'.
es: Por favor, introduzca un nombre de solucionador válido. Este solo puede contener letras, números y '_-.'.
fr: Veuillez entrer un nom de résolveur valide. Il ne peut être constitué que de lettres, de chiffres et de « _-. ».
it: Inserisci un nome Resolver valido. Questo può essere costituito da lettere, numeri e '_-.'.

source: Please enter a valid provider name. It may contain characters, numbers and '_-'.
es: Por favor, introduzca un nombre de proveedor válido. Este solo puede contener letras, números y '_-'.
fr: Veuillez entrer un nom valide d'opérateur. Il ne peut être constitué que de lettres, de chiffres et de « _-. ».
it: Inserisci un nome provider valido. Questo può essere costituito da lettere, numeri e '_-.'.

source: Please enter a valid ldap uri. It needs to start with ldap:// or ldaps://
es: Por favor, introduzca una URL LDAP válida que empiece por ldap:// o ldaps://.
fr: Veuillez entrer une LDAP URI valide, qui commence par ldap:// ou ldaps://.
it: Inserisci un LDAP URI valido che inizia con Idap:// o Idaps://.

source: Please enter a valid http uri. It needs to start with http:// or https://
es: Por favor, introduzca una URL LDAP válida que empiece por http:// o https://.
fr: Veuillez entrer une LDAP URI valide, qui commence par http:// ou https://.
it: Inserisci un LDAP URI valido che inizia con http:// o https://.

source: Please enter a timeout like: 5.0; 5.0
es: Por favor, introduzca un tiempo de espera del tipo: 5.0; 5.0
fr: Veuillez entrer un délai d'attente comme : 5.0 ; 5.0
it: Per favore inserisci un timeout come: 5.0; 5.0

source: Please enter a valid searchfilter like this: (sAMAccountName=*)(objectClass=user)
es: Por favor, introduzca un filtro de búsqueda LDAP válido como: (sAMAccountName=*)(objectClass=user)
fr: Veuillez entrer un filtre de recherche LDAP valide, tel que (sAMAccountName=*)(objectClass=user)
it: Inserisci un filtro di ricerca LDAP valido, come: (sAMAccountName=*)(objectClass=user)

source: Please enter a valid user searchfilter like this: (&(sAMAccountName=%s)(objectClass=user))
es: Por favor, introduzca un filtro de búsqueda de usuario LDAP válido como: (&(sAMAccountName=%s)(objectClass=user))
fr: Veuillez entrer un filtre de recherche utilisateur LDAP valide, tel que : (&(sAMAccountName=%s)(objectClass=user))
it: Inserisci un filtro di ricerca utente LDAP valido, come: (&(sAMAccountName=%s)(objectClass=user))

source: Please enter a valid searchfilter like this: { "username": "sAMAccountName", "phone" : "telephoneNumber", "mobile" : "mobile", "email" : "mail", "surname" : "sn", "givenname" : "givenName" }
es: Por favor, indique un filtro de búsqueda LDAP válido como: { "username": "sAMAccountName", "phone" : "telephoneNumber", "mobile" : "mobile", "email" : "mail", "surname" : "sn", "givenname" : "givenName" }
fr: Veuillez entrer un filtre de recherche LDAP valide, tel que : { "username": "sAMAccountName", "phone" : "telephoneNumber", "mobile" : "mobile", "email" : "mail", "surname" : "sn", "givenname" : "givenName" }
it: Inserisci un filtro di ricerca LDAP valido, come: {"username": "sAMAccountName", "phone" : "telephoneNumber", "mobile" : "mobile", "e-mail": "mail", "surname": "sn", "givenname": "givenName"}

source: Please enter the UID of your LDAP server like DN, entryUUID, objectGUID or GUID
es: Por favor, introduzca el UID (identificador de Uniq) del servidor LDAP como, p. ej., DN, entryUUID, objectGUID o GUID
fr: Veuillez entrer l'UID (Uniq Identifier) ​​du serveur LDAP, par exemple, DN, entryUUID, objectGUID ou GUID
it: Inserisci l'identificativo UID (Uniq Identifier) ​​del server LDAP ad esempio DN, entryUUID, objectGUID o GUID

source: Please enter a valid driver specification like: mysql, postgres, mssql, oracle, ibm_db_sa or ibm_db_sa+pyodbc
es: Por favor, introduzca un controlador válido como: mysql, postgres, mssql, oracle, ibm_db_sa o ibm_db_sa+pyodbc
fr: Veuillez entrer un pilote valide : mysql, postgres, mssql, oracle, ibm_db_sa ou ibm_db_sa+pyodbc
it: Inserisci un driver valido come: mysql, postgres, mssql, oracle, ibm_db_sa o ibm_db_sa+pyodbc

source: Please enter a valid searchfilter like this: { "username": "usercolumn", "password":"pw", "salt": "salt", "phone" : "telephoneNumber", "mobile" : "mobile", "email" : "mail", "surname" : "sn", "givenname" : "givenName" }
es: Por favor, introduzca un filtro de búsqueda válido como, p. ej.,: { "username": "usercolumn", "password":"pw", "salt": "salt", "phone" : "telephoneNumber", "mobile" : "mobile", "email" : "mail", "surname" : "sn", "givenname" : "givenName" }
fr: Veuillez entrer un filtre de recherche valide, tel que : { "username": "usercolumn", "password":"pw", "salt": "salt", "phone" : "telephoneNumber", "mobile" : "mobile", "email" : "mail", "surname" : "sn", "givenname" : "givenName" }
it: Inserisci un filtro di ricerca valido come ad esempio: { "username": "usercolumn", "password":"pw", "salt": "salt", "phone" : "telephoneNumber", "mobile" : "mobile", "email" : "mail", "surname" : "sn", "givenname" : "givenName" }

source: Issuer
es: Expositores
fr: Émetteur
it: Fornitore

source: Number of tokens
es: Número de token
fr: Nombre de token
it: Numero token

source: Licensee
es: Concesionario
fr: Licencié
it: Licenziatario

source: Address
es: Dirección
fr: Adresse
it: Indirizzo

source: Contact name
es: Contacto
fr: Contact
it: Contatto

source: Contact EMail
es: Correo electrónico de contacto
fr: e-mail du contact
it: Contatto e-mail

source: Contact phone
es: Teléfono de contacto
fr: Numéro de téléphone
it: Contatto telefonico

source: Date
es: Fecha
it: Data

source: Expiration
es: Fecha de caducidad
fr: Date d'expiration
it: Data di scadenza

source: Subscription
es: Suscripción
fr: Abonnement
it: Abbonamento

source: Version
es: Versión
it: Versione

source: User selection:
es: Selección del usuario:
fr: Sélection de l'utilisateur :
it: Selezione utente:

source: Selection of more than one user is not supported!
es: No se admite la selección de más de un usuario.
fr: La sélection de plus d'un utilisateur ne sera pas supportée !
it: La selezione di più di un utente non è supportata!

source: Please select only one user.
es: Por favor, seleccione un único usuario.
fr: Veuillez ne sélectionner qu'un seul utilisateur.
it: Selezionare solo un utente.

source: Found the token:
es: Token encontrado:
fr: Token trouvé :
it: Token trovato:

source: The token belongs to
es: El token pertenece a
fr: Le token appartient à
it: Il token appartiene a

source: The upload of your support and subscription license failed:
es: Error al cargar el archivo de soporte y suscripción:
fr: Échec du chargement du fichier de support et d'abonnement :
it: Il caricamento del file di supporto e abbonamento è fallito:

source: License upload
es: Cargar licencia
fr: Télécharger la licence
it: Caricare la licenza

source: License uploaded
es: Licencia cargada
fr: Licence téléchargée
it: Licenza caricata

source: Invalid License
es: licencia no válida
fr: Licence non valide
it: licenza non valida

source: Professional LinOTP support and enterprise subscription
es: Soporte y suscripción LinOTP profesional para empresas
fr: Support LinOTP professionnel et abonnement pour les entreprises
it: Supporto e abbonamento LinOTP professionale per le aziende

source: Your LinOTP support subscription
es: Su soporte y suscripción LinOTP
fr: Votre support et abonnement LinOTP
it: Il supporto e abbonamento LinOTP

source: For support and subscription please contact us at
es: Si tiene preguntas sobre el soporte y la suscripción, póngase en contacto con nosotros
fr: En cas de question concernant le support et l'abonnement, vous pouvez nous contacter
it: Per domande sul supporto e sull'abbonamento potete contattarci

source: by phone
es: por teléfono
fr: par téléphone
it: per telefono

source: or email
es: o por correo electrónico
fr: ou par e-mail
it: o via e-mail

source: Get Temporary Token
es: Generar token temporal
fr: Générer un token temporaire
it: Generare token temporanei

source: Cancel
es: Cancelar
fr: Annuler
it: Annulla

source: Set Token Realm
es: Establecer dominio de token
fr: Définir le domaine du token
it: Impostare Tokenrealm

source: Please select the token first.
es: Por favor, seleccione en primer lugar un token.
fr: Veuillez d'abord sélectionner un token.
it: Seleziona inizialmente un token.

source: Cannot save realm
es: No se puede guardar el dominio
fr: Ne peut pas enregistrer le domaine
it: Impossibile salvare realm

source: Please select at least one UserIdResolver from the list
es: Por favor, seleccione al menos un UserIdResolver de la lista.
fr: Veuillez sélectionner au moins un utilisateur ! Résolveur de la liste.
it: per favore seleziona almeno un UserIdResolver dalla lista

source: No resolver selected
es: No se ha seleccionado solucionador
fr: Aucun résolveur sélectionné
it: Nessun resolver selezionato

source: Please select at least one resolver from the resolver list.
es: Por favor, seleccione al menos un solucionador de la lista.
fr: Veuillez sélectionner au moins un résolveur dans la liste des résolveurs.
it: Per favora seleziona almeno un resolver dalla lista dei resolver

source: Close
es: Cerrar
fr: Fermer
it: Chiudi

source: LDAP Server, especially Active Directory, implement a default serverside maximum size limit of 1000 objects.
es: Los servidores LDAP, en particular el directorio activo, tienen una limitación de respuesta estándar de 1000 objetos devueltos (límite de tamaño) en la página del servidor.
fr: Le serveur LDAP, notamment Active Directory, ont du côté du serveur, une restriction standard dans sa réponse de 1000 objets retournés (limite de taille).
it: Server LDAP, in particolare Active Directory, hanno sul lato server una restrizione standard nella risposta di 1.000 oggetti restituiti (sizelimit).

source: This is independed of the local sizelimit and does not hinder the functionality of LinOTP.
es: Estas restricciones son independientes de la restricción indicada localmente y no afectan a la funcionalidad relacionada con LinOTP.
fr: Cette restriction est indépendante de la restriction entrée localement et n'a aucune incidence sur la fonctionnalité associée à LinOTP.
it: Questa restrizione è indipendente dalla restrizione indicata localmente e non influisce sulla funzionalità in relazione al LinOTP.

source: Number of users found: %d
es: Número de usuarios encontrados: %d
fr: Nombre d'utilisateurs trouvés : %d
it: Numero di utenti trovati: %d

source: Connection Test: successful
es: Prueba de conexión: éxito
fr: Test de connexion : succès
it: Test di connessione: superato

source: LDAP Connection Test
es: Prueba de conexión LDAP
fr: Test de connexion LDAP
it: Test di connessione LDAP

source: HTTP Connection Test
es: Prueba de conexión HTTP
fr: Test de connexion HTTP
it: Test di connessione HTTP

source: HTTP Test
es: Prueba HTTP
fr: Test HTTP
it: Test HTTP

source: Form Validation Error
es: Error de entrada en el formulario
fr: Formulaire erreurs de saisie
it: Errore immissione modulo

source: Token Config
es: Configuración de token
fr: Configuration token
it: Configurazione Token

source: Failed to save provider
es: Error al guardar el proveedor
fr: Impossible d'enregistrer le fournisseur
it: Salvataggio del provider fallito

source: Failed to save provider %s
es: Error al guardar el proveedor %s
fr: Impossible d'enregistrer le fournisseur%s
it: Salvataggio del provider %s fallito

source: Error saving provider
es: Error al guardar el proveedor
fr: Erreur lors de l'enregistrement du fournisseur
it: Errore nel salvataggio del provider

source: Provider %s deleted
es: Proveedor %s eliminado
fr: Fournisseur%s supprimé.
it: Provider %s eliminato

source: Unknown server error occured
es: Se ha producido un error desconocido del servidor
fr: Une erreur de serveur inconnue a eu lieu
it: È avvenuto un errore di server sconosciuto

source: Failed to delete provider
es: Error al eliminar el proveedor
fr: Echec de la suppression du fournisseur
it: Cancellazione del provider fallita

source: Failed to delete provider %s
es: No se ha podido eliminar el proveedor %s
fr: Echec lors de la suppression du fournisseur%s
it: Cancellazione del provider %s fallita

source: Error deleting provider
es: Error al eliminar el proveedor
fr: Erreur lors de la suppression du fournisseur
it: Errore durante la cancellazione del provider

source: Provider %s set as default
es: Proveedor %s configurado como predeterminado
fr: Fournisseur %s défini par défaut
it: Provider %s impostato di default

source: Failed to set default provider
es: Error al configurar el proveedor predeterminado
fr: Impossible de définir le fournisseur par défaut
it: Impostazione del provider di default fallita

source: Failed to set default provider %s
es: Error al configurar al proveedor predeterminado %s
fr: Impossible de définir le fournisseur par défaut% s
it: Impostazione del provider %s di default fallita

source: Error setting default provider
es: Error al configurar el proveedor predeterminado
fr: Erreur lors de l'initialisation du fournisseur par défaut
it: Errore durante l'impostazione del provider di default

source: A resolver with name
es: Ya existe un solucionador
fr: Nom du résolveur
it: Un resolver con nome

source: already exists.
es: llamado
fr: existe déjà.
it: è già esistente.

source: Do you want to overwrite the existing definition?
es: ¿Desea sobreescribir la definición existente?
fr: Voulez-vous remplacer la définition existante ?
it: Vuoi riscrivere la definizione esistente?

source: Overwrite resolver definition
es: Sobreescribir la definición del solucionador
fr: Redéfinir la définition du résolveur
it: Riscrivi la definizione di resolver

source: Overwrite
es: Sobreescribir
fr: Remplacer
it: Riscrivi

source: The %s dialog contains unsaved changes.
es: El diálogo %s contiene cambios sin guardar.
fr: Le dialogue %s contient des modifications non enregistrées.
it: Il dialogo %s contiene modifiche non salvate.

source: Do you really want to close the dialog and discard the changes?
es: ¿Está seguro de que desea cerrar el diálogo y descartar los cambios?
fr: Voulez-vous vraiment fermer la boîte de dialogue et annuler les modifications ?
it: Vuoi veramente chiudere il dialogo ed eliminare le modifiche?

source: Close Dialog
es: Cerrar el diálogo
fr: Fermer le dialogue
it: Chiudi dialogo

source: Discard
es: Descartar
fr: Renoncer
it: Elimina

source: Active
es: Activo
fr: Actif
it: Attivo

source: Name
es: Nombre
it: Nome

source: User
es: Usuario
fr: Utilisateur
it: Utente

source: Scope
es: Área
fr: Domaine
it: Area

source: Action
es: Acción
it: Azione

source: Realm
es: Dominio
fr: Domaine

source: Client
es: Cliente

source: Time
es: Hora
fr: Heure
it: Tempo

source: Serial Number
es: Número de serie
fr: Numéro de série
it: Numero di serie

source: Username
es: Nombre de usuario
fr: Nom d'utilisateur
it: Nome utente

source: Type
es: Tipo
it: Tipo

source: Login Attempts Failed
es: Intento fallido de inicio de sesión
fr: Échecs de la connexion
it: Tentativi falliti di login

source: Max Login Attempts
es: Número máximo de intentos fallidos de inicio de sesión
fr: Échecs de connexion max
it: Max. tentativi falliti di login

source: OTP Length
es: Longitud OTP
fr: Longueur OTP
it: Lunghezza OTP

source: Count Window
es: Ventana del contador
fr: Fenêtre du compteur
it: Finestra contatore

source: Sync Window
es: Ventana de resincronización
fr: Fenêtre de resynchronisation
it: Finestra risincronizzazione

source: User ID
es: ID de usuario
fr: ID utilisateur
it: ID Utente

source: Resolver
es: Solucionador
fr: Résolveur

source: Login Name
es: Nombre de inicio de sesión
fr: Nom de connexion
it: Nome Login

source: All other columns
es: Todas las demás columnas
fr: Toutes les autres colonnes
it: Tutte le altre colonne

source: Surname
es: Apellidos
fr: Nom
it: Cognome

source: Given Name
es: Nombre
fr: Prénom
it: Nome

source: Email
es: Correo electrónico

source: Mobile
es: Móvil
fr: Téléphone mobile
it: Cellulare

source: Phone
es: Teléfono
fr: Téléphone
it: Telefono

source: Number
es: Número
fr: Numéro
it: Numero

source: Signature
es: Firma
it: Firma

source: Missing Lines
es: Líneas que faltan
fr: Lignes manquantes
it: Righe mancanti

source: Success
es: Hecho
fr: Réussi
it: Completato con successo

source: Serial
es: Número de serie
fr: Numéro de série
it: Numero di serie

source: Token Type
es: Tipo de token
fr: Type de token
it: Tipo di token

source: Administrator
es: Administrador
fr: Administrateur
it: Amministratore

source: Action Detail
es: Detalles de la acción
fr: Détails de l'action
it: Dettagli azione

source: Info
es: Información

source: LinOTP Server
es: Servidor LinOTP
fr: Serveur LinOTP

source: Log Level
es: Nivel de registro
fr: Niveau de journalisation
it: Livello di log

source: Clearance Level
es: Nivel de confianza
fr: Niveau de confiance
it: Livello di confidenza

source: Successful
es: Hecho
fr: Réussi
it: Completato con successo

source: Extended Search
es: Búsqueda avanzada
fr: Recherche avancée
it: Ricerca Avanzata

source: there is no linotp_selfservice cookie
es: Ninguna cookie linotp_selfservice instalada
fr: Aucun cookie linotp_selfservice défini
it: Non è stato impostato alcun cookie linotp_selfservice

source: Your session has expired!
es: ¡Su sesión ha expirado!
fr: Votre session a expiré !
it: La sessione è scaduta!

source: You need to select a Token and enter two OTP values.
es: Seleccione un token e indique dos valores OTP.
fr: Sélectionnez un token et entrez deux valeurs OTP.
it: Seleziona un token e assegna due valori OTP.

source: Token resynced successfully
es: El token se ha sincronizado correctamente
fr: Le token a été synchronisé avec succès
it: Il token è stato sincronizzato con successo

source: Failed to resync Token
es: Error durante la sincronización del token
fr: Erreur lors de la synchronisation du token
it: Errore durante la sincronizzazione del token

source: Error resyncing Token:
es: Error durante la sincronización del token:
fr: Erreur lors de la synchronisation du token :
it: Errore durante la sincronizzazione del token:

source: You need to enter a serial number
es: Introduzca un número de serie
fr: Entrez un numéro de série
it: Inserisci un numero di serie

source: You are going to assign a new token to you. Is this the correct serial:
es: Se está asignando un token nuevo. ¿Es este el número de serie correcto?
fr: Vous vous attribuez un nouveau token. Est-ce le bon numéro de série ?
it: Assegna un nuovo token. Il numero di serie è corretto?

source: Token assigned successfully
es: El token se ha asignado correctamente
fr: Le token a été attribué avec succès
it: Il token è stato assegnato con successo
