Repository: pypi-data/pypi-mirror-18
Catalog: packages/LinOTP/LinOTP-2.9.0.5.tar.gz/LinOTP-2.9.0.5/linotp/i18n/*/LC_MESSAGES/linotp.po
Languages: es, fr, it

source: You do not have the administrative right to set MOTP PIN/ SC UserPIN for token %s. Check the policies.
es: No tiene derechos de administrador para aplicar PIN MOTP/SC UserPIN para el token %s. Si es necesario, compruebe las directrices.
fr: Vous ne disposez pas de droits d'administration pour définir le code UserPIN MOTP PIN / S pour le token %s - Si nécessaire, vérifiez les directives.
it: Non disponi dei diritti amministrativi per impostare il PIN MOTP / SC UserPIN per il token %s - Controlla eventualmente i criteri.

source: You do not have the administrative right to set Smartcard PIN for token %s. Check the policies.
es: No tiene derechos de administrador para configurar el PIN de la tarjeta inteligente para el token %s. Si es necesario, compruebe las directrices.
fr: Vous ne disposez pas de droits d'administration pour définir le code PIN Smardcard pour le token %s - Si nécessaire, vérifiez les directives.
it: Non disponi dei diritti amministrativi per impostare i PIN smart card per il token %s - Controlla eventualmente i criteri.

source: You do not have the administrative right to set OTP PIN for token %s. Check the policies.
es: No tiene derechos de administrador para aplicar PIN OTP para el token %s. Si es necesario, compruebe las directrices.
fr: Vous ne disposez pas de droits d'administration pour définir le code PIN OTP pour le token %s - Si nécessaire, vérifiez les directives.
it: Non disponi dei diritti amministrativi per impostare il PIN OTP per il token %s - Controlla eventualmente i criteri.

source: You do not have the administrative right to set token properties for %s. Check the policies.
es: No tiene derechos de administrador para configurar las propiedades del token para el token %s. Si es necesario, compruebe las directrices.
fr: Vous ne disposez pas de droits d'administration pour définir les caractéristiques du token %s - Si nécessaire, vérifiez les directives.
it: Non disponi dei diritti amministrativi per impostare le caratteristiche token per il token %s - Controlla eventualmente i criteri.

source: You do not have the administrative right to resync token %s. Check the policies.
es: No tiene derechos de administrador para sincronizar el token %s. Si es necesario, compruebe las directrices.
fr: Vous ne disposez pas de droits d'administration pour synchroniser le token %s - Si nécessaire, vérifiez les directives.
it: Non disponi dei diritti amministrativi per sincronizzare il token %s - Controlla eventualmente i criteri.

source: You do not have the administrative right to list users in realm %s(%s).
es: No tiene derechos de administrador para visualizar el usuario en el dominio %s(%s).
fr: Vous ne disposez pas de droits d'administration afin d'afficher l'utilisateur dans le domaine %s(%s).
it: Non disponi dei diritti amministrativi per visualizzare l'utente nel Realm %s(%s).

source: You do not have the administrative right to get the token owner in realm %s(%s).
es: No tiene derechos de administrador para visualizar el propietario del token en el dominio %s(%s).
fr: Vous ne disposez pas de droits d'administration pour afficher le propriétaire du token dans le domaine %s(%s).
it: Non disponi dei diritti amministrativi per visualizzare il possessore di token nel Realm %s(%s).

source: You do not have the administrative right to show status of token challenges in realm %s(%s).
es: No tiene derechos de administrador para visualizar el estado de los desafíos del token en el dominio %s(%s).
fr: Vous ne disposez pas de droits d'administration pour afficher l'état des défis de token dans le domaine %s(%s).
it: Non disponi dei diritti amministrativi per visualizzare lo stato delle Token Challenge nel Realm %s(%s).

source: You do not have the administrative right to remove tokens from realm %s. Check the policies.
es: No tiene derechos de administrador para eliminar token en el dominio %s. Si es necesario, compruebe las directrices.
fr: Vous ne disposez pas de droits d'administration pour supprimer les token dans le domaine %s - Si nécessaire, vérifiez les directives.
it: Non disponi dei diritti amministrativi per eliminare i token nel Realm %s - Controlla eventualmente i criteri.

source: You do not have the administrative right to add tokens to realm %s. Check the policies.
es: No tiene derechos de administrador para añadir token al dominio %s. Si es necesario, compruebe las directrices.
fr: Vous ne disposez pas de droits d'administration pour ajouter des token dans le domaine %s - Si nécessaire, vérifiez les directives.
it: Non disponi dei diritti amministrativi per aggiungere token nel Realm %s - Controlla eventualmente i criteri.

source: You may not put any more tokens in realm %s. Check the policy 'tokencount'
es: No es posible añadir más token al dominio %s. Si es necesario, compruebe la directriz 'tokencount'.
fr: Aucun autre token ne peut être ajouté dans le domaine %s - Si nécessaire, vérifiez les directives 'tokencount'.
it: Non si possono aggiungere altri token nel Realm %s - Controlla eventualmente il criterio 'tokencount'.

source: You do not have the administrative right to reset token %s. Check the policies.
es: No tiene derechos de administrador para restablecer el token %s. Si es necesario, compruebe las directrices.
fr: Vous ne disposez pas de droits d'administration pour réinitialiser le token %s - Si nécessaire, vérifiez les directives.
it: Non disponi dei diritti amministrativi per resettare il token %s - Controlla eventualmente i criteri.

source: You do not have the administrative right to import tokens. Check the policies.
es: No tiene derechos de administrador para importar token. Si es necesario, compruebe las directrices.
fr: Il manque les droits d'administration pour l'import de token - Si nécessaire, vérifiez les directives.
it: Mancano i diritti amministrativi per l'importazione di token - Controlla eventualmente i criteri.

source: You do not have the administrative right to import token files to realm %s. Check the policies.
es: No tiene derechos de administrador para importar token para el dominio %s. Si es necesario, compruebe las directrices..
fr: Il manque les droits d'administration pour importer des token pour le domaine %s - Si nécessaire, vérifiez les directives.
it: Mancano i diritti amministrativi per importare i token per il Realm %s - Controlla eventualmente i criteri.

source: The maximum number of allowed tokens in realm %s is exceeded. Check policy tokencount!
es: Se ha alcanzado el número máximo de token para el dominio %s. Si es necesario, consulte la directriz 'tokencount'.
fr: Le nombre maximum de token pour le domaine %s a été atteint - Si nécessaire, vérifiez les directives 'tokencount' !
it: Il numero massimo di token per il Realm %s è stato raggiunto - controlla eventualmente il criterio 'tokencount'!

source: Failed to run checkPolicyPre. Unknown method: %s
es: Error durante la comprobación de la directriz, método desconocido: %s
fr: Erreur lors de la vérification de la directive - méthode inconnue : %s
it: Errore durante la verifica del criterio - metodo sconosciuto: %s

source: You do not have the administrative right to do this. You are missing a policy scope=%s, action=%s
es: No tiene derechos de administración para hacer esto. Para ello, falta una directriz ámbito=%s, acción=%s
fr: Vous ne disposez pas des droits d'administration pour exécuter cette tâche.ll vous manque un champ d'application de la politique=%s" et "action=%s".
it: Non sei in possesso dei diritti amministrativi per procedere. Ti manca un criterio=%s, azione=%s.

source: There is no policy gettoken/max_count definable for the tokentype %r
es: No hay ninguna directriz 'gettoken/maxcount' para el tipo de token %r
fr: Il n'y a pas de directive 'gettoken/maxcount' pour le type de token %r
it: Non esiste alcun criterio 'gettoken/maxcount' per il tipo di token% r

source: You do not have the administrative right to view the audit trail. You are missing a policy scope=audit, action=view
es: No tiene derechos de administrador para ver el registro de auditoría. Para ello, falta una directriz con 'scope=monitoring' y 'action=view'.
fr: Vous ne disposez pas de droits d'administration afin d'afficher le journal d'audit. À cet effet, il manque une directive 'scope=audit' et 'action=view'.
it: Non disponi dei diritti amministrativi per visionare l'Audit Log. Manca a tale scopo un criterio con 'scope=audit' e 'action=view'.

source: You do not have the administrative right to manage tools. You are missing a policy scope=tools, action=%s
es: No tiene derechos de administración para ejecutar las herramientas. Para ello, falta una directriz con 'scope=tools' y 'action=%s'.
fr: Vous n'avez pas les droits d'administration pour exécuter les outils. Pour cela, il manque une directive avec "scope=tools" et "action=%s".
it: Non sei in possesso dei diritti amministrativi per eseguire i Tool. Manca un criterio con "scope=tools' e 'action=%s'.

source: There is no policy selfservice/max_count definable for the token type %s.
es: No hay ninguna directriz que defina el max_count en el autoservicio para el tipo de token %s.
fr: Il n'y a pas de directive qui définit le max_count dans le Self-service pour le type de token %s .
it: Non esiste alcun criterio che definisca il max_count nel selfservice per il tipo di token %s .

source: There is no policy selfservice/max_count defined for the tokentype %s in realm %s.
es: No hay ninguna directriz que defina el max_count en el autoservicio para el tipo de token %s en el dominio %s.
fr: Il n'y a pas de directive qui définit le max_count dans le selfservice pour le type de token %s dans le domaine %s .
it: Non esiste alcun criterio che definisca nel selfservice il max_count per il tipo di token %s nel Realm %s .

source: The policy settings do not allow you to issue this request!
es: ¡La configuración de la directriz impide realizar esta consulta!
fr: Les paramètres de directive empêchent cette requête !
it: Le impostazioni dei criteri impediscono questa query!

source: The maximum number of allowed tokens is exceeded. Check the policies
es: Se ha superado el número máximo de token respaldados. Si es necesario, compruebe las directrices.
fr: Le nombre maximum de token pris en charge a été dépassé - vérifier si nécessaire les directives.
it: Il numero massimo di token supportati è stato superato - Controllare eventualmente i criteri.

source: The policy settings do not allow you to request a serial by OTP!
es: Las directrices no permiten comprobar el número de serie de OTP.
fr: Les directives ne permettent pas de vérifier le numéro de série sur OTP !
it: I criteri non consentono di chiedere il numero di serie tramite OTP!

source: Unknown method in selfservice: %s
es: Método desconocido en el portal de autogestión: %s
fr: Méthode inconnue dans le portail d'auto-gestion : %s
it: Metodo sconosciuto nel portale di autogestione: %s

source: Policy check failed. You are not allowed to %s system config.
es: La directriz no permite la solicitud; no es posible visualizar o cambiar la configuración del sistema (%s).
fr: Requête non autorisée par la directive - il est impossible d'afficher ou de modifier la configuration du système (%s).
it: Richiesta non consentita per criterio - non è possibile visualizzare o variare la configurazione del sistema (%s).

source: You do not have the administrative right to do an ocra/%s
es: No tiene derechos de administrador para la solicitud de Ocra: ocra/%s.
fr: Vous ne disposez pas de droits d'administration pour la requête Ocra : ocra/%s.
it: Non disponi dei diritti amministrativi per la richiesta Ocra: ocra/%s.

source: Failed to run getPolicyPre. Unknown controller: %s
es: Error durante la comprobación de la directriz, controlador desconocido: %s
fr: Erreur lors de la vérification de la directive - contrôleur inconnu %s
it: Errore durante la verifica dei criteri - controller sconosciuto %s

source: You do not have the administrative right to get serials from this realm!
es: No tiene derechos de administrador para solicitar los números de serie de este dominio.
fr: Vous ne disposez pas de droits d'administration pour demander les numéros de série de ce domaine !
it: Non disponi dei diritti amministrativi per richiedere i numeri di serie di questo Realm!.

source: Failed to run getPolicyPost. Unknown method: %s
es: Error durante la comprobación de la directriz, método desconocido %s
fr: Erreur lors de la vérification de la directive - méthode inconnue %s
it: Errore durante la verifica dei criteri - metodo sconosciuto %s

source: You do not have system config read rights and not realm admin policies.
es: No tiene derechos para leer la configuración del sistema o las directrices de administración del dominio.
fr: Vous ne disposez pas des droits pour lire la configuration du système ou les directives d'administration du domaine.
it: Non disponi dei diritti per leggere la configurazione del sistema o i criteri dell'amministrazione Realm.

source: Failed to run getPolicyPost. Unknown controller: %s
es: Error durante la comprobación de la directriz, controlador desconocido: %s
fr: Erreur lors de la vérification de la directive - contrôleur inconnu %s
it: Errore durante la verifica dei criteri - controller sconosciuto %s

source: multiple tokens found - cannot determine tokentype!
es: Se han encontrado varios token. No es posible determinar el tipo de token.
fr: Plusieurs token trouvés - ne peut pas déterminer le type de token !
it: Trovati più token - impossibile determinare il tipo di token!

source: E-mail token
es: Token del correo electrónico
fr: Token e-mail

source: E-mail address
es: Dirección de correo electrónico
fr: Adresse e-mail
it: Indirizzo e-mail

source: Description
es: Descripción
it: Descrizione

source: Protect your token with a static PIN
es: Proteja sus token por medio de un PIN fijo:
fr: Protégez vos tokens avec un code PIN fixe :
it: Proteggi i tuoi token tramite un PIN fisso:

source: Token PIN:
es: PIN del token:
fr: Code PIN du token :
it: PIN del token:

source: Enter PIN
es: Establecer PIN
fr: Définir le code PIN
it: Impostare il PIN

source: Confirm PIN
es: Confirmar PIN
fr: Confirmer le code PIN
it: Confermare il PIN

source: Enroll EMail Token
es: Implementar token de correo electrónico
fr: Déployer token e-mail
it: Srotolare token e-mail

source: Input data is not valid!
es: Los datos del formulario no son válidos.
fr: Les données du formulaire sont invalides.
it: I dati del modulo non sono validi.

source: Enroll your email token
es: Implemente el token de correo electrónico
fr: Déployez votre token e-mail
it: Srotola il token e-mail

source: Your email address
es: Dirección de correo electrónico
fr: Adresse e-mail
it: Indirizzo e-mail

source: enroll email token
es: Implementar token de correo electrónico
fr: Déployer token e-mail
it: Srotolare token e-mail

source: define if the user should be allowed to define the email address
es: describe si el usuario está autorizado para definir o cambiar la dirección de correo electrónico.
fr: indique si l'utilisateur est autorisé à définir ou à modifier l'adresse e-mail lui-même.
it: descrive se l'utente è autorizzato a definire o modificare in proprio l'indirizzo e-mail.

source: The text that will be send via email for an email token. Use <otp> and <serial> as parameters.
es: Texto del correo electrónico que se envía para un token de correo electrónico. Los parámetros son <opt> y <serial>.
fr: Texte de l'e-mail qui est envoyé via e-mail pour un token e-mail. Les paramètres sont <opt> et <serial>.
it: Testo e-mail che viene inviato tramite e-mail per un token e-mail. Parametri <opt> e <serial>.

source: The subject that will be send via email for an email token. Use <otp> and <serial> as parameters.
es: Texto del correo electrónico que se envía para un token de correo electrónico. Los parámetros son <opt> y <serial>.
fr: Texte de l'e-mail qui est envoyé via e-mail pour un token e-mail. Les paramètres sont <opt> et <serial>.
it: Testo e-mail che viene inviato tramite e-mail per un token e-mail. Parametri <opt> e <serial>.

source: User is not allowed to set email address
es: ¡El usuario no puede establecer la dirección de correo electrónico!
fr: L'utilisateur n'est pas autorisé à définir l'adresse e-mail !
it: L'utente non può impostare l'indirizzo e-mail!

source: Forwarding Token
es: Enviando el token
fr: Transmission de token
it: Token in arrivo

source: Here you can define to which token the authentication request should be forwarded.
es: Aquí puede definir a qué token debe remitirse la solicitud de autenticación.
fr: Ici, vous pouvez définir à quel token la demande d'authentification doit être transmise.
it: Qui puoi definire a quale token debba essere inviata la richiesta di autenticazione.

source: You can forward the OTP to a target serial number.
es: Puede remitir la OTP a un número de serie objetivo.
fr: Vous pouvez transférer le OTP à un numéro de série cible.
it: Puoi inviare l'OTP ad un numero seriale target.

source: forward serial
es: remitir serie
fr: transférer le numéro de série
it: Invia il seriale

source: Protect your token with a static pin
es: Proteja sus token con un PIN estático:
fr: Protégez vos tokens avec un code PIN fixe :
it: Proteggi il tuo token con un pin statico

source: Token Pin:
es: PIN del token:
fr: Code PIN du token :
it: Pin del token:

source: enter PIN
es: Establecer PIN
fr: Définir le code PIN
it: Impostare il PIN

source: confirm PIN
es: Confirmar PIN
fr: Confirmer le code PIN
it: Confermare il PIN

source: Specify if the target token fail counter should be incremented / resets or not
es: Especifique si el contador de fallos del token objetivo debe ser incrementado / restablecido o no
fr: Spécifiez si le compteur de défaillances du token cible doit être incrémenté/réinitialisé ou non
it: Specificare se il contatore di token fail di destinazione deve essere incrementato / reimposta o no

source: HMAC Token Settings
es: Ajustes de token HMAC
fr: Paramètres du token HMAC
it: Impostazioni del token HMAC

source: HMAC eventbased
es: HMAC basado en eventos
fr: HMAC basé sur les événements
it: HMAC in base agli eventi

source: Create a new OATH token - HMAC event based
es: Crear un token OATH nuevo - HMAC basado en eventos
fr: Générer un nouveau token OATH - HMAC basé sur un événement
it: Creare un nuovo token OATH - HMAC in base agli eventi

source: The token seed is the secret that is used in the hmac algorithm to make your token unique. So please take care!
es: La clave de token es el secreto que se utiliza en el algoritmo HMAC y hace que el token sea único. ¡Por favor, preste atención!
fr: La clé du token est le secret utilisé dans l'algorithme hmac et rend le token unique. Veuillez faire attention !
it: La chiave token è il segreto che viene utilizzato nell'algoritmo hmac e rende unico il token. Prestare attenzione!

source: Token seed:
es: Semilla del token:
it: Seme token:

source: generate random seed
es: Generar una semilla aleatoria
fr: Générer un seed aléatoire
it: generare un seme casuale

source: Enter seed
es: Introducir semilla
fr: Entrer seed
it: Immettere seme

source: The hmac algorithm could be controlled by the following settings. Make sure that these settings match your hardware token or software token capabilities.
es: El algoritmo HMAC puede verse afectado por los ajustes siguientes. Por favor, asegúrese de que estos valores son compatibles con el token de su hardware o con las capacidades del token de software.
fr: L'algorithme hmac peut être influencé par les paramètres suivants. Veuillez faire en sorte que ces paramètres correspondent à leur token matériel ou aux capacités de leur Softtoken.
it: L'algoritmo hmac può essere influenzato dalle seguenti impostazioni. Assicurarsi che queste impostazioni corrispondano ai token hardware o alle capacità dei softtoken.

source: Token settings:
es: Ajustes de token:
fr: Paramètres du token :
it: Impostazioni token:

source: The Google Authenticator supports only 6 digits and SHA1 hashing.
es: Google Authenticator solo es compatible con 6 dígitos y el algoritmo SHA1 Hash.
fr: Google Authenticator supporte seulement 6 chiffres et l'algorithme SHA1 Hash.
it: Il Google Authenticator supporta solo 6 cifre e l'algoritmo SHA1 Hash.

source: Google Authenticator compliant
es: Conforme con Google Authenticator.
fr: Conforme à Google Authenticator.
it: Google Authenticator conforme.

source: OTP Digits
es: Números OTP
fr: Chiffres OTP
it: Cifre OTP

source: Hash algorithm
es: Algoritmo Hash
fr: Algorithme Hash
it: Algoritmo Hash

source: Enroll HOTP Token
es: Implementar token HOTP
fr: Déployer le token HOTP
it: Srotolare il token HOTP

source: required input field
es: Campo de entrada obligatorio
fr: Champ d'entrée requis
it: Campo di immissione necessario

source: minimum length must be greater than {0}
es: La longitud debe ser mayor que {0} .
fr: La longueur doit être supérieure à {0} .
it: La lunghezza deve essere maggiore di {0} .

source: maximum length must be lower than {0}
es: La longitud debe ser inferior a {0}.
fr: La longueur doit être inférieure à {0} .
it: La lunghezza deve essere minore di {0} .

source: Please enter a valid init secret. It may only contain numbers and the letters A-F.
es: Por favor, introduzca una semilla de inicialización válida. Solo puede contener números y letras de la A a la F.
fr: Veuillez entrer un seed d'initialisation valide. Il ne doit contenir que des chiffres et les lettres de A à F.
it: Inserire un seme di inizializzazione valido. Deve contenere solo numeri e lettere da A a F.

source: Form data not valid.
es: Los datos del formulario no son válidos.
fr: Les données du formulaire sont invalides.
it: I dati del modulo non sono validi.

source: Enroll your HOTP token
es: Implemente su token HOTP
fr: Déployez votre token HOTP
it: Srotolare il token HOTP

source: Token Seed:
es: Clave de token:
fr: Clé du token :
it: Chiave Token:

source: Generate random seed
es: Generar semilla aleatoria
fr: Générer un seed aléatoire
it: Generare un seed casuale

source: Enter token seed
es: Introducir semilla de token
fr: Entrer le token seed
it: Inserire un seme token

source: Token Settings:
es: Ajustes de token:
fr: Paramètres du token :
it: Impostazioni token:

source: OTP digits
es: Números OTP
fr: Chiffres OTP
it: Cifre OTP

source: self enrolled
es: autogenerado
fr: créé vous-même
it: autogenerato

source: enroll hmac token
es: Implementar token HMAC
fr: Déployer le token HMAC
it: Srotolare token HMAC

source: Specify the hashlib to be used. Can be sha1 (1) or sha2-256 (2).
es: Introduzca el Hashlib que deba utilizarse. Este puede ser SHA1 (1) o SHA2-256 (2).
fr: Entrez le hashlib qui doit être utilisé. Cela peut être SHA1 (1) ou SHA2-256 (2).
it: Inserisci l'hashlib da utilizzare che può essere SHA1 (1) o SHA2-256 (2).

source: Specify the otplen to be used. Can be 6 or 8 digits.
es: Especifique la longitud de la OTP que debe utilizarse. Puede ser de 6 o 8 caracteres.
fr: Spécifiez la longueur OTP qui doit être utilisée. Cela peut être 6 ou 8 caractères.
it: Specifica la lunghezza OTP da utilizzare che può essere di 6 o 8 caratteri.

source: URL for OATH token
es: URL para token OATH
fr: URL pour le token OATH
it: URL per token OATH

source: mOTP Token Settings
es: Ajustes mOTP
fr: Paramètres mOTP
it: Impostazioni mOTP

source: mOTP - mobile otp
es: mOTP - OTP móvil
fr: mOTP - Mobiler OTP
it: mOTP - OTP mobile
