{"_default": {"1": {"tags": [], "id": "epoch_test.py", "models": [{"modelId": "test-model", "config": {"output_layers": [["dense_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"input_dtype": "float32", "name": "input_1", "batch_input_shape": [null, 4, 1]}}, {"class_name": "GRU", "name": "gru_1", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"dropout_W": 0.2, "inner_init": "orthogonal", "return_sequences": false, "U_regularizer": null, "stateful": false, "consume_less": "cpu", "input_length": null, "input_dim": 1, "activation": "tanh", "go_backwards": false, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 10, "dropout_U": 0.2, "inner_activation": "hard_sigmoid", "b_regularizer": null, "name": "gru_1", "trainable": true, "unroll": false}}, {"class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["gru_1", 0, 0]]], "config": {"bias": true, "input_dim": null, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "name": "dense_1", "activity_regularizer": null, "output_dim": 1, "b_constraint": null, "trainable": true, "b_regularizer": null}}], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "sessions": [{"params": {"iters": 10, "validation_split": 0.2, "batch_size": 10, "item_length": 4, "nb_epoch": 10}, "meta": {"platform": "Darwin-13.4.0-x86_64-i386-64bit", "commit": "9ea8912", "user": "quique", "branch": "master", "run_time": 186.26751017570496, "timestamp": "2016-09-15 20:35:17.427855"}, "result": {"epochs": [{"epoch_num": 0, "loss": "2.16905", "timestamp": "2016-09-15 20:38:17.243583"}, {"epoch_num": 1, "loss": "2.10051", "timestamp": "2016-09-15 20:38:17.329638"}, {"epoch_num": 2, "loss": "2.0528", "timestamp": "2016-09-15 20:38:17.416867"}, {"epoch_num": 3, "loss": "2.00708", "timestamp": "2016-09-15 20:38:17.514541"}, {"epoch_num": 4, "loss": "1.97444", "timestamp": "2016-09-15 20:38:17.613972"}, {"epoch_num": 5, "loss": "1.93945", "timestamp": "2016-09-15 20:38:17.715986"}, {"epoch_num": 6, "loss": "1.92608", "timestamp": "2016-09-15 20:38:17.826232"}, {"epoch_num": 7, "loss": "1.89481", "timestamp": "2016-09-15 20:38:17.924732"}, {"epoch_num": 8, "loss": "1.87452", "timestamp": "2016-09-15 20:38:18.004736"}, {"epoch_num": 9, "loss": "1.85644", "timestamp": "2016-09-15 20:38:18.088204"}, {"test_acc": "0.24918566644191742"}]}}]}], "created": "2016-09-15 20:35:17.070195"}}}