Repository: pypi-data/pypi-mirror-18
Catalog: packages/rer.al.mcorevideoportlet/rer.al.mcorevideoportlet-2.1.1.tar.gz/rer.al.mcorevideoportlet-2.1.1/rer/al/mcorevideoportlet/locales/*/LC_MESSAGES/rer.al.mcorevideoportlet.po
Languages: it

source: Portlet header
it: Titolo della portlet

source: Text
it: Testo

source: The text to render
it: Il testo da mostrare nella portlet

source: The video height
it: Altezza del video

source: The video url
it: Url del video mediacore da mostrare

source: The video width
it: Larghezza del video

source: Tick this box if you want to render a video with security check
it: Seleziona questa checkbox se il video proviene da un'installazione mediacore con controlli sulla sicurezza

source: Title of the rendered portlet
it: Indica il titolo della portlet che si va a mostrare

source: Video height
it: Altezza del video

source: Video url
it: Url del video

source: Video width
it: Larghezza video

source: Video with security
it: Video con accesso sicuro

source: description_add_mediacore_video_portlet
it: Aggiunta di una portlet che mostra un video mediacore

source: description_edit_mediacore_video_portlet
it: Modifica di una portlet che mostra un video mediacore

source: title_add_mediacore_video_portlet
it: Aggiungi portlet per video mediacore

source: title_edit_mediacore_video_portlet
it: Modifica portlet per video mediacore
