Repository: pypi-data/pypi-mirror-18
Catalog: packages/django-discounts-cart/django-discounts-cart-1.1.7.tar.gz/django-discounts-cart-1.1.7/discounts_cart/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Discounts
ru: Скидки

source: Percent discount
ru: Процент скидки

source: Example: 5 or 0,05
ru: Пример: 5 или 0,05

source: Start date
ru: Дата начала

source: End date
ru: Дата окончания

source: For unlimited, not necessary
ru: Для неограниченных, нет необходимости

source: Promo-codes
ru: Промо-коды

source: In this field, it will be generated promo-codes
ru: В это поле будут сгенерированы промо-коды

source: Use promo-codes ?
ru: Использовать промо-коды ?

source: Count promo-codes
ru: Количество промо-кодов

source: Only registered users ? - (Promo-codes)
ru: Только зарегистрированные пользователи ? - (промо-коды)

source: Not delete promo-codes ?
ru: Не удалять промо-коды ?

source: Unlimited ? - (Date)
ru: Безлимитные ? - (по дате)

source: Active discount
ru: Активная скидка

source: Discount
ru: Скидка

source: Not be zero
ru: Не может равняться нулю

source: Only positive numbers
ru: Только положительные числа

source: End date must not be blank
ru: Дата окончания не должна быть пустой

source: End date must be greater than the current date
ru: Дата окончания должна быть больше, чем текущая дата

source: Start date must be less than the end date
ru: Дата начала должна быть меньше, чем дата окончания

source: Maximum discount
ru: Максимальная скидка

source: Add more
ru: Добавить еще

source: Please enter a promo-code
ru: Пожалуйста, введите промо-код

source: Your promo-code is not valid
ru: Ваш промо-код не является действительным

source: Your promo-code is only for registered users
ru: Ваш промо-код только для зарегистрированных пользователей

source: Your promo-code does not belong to the selected products
ru: Ваш промо-код не принадлежит к выбранным продуктам
