Repository: pypi-data/pypi-mirror-18
Catalog: packages/diacamma-financial/diacamma_financial-2.1.4.16103017-py2.py3-none-any.whl/diacamma/accounting/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Diacamma accounting
fr: Comptabilité Diacamma

source: This fiscal year is not the last!
fr: Cet exercice n'est pas le dernier!

source: end of fiscal year must be after begin!
fr: la fin de l'exercice doit être postérieure à son début!

source: Some enties for last year report are not closed!
fr: Des écritures de report à nouveau ne sont pas validées!

source: Invalid code
fr: Code invalide!

source: Changment not allowed!
fr: Changement non permis!

source: entry of accounting for an asset
fr: écriture d'un avoir

source: Linked entries
fr: Ecritures associées

source: Add a entry line
fr: Ajouter une ligne d'écriture

source: third
fr: tiers

source: account
fr: compte

source: reference
fr: référence

source: debit
fr: débit

source: credit
fr: crédit

source: Last year report
fr: Report à nouveau

source: Buying
fr: Achats

source: Selling
fr: Ventes

source: Payment
fr: Règlement

source: Other
fr: Opérations diverses

source: default
fr: défaut

source: Enable
fr: Actif

source: Disable
fr: Inactif

source: 001@AccountThird information
fr: 001@Infomation comptable tiers

source: Disabled
fr: Désactiver

source: Enabled
fr: Activer

source: third has not correct account
fr: Ce tiers n'a pas de compte correct!

source: thirds
fr: tiers

source: This account is not nul!
fr: Ce compte n'est pas soldé!

source: accounts
fr: comptes

source: begin
fr: début

source: end
fr: fin

source: building
fr: en création

source: running
fr: en cours

source: finished
fr: terminé

source: last fiscal year
fr: exercice précédent

source: Fiscal year finished!
fr: Cet exercice est terminé!

source: {[b]}Revenue:{[/b]} %(revenue)s - {[b]}Expense:{[/b]} %(expense)s = {[b]}Result:{[/b]} %(result)s | {[b]}Cash:{[/b]} %(cash)s - {[b]}Closed:{[/b]} %(closed)s
fr: {[b]}Produit:{[/b]} %(revenue)s - {[b]}Charge:{[/b]} %(expense)s = {[b]}Résultat:{[/b]} %(result)s | {[b]}Trésorie:{[/b]} %(cash)s - {[b]}Validé:{[/b]} %(closed)s

source: This fiscal year has not a last fiscal year!
fr: Cet exercice n'a pas d'exercice précédent!

source: This fiscal year is not 'in building'!
fr: Cet exercice n'est pas 'en création'!

source: This fiscal year has entries not closed and not next fiscal year!
fr: Cet exercice a des écritures non-validées et pas d'exercice suivant!

source: No fiscal year define!
fr: Pas d'exercice défini!

source: No export for this accounting system!
fr: Pas d'export pour ce système comptable!

source: Fiscal year from %(begin)s to %(end)s [%(status)s]
fr: Exercice du %(begin)s au %(end)s [%(status)s]

source: This fiscal year is not 'in running'!
fr: Cet exercice n'est pas 'en cours'!

source: fiscal year
fr: exercice

source: fiscal years
fr: exercices

source: name
fr: nom

source: opened
fr: ouverte

source: closed
fr: clôturé

source: last cost accounting
fr: Précédent analytique

source: This cost accounting is closed!
fr: Cette comptabilité analytique est clôturée!

source: This cost accounting is protected by other modules!
fr: Cette comptabilité analytique est protégée par un autre module!

source: total revenue
fr: total des revenues

source: total expense
fr: total des dépenses

source: This cost accounting has some not validated entry!
fr: Cette comptabilité a des écritures non validées!

source: This cost accounting is include in a model of entry!
fr: Cette comptabilité est utilisée dans un modèle d'écriture!

source: cost accounting
fr: comptabilité analytique

source: costs accounting
fr: comptabilités analytiques

source: type of account
fr: type de compte

source: Asset
fr: Actif

source: Liability
fr: Passif

source: Equity
fr: Capitaux

source: Revenue
fr: Produit

source: Expense
fr: Charge

source: Contra-accounts
fr: Autres comptes

source: total of last year
fr: total de l'exercice précédent

source: total current
fr: total exercice

source: total validated
fr: total validé

source: Account already exists for this fiscal year!
fr: Ce compte existe déjà pour cet exercice fiscal!

source: charts of account
fr: plan comptable

source: charts of accounts
fr: plans comptables

source: journal reserved!
fr: journal réservé!

source: accounting journal
fr: journal

source: accounting journals
fr: journaux

source: This entries are not in same fiscal year!
fr: Ces écritures n'ont pas le même exercice!

source: letter
fr: Lettrage

source: letters
fr: Lettrages

source: numeros
fr: N°

source: link
fr: lettrage

source: date entry
fr: date d'écriture

source: date value
fr: date de pièce

source: close
fr: validé

source: amount
fr: montant

source: entry of account closed!
fr: écriture validée!

source: This kind of entry is not allowed for this journal!
fr: Ce type d'écriture n'est pas permis dans ce journal

source: payment of %s
fr: règlement de %s

source: entry of account
fr: écriture comptable

source: entries of account
fr: écritures comptables

source: entry
fr: écriture

source: entry line of account
fr: ligne d'écriture

source: entry lines of account
fr: lignes d'écriture

source: Model of entry
fr: Modèle d'écriture

source: Models of entry
fr: Modèles d'écriture

source: model
fr: modèle

source: Account code "%s" unknown for this fiscal year!
fr: Le code comptable "%s" est inconnu pour cet exercice!

source: Model line
fr: Ligne de modèle

source: Model lines
fr: Lignes de modèle

source: Budget line
fr: Ligne de budget

source: Budget lines
fr: Lignes de budget

source: accounting-devise
fr: Devise

source: accounting-devise-iso
fr: Devise (iso)

source: accounting-devise-prec
fr: Devise (précision)

source: accounting-system
fr: système comptable

source: accounting-sizecode
fr: Taille des codes comptables

source: Credit
fr: Crédit

source: Debit
fr: Débit

source: Financial
fr: Financier

source: Financial tools
fr: Outils financiers

source: Management of third account
fr: Gestion des tiers comptables

source: Thirds
fr: Tiers

source: Filtrer by contact
fr: Filtre par contact

source: Accounts displayed
fr: Comptes affichés

source: Hide the account total of thirds
fr: Cacher les totaux des comptes de tiers

source: Show the account total of thirds
fr: Voir les totaux des comptes de tiers

source: Filter any thirds unbalanced
fr: Filtrer les tiers non-soldés

source: Search
fr: Recherche

source: Search third
fr: Recherche de tiers

source: Disable third
fr: Désactiver des tiers

source: limit date
fr: date limite d'activation de tiers

source: Add third
fr: Ajout d'un tiers

source: Show third
fr: Voir un tiers

source: Delete third
fr: Supprimer un tiers

source: Listing third
fr: Liste de tiers

source: Add account
fr: Ajouter un compte

source: Modify account
fr: Modifier un compte

source: Delete account
fr: Supprimer un compte

source: Bookkeeping
fr: Comptabilité

source: models
fr: modèles

source: Accounting
fr: Comptabilité

source: Accounts filter
fr: Filtre sur les comptes

source: All entries of current fiscal year
fr: Toutes les ecritures de l'exercice courant

source: Only no-closed entries of current fiscal year
fr: Seulement les écritures non-validées de l'exercice courant

source: All entries for all fiscal year
fr: Toutes les écritures de tous les exercices

source: Manage of Bookkeeping
fr: Gestion comptable

source: Editing and modifying of Charts of accounts for current fiscal year
fr: Edition et modification du plan comptable de l'exercice courant

source: Using codes unknows in this account chart:
fr: Codes utilisés inconnus dans ce plan comptable:

source: Add an account
fr: Ajouter un compte

source: Modify an account
fr: Modifier un compte

source: Show an account
fr: Voir un compte

source: Delete an account
fr: Supprimer un compte

source: import
fr: importer

source: Import charts accounts from last fiscal year
fr: Importation du plan comptable de l'exercice précédent

source: Do you want to import last year charts accounts?
fr: Voulez-vous importer le plan comptable de l'exercice précédent?

source: Merge
fr: Fusion

source: initial
fr: initiaux

source: Add initial charts of account
fr: Ajout de comptes initiaux

source: Do you want to import initial accounts?
fr: Voulez-vous importer des comptes initiaux?

source: Listing charts of account
fr: Liste de plan comptable

source: Last fiscal year
fr: Report à nouveau

source: Last fiscal year import
fr: Importation du report à nouveau

source: Do you want to import last year result?
fr: Voulez-vous importer un report à nouveau de l'exercice précédent?

source: Begin
fr: Commencer

source: Begin fiscal year
fr: Commencer l'exercice

source: Closing
fr: Clôture

source: Close fiscal year
fr: Clôturer l'exercice

source: close-fiscal-year-confirme
fr: {[center]}{[b]}Voulez-vous cloturer cet exercice?{[/b]}{[/center]}{[br/]}{[u]}Attention:{[/u]}Ceci est une opération définitif, vérifiez bien d'avoir saisi:{[br/]} - L'ensemble de vos factures clients et fournisseurs sur l'exercice.{[br/]} - L'ensemble de vos réglements.{[br/]} - Le prorata de frais (assurance, téléphone, loyer,...) à cheval sur plusieurs exercices.{[br/]} - L'état de vos immobilisation.{[br/]} - Le calcul de vos ammortissements.{[br/]} - L'état de vos stocks.{[br/]}{[br/]}{[u]}L'outil va créer une éventuelle écriture de cloture.{[/u]}{[br/]}

source: warning, entry no validated
fr: {[br/]}{[u]}Attention:{[/u]}une écriture n'est pas validée{[br/]}elle sera déplacée sur l'exercice suivant

source: warning, %d entries no validated
fr: {[br/]}{[u]}Attention:{[/u]}%d écritures ne sont pas validées{[br/]}elles seront déplacées sur l'exercice suivant

source: Management of fiscal year and financial parameters
fr: Gestion des exercices et des paramètres financiers

source: Accounting configuration
fr: Configuration comptable

source: Fiscal year list
fr: Liste d'exercices

source: accounting system
fr: système comptable

source: Journals
fr: journaux

source: Parameters
fr: Paramètres

source: Do you confirm to select "%s" like accounting system?{[br/]}{[br/]}{[i]}{[u]}Warning{[/u]}: This choose is definitive.{[/i]}
fr: Voulez vous confirmer de sélectionner "%s" comme système comptable?{[br/]}{[br/]}{[i]}{[u]}Attention{[/u]}: Ce choix est définitif.{[/i]}

source: Activate
fr: Activé

source: Export fiscal year
fr: Export d'exercice

source: Add fiscal year
fr: Ajouter un exercice

source: Modify fiscal year
fr: Modifier un exercice

source: Account system not defined!
fr: Système comptable non défini!

source: Delete fiscal year
fr: Supprimer un exercice

source: Add accounting journal
fr: Ajouter un journal

source: Modify accounting journal
fr: Modifier un journal

source: Delete accounting journal
fr: Supprimer journal

source: Configuration of accounting parameters
fr: Configurez votre système comptable et la devise que vous utilisez.

source: Configuration of fiscal years
fr: Définissez vos exercices fiscaux et activez le courant.

source: Total of charts of accounts in current fiscal year: %d
fr: Total de codes comptables de l'exercice en cours:% d

source: Configuration of journals
fr: Gérez vos journaux comptables.

source: Prévisionnal budget
fr: Budget prévisionnel

source: result (profit)
fr: résultat (bénéfice)

source: result (deficit)
fr: résultat (déficit)

source: Add budget line
fr: Ajouter une ligne de budget

source: Modify budget line
fr: Modifier une ligne de budget

source: Delete Budget line
fr: Suprimer une ligne de budget

source: Edition of accounting entry for current fiscal year
fr: Edition d'écriture pour l'exercice courant

source: accounting entries
fr: écritures comptable

source: Filter
fr: Filtre

source: All
fr: Tout

source: In progress
fr: En cours (brouillard)

source: Valid
fr: Validée

source: Lettered
fr: Lettrée

source: Not lettered
fr: Non lettrée

source: Search accounting entry
fr: Recherche d'écritures

source: Listing accounting entry
fr: Liste d'écritures

source: Delete accounting entry
fr: Supprimer une écriture

source: Closed
fr: Valider

source: Close accounting entry
fr: Valider une écriture

source: Do you want to close this entry?
fr: Voulez-vous valider cette écriture?

source: Link/Unlink
fr: (dé)lettrage

source: Do you want unlink this entry?
fr: Voulez-vous annuler cette écriture?

source: Cost
fr: Analytique

source: cost accounting for entry
fr: analytique d'une écriture

source: Cancel
fr: Annuler

source: Show accounting entry
fr: Afficher une écriture

source: Add entry of account
fr: Ajouter une écriture

source: Modify accounting entry
fr: Modifier une écriture

source: Reverse
fr: Inverser

source: Validate entry line of account
fr: Valider une ligne d'écriture

source: Reverse entry lines of account
fr: Inverser des lignes d'écriture

source: Add payment entry of account
fr: Ajouter un réglement d'une écriture

source: Model
fr: Modèle

source: Select model of entry
fr: Sélectionner un modèle d'écriture

source: model name
fr: nom du modèle

source: factor
fr: facteur

source: Save entry line of account
fr: Sauver une ligne d'écriture

source: Modify entry line of account
fr: Modifier une ligne d'écriture

source: Delete entry line of account
fr: Suprimer une ligne d'écriture

source: Edition of costs accounting
fr: Edition des comptabilités analytiques

source: Show all cost accounting
fr: Voir toutes les comptabilités analytiques

source: Default
fr: Défaut

source: Close
fr: Fermer

source: Do you want to close this cost accounting?
fr: Voulez-vous clôturer cette comptabilité analytique?

source: Add cost accounting
fr: Ajouter une comptabilité analytique

source: Modify cost accounting
fr: Modifier une comptabilité analytique

source: Delete cost accounting
fr: Supprimer une comptabilité analytique

source: Edition of entry model
fr: Edition de modèle d'écriture

source: Add model of entry
fr: Ajouter un modèle d'écriture

source: Modify model of entry
fr: Modifier un modèle d'écriture

source: Show Model of entry
fr: Voir un modèle d'écriture

source: Delete Model of entry
fr: Supprimer un modèle d'écriture

source: Add model line of entry
fr: Ajouter une ligne de modèle

source: Modify model line of entry
fr: Modifier une ligne de modèle

source: Delete Model line of entry
fr: Suprimer une ligne de modèle

source: Accounting code starting with
fr: Code comptable commençant par

source: Show balance sheet for current fiscal year
fr: Consulter le bilan pour l'exercice courante

source: Balance sheet
fr: Bilan

source: Assets
fr: Actifs

source: Liabilities
fr: Passifs

source: Show income statement for current fiscal year
fr: Consulter le compte de résultats pour l'exercice courante

source: Income statement
fr: Compte de résultats

source: Show ledger for current fiscal year
fr: Consulter le grand livre pour l'exercice courant

source: Ledger
fr: Grand livre

source: Show trial balance for current fiscal year
fr: Consulter la balance pour l'exercice courant

source: Trial balance
fr: Balance

source: debit sum
fr: total des débits

source: credit sum
fr: total des crédits

source: Print report fiscal year
fr: Impression de rapport de l'exercice

source: Expenses
fr: Charges

source: Value
fr: Valeur

source: Last
fr: Précédente

source: Revenues
fr: Produits

source: Report
fr: Rapport

source: Income statement of cost accounting
fr: Compte de résultat de comptabilité analytique

source: Ledger of cost accounting
fr: Bilan de comptabilité analytique

source: Trial balance of cost accounting
fr: Compte de résultat de comptabilité analytique
