Repository: pypi-data/pypi-mirror-18
Catalog: packages/plone.app.imagecropping/plone.app.imagecropping-1.4.tar.gz/plone.app.imagecropping-1.4/src/plone/app/imagecropping/locales/*/LC_MESSAGES/plone.app.imagecropping.po
Languages: fi, nl, pt_br, ru

source: Available Image Fields
fi: Kuvalliset kentät
nl: Beschikbare afbeeldingsvelden
pt_br: Campos de imagem disponíveis
ru: Доступные поля изображений

source: Available Image Scales for Field: &quot;${field_name}&quot;
fi: Kuvakoot kentälle: &quot;${field_name}&quot;
nl: Beschikbare afbeeldingsschalen voor veld: &quot;${field_name}&quot;
pt_br: Escalas disponíveis para o Campo: &quot;${field_name}&quot;
ru: Доступные для использования размеры кадрирования изображений

source: Close
fi: Sulje
nl: Sluiten
pt_br: Fechar
ru: Закрыть

source: Crop Editor Large Size
fi: Rajauseditorin suurin kuvakoko
nl: Groot formaat bijsnijd editor
pt_br: Tamanho grande do editor de recortes
ru: Редактор кадрирования большого размера

source: Cropping
fi: Rajaus
nl: Bijsnijden
pt_br: Recorte
ru: Кадрирование

source: Cropping area deleted
fi: Poistettiin rajaus
nl: Bijsnijdinfo verwijderd
pt_br: Área de recorte apagada
ru: Кадрирование удалено

source: Enable Image Cropping
nl: Schakel afbeelding bijsnijden in

source: Enable to constrain croppable scales
fi: Rajoita rajattavia kuvakokoja
nl: Schakel in om de schalen te beperken die bij te snijden zijn.
pt_br: Habilitar restrição na área de recorte
ru: Включить ограничение для параметров кадрирования

source: Enable to reduce the scales shown for cropping in the list of scales with crop support.
fi: Valitse tämä, jos haluta rajoittaa, mitä kuvakokoja sivustolla saa rajata.
nl: Schakel in om de lijst met schalen te beperken die bij te snijden zijn.
pt_br: Ative para reduzir as escalas mostradas baseada na lista de escalas com suporte ao recorte.
ru: Активировать масштабирование размеров кадрирования.

source: Here you can define cropping areas for each scale of the available imagefields. This operation is non-destructive which means, your original image data doesn't get lost when cropping a scale. By removing a cropping area, the scale gets back to its default functionality: resize, no crop.
fi: Valitse haluamasi kuvakoko, rajaa kuva ja tallenna rajaus. Kuvan rajaaminen ei muuta alkuperäistä kuvaa ja voit korjata rajausta koska tahansa. Jokaisen kuvakoon voi rajata erikseen.
nl: Hier kan je voor elke schaal van de beschikbare afbeeldingsvelden de basisafbeelding bijsnijden. De oorspronkelijke afbeelding blijft bewaard. Door bijsnijdinfo weer te verwijderen, krijgt de schaal zijn oorspronkelijke functionaliteit: de grootte wordt geschaald zonder de afbeelding bij te snijden.
pt_br: Aqui você pode definir áreas de recorte para cada escala dos campos de imagem disponíveis. Esta operação não é destrutiva, o que significa que os dados das imagem originais não serão perdidos quando realizar o recorte de uma escala. Ao remover a área de recorte, a escala recebe de volta à sua funcionalidade padrão: redimensionar, sem corte
ru: Здесь вы можете определить области кадрирования для каждого поля с изображением. Эта операция не изменит оригинальный размер картинки и данные не будут потеряны. После удаления области кадрирования, изображение вернется к исходному состоянию

source: Image Cropping Editor
fi: Kuvanrajauseditori
nl: Afbeelding bijsnijd editor
pt_br: Editor de recorte de imagens
ru: Редактор кадрирования изображений

source: Image Cropping Settings
fi: Kuvien rajauksen asetukset
nl: Afbeelding bijsnijd instellingen
pt_br: Configuração do editor de recorte de imagens
ru: Настройки кадрирования изображений

source: Installs the plone.app.imagecropping package
nl: Installeert het plone.app.imagecropping pakket

source: List of scales with crop support
fi: Rajattavissa olevat kuvakoot
nl: Lijst van schalen die bijgesneden kunnen worden
pt_br: Lista de escalas com suporte ao recorte
ru: Список параметров кадрирования с поддержкой обрезки

source: Minimum Crop Area Size
fi: Pienin rajattava kuvakoko
nl: Minimum bijsnijd gebiedsgrootte
pt_br: Tamanho da área mínima de recorte
ru: Минимальный размер кадрирования

source: Provides imagecropping functionality for DX contenttypes
nl: Geeft afbeeldingsbijsnijd functionaliteit aan dexterity contenttypes

source: Remove cropping information
fi: Poista rajaus
nl: Verwijder bijsnijdinformatie
pt_br: Remove a informação da área de corte
ru: Удалить информацию о кадрировании

source: Save cropping information
fi: Rajaa kuva
nl: Bewaar bijsnijdinformatie
pt_br: Salva a informação da área de corte
ru: Сохранить информацию о кадрировании

source: Save this cropping area for the selected scale.
fi: Tallentaa tämän tämän kuvakoon rajauksen.
nl: Bewaar dit bijsnijdgebied voor de geselecteerde schaal.
pt_br: Salva a área de corte baseada em uma escala selecionada
ru: Сохранить этот вариант кадрирования.

source: Select the scales with cropping support enabled. Only active if enabled with checkbox.
fi: Valitse ne kuvakoot, joissa rajaus on sallittu, kun rajattavien kuvakokojen rajoitus on valittu.
nl: Selecteer de schalen die je wil kunnen bijsnijden. Alleen actief indien aangevinkt.
pt_br: Seleciona as escalas com suporte a área de corte habilitado. Somente se a marcação estiver ativada.
ru: Выберите параметры кадрирования, поддержка для которых будет включена.

source: Steps to ease tests of plone.app.imagecropping
nl: Stappen om het testen van plone.app.imagecropping makkelijker te maken

source: Successfully saved cropped area
fi: Kuvakoko rajattu onnistuneesti.
nl: Bijsnijdgebied succesvol bewaard
pt_br: Área recortada salva com sucesso
ru: Кадрирование сохранено.

source: The selected scale gets reverted to the default behaviour: resize, no crop.
fi: Poistaa tältä kuvakoolta rajauksen.
nl: De geselecteerde schaal gaat terug naar de oorspronkelijke functionaliteit: de grootte wordt geschaald zonder de afbeelding bij te snijden.
pt_br: A escala selecionada será revertida para o padrão: redimensionar, sem crote.
ru: Сброс кадрирования: исходное состояние, без обрезки.

source: Uninstalls resources from the plone.app.imagecropping package
nl: Deïnstalleert het plone.app.imagecropping pakket

source: View the image cropping editor for this object
fi: Rajaa kuvaa
nl: Bekijk de afbeelding bijsnijd editor voor dit object
pt_br: Ver o editor de recorte de imagens para esse objeto
ru: Показать редактор кадрирования для этого объекта

source: Your changes will be lost. Continue?
fi: Haluatko menettää tekemästi muutokset?
nl: Je wijzigingen zullen verloren gaan. Doorgaan?
pt_br: As alterações serão perdidas. Continuar?
ru: Ваши изменения будут утрачены. Продолжить?

source: cropped
fi: rajattu
nl: bijgesneden

source: no image available
fi: Kuvaa ei löytynyt.
nl: geen afbeelding beschikbaar
pt_br: não tem imagem disponível
ru: нет доступных изображений

source: noscales_message
fi: Sivustolla ei ole määritetty kuvakokoja. Määritä kuvakoot osoitteessa ${link}.
nl: Er zijn geen schalen om bij te snijden. Voeg ze toe aan de ${link} in het controlepaneel.

source: plone.app.imagecropping Uninstallation
nl: plone.app.imagecropping deïnstallatie

source: uncropped
fi: rajaamaton
nl: niet bijgesneden

source: width:height
fi: leveys:korkeus
nl: breedte:hoogte
pt_br: largura:altura
ru: ширина:высота
